[
  {
    "source": "PBS NewsHour",
    "title": "Americans are more worried about their chances on the job market under Trump, AP-NORC poll finds",
    "link": "https://www.pbs.org/newshour/economy/americans-are-more-worried-about-their-chances-on-the-job-market-under-trump-ap-norc-poll-finds",
    "pub_date": "2025-10-19T18:45:23-04:00",
    "snippet": "Some 47% of U.S. adults are \"not very\" or \"not at all confident\" they could find a good job if they wanted to, an increase from 37% when the question was last asked in October 2023.",
    "content": "WASHINGTON (AP) - Americans are growing increasingly concerned about their ability to find a good job under President Donald Trump, an Associated Press-NORC Center for Public Affairs Research poll finds, in what is a potential warning sign for Republicans as a promised economic boom has given way to hiring freezes and elevated inflation. High prices for groceries, housing and health care persist as a fear for many households, while rising electricity bills and the cost of gas at the pump are also sources of anxiety, according to the survey. Some 47% of U.S. adults are \"not very\" or \"not at all confident\" they could find a good job if they wanted to, an increase from 37% when the question was last asked in October 2023. : Without a new jobs report, U.S. 'flying blind' on hiring in an uncertain economy Electricity bills are a \"major\" source of stress for 36% of U.S. adults at a time when the expected build-out of data centers for artificial intelligence could further tax the power grid. Just more than one-half said the cost of groceries are a \"major\" source of financial stress, about 4 in 10 said the cost of housing and health care were a serious strain and about one-third said they were feeling high stress about gasoline prices. The survey suggests an ongoing vulnerability for Trump, who returned to the White House in January with claims he could quickly tame the inflation that surged after the pandemic during Democratic President Joe Biden's term. Instead, Trump's popularity on the economy has remained low amid a mix of tariffs, federal worker layoffs and partisan sniping that has culminated in a government shutdown."
  },
  {
    "source": "PBS NewsHour",
    "title": "Fact-checking Trump's claim that each boat strike off Venezuela's coast saves 25,000 lives",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-claim-that-each-boat-strike-off-venezuelas-coast-saves-25000-lives",
    "pub_date": "2025-10-19T15:27:57-04:00",
    "snippet": "President Donald Trump said U.S. military strikes on five Venezuelan boats have saved more than 100,000 lives because the maneuvers thwarted drug smuggling. Several aspects of Trump's statement make it wrong.",
    "content": "President Donald Trump said U.S. military strikes on five Venezuelan boats have saved more than 100,000 lives because the maneuvers thwarted drug smuggling. \"Every boat that we knock out we save 25,000 American lives so every time you see a boat and you feel badly you say, 'Wow, that's rough;' It is rough, but if you lose three people and save 25,000 people,\" Trump said in an Oct. 15 press conference. The administration did not supply PolitiFact with evidence that the boats were carrying drugs. Drug experts told PolitiFact that Venezuela plays a minor role in trafficking drugs that reach the U.S. The legality of the strikes also is unclear. After the first attack, some legal experts told PolitiFact that the military action was illegal under maritime law or human rights conventions and the attack contradicted longstanding U.S. military practices. Trump has used the figure repeatedly and also says he would consider similar strikes on land. WATCH: Trump weighs land strikes in Venezuela following attacks on suspected drug boats \"Every one of those boats is responsible for the death of 25,000 American people, and the destruction of families,\" Trump said in an Oct. 5 speech to U.S. Navy sailors. \"So when you think of it that way, what we're doing is actually an act of kindness.\" \"We've taken a very hard stand on drugs ... the water drugs - the drugs that come in through water they're not coming - there are no boats anymore, frankly there are no fishing boats, there's no boats out there period,\" Trump told Canadian Prime Minister Mark Carney on Oct. 7. \"We've probably saved at least 100,000 lives, American lives, Canadian lives, by taking out those boats.\" Several aspects of Trump's statement make it wrong. There is no way of knowing how many lives are saved as a result of drug interception efforts, drug experts have told PolitiFact. Additionally, if Trump's statement were accurate, the strikes on five boats in less than two months would have saved nearly double the number of U.S. lives lost to drug overdoses in an entire year. The Trump administration hasn't specified what type of drug or what quantity was on the boats that were struck. So it's impossible to calculate how many deadly doses could have been destroyed. Trump said the boats were carrying fentanyl during the Oct. 15 press conference. \"And you can see it, the boats get hit, and you see that fentanyl all over the ocean,\" Trump said. \"It's like floating in bags. It's all over the place.\" He has shared aerial videos of some of the boat strikes on Truth Social, and no bags of drugs are visible in the videos. Additionally, most illicit fentanyl in the U.S. comes from Mexico, not Venezuela. It enters the U.S. mainly through the southern border at official ports of entry, and it's smuggled in mostly by U.S. citizens, according to the U.S. Sentencing Commission. If the boats each carried 25,000 lethal doses, that doesn't mean the strikes stopped 125,000 people from dying of a drug overdose. \"When drugs are seized, the supply chain partially replaces those lost drugs,\" Jonathan Caulkins, a Carnegie Mellon University drug policy researcher, previously told PolitiFact. Overdose drug deaths have been declining for the past couple of years, before there were any strikes on boats off the coast of Venezuela, according to provisional data from the Centers for Disease Control and Prevention. The CDC reported more than 73,000 drug overdose deaths from May 2024 to April 2025. For Trump's statement to be accurate, the drugs on five boats would have been responsible for 125,000 deaths, nearly double the number of overdose deaths in one year. Trump isn't the first person to equate drug enforcement with saving lives. Over the years, we've fact-checked other politicians when they said that a quantity of drugs seized at the U.S. border was enough to kill a specific number of people, or that those seizures saved a specific number of lives. Generally, the politicians we have fact-checked referred to fentanyl seizures. The synthetic opioid is the leading cause of U.S. overdose deaths. Politicians' statements about lives saved rely on the lethal dose for fentanyl - 2 milligrams. So if authorities seized 10 milligrams of fentanyl, for example, that saved five lives, politicians say. But there are caveats to that calculation because a dose's lethality can vary based on a person's height, weight and tolerance from past exposure, drug experts say. And statistics about how many drugs were stopped from entering the U.S. don't account for how many drugs make it into the country. \"We don't have any method I'm aware of for translating drug seizure data into any measure of overdose deaths averted,\" Alene Kennedy-Hendricks, a Johns Hopkins University health policy expert, told PolitiFact in May. Regarding boat strikes off the coast of Venezuela, Trump said, \"Every boat that we knock out we save 25,000 American lives.\" Trump said the five boats the U.S. military has struck off the coast of Venezuela were carrying drugs heading to the U.S. However, experts on drugs and Venezuela told PolitiFact the country plays a minor role in trafficking drugs that reach the U.S. The administration has provided no evidence about the type or quantity of drugs it says were on the boats. This lack of information makes it impossible to know how many lethal doses of the drugs could have been destroyed. Even if the boats were carrying 25,000 lethal drug doses each, that doesn't mean that destroying them saved 125,000 lives. There were 73,000 U.S. drug overdose deaths from May 2024 to April 2025. That means the drugs on five boats would have been responsible for 125,000 deaths, nearly double the number of U.S. overdose deaths in one year. The amount of drugs that are stopped from entering the U.S. doesn't indicate how many lives were saved. We rate Trump's statement Pants on Fire! ​"
  },
  {
    "source": "PBS NewsHour",
    "title": "Bolivia holds tight presidential runoff as voters seek a leader to lift them from crisis",
    "link": "https://www.pbs.org/newshour/world/bolivia-holds-tight-presidential-runoff-as-voters-seek-a-leader-to-lift-them-from-crisis",
    "pub_date": "2025-10-19T13:46:46-04:00",
    "snippet": "Bolivians voted on Sunday in an unprecedented presidential runoff between two conservative, capitalist candidates, ushering in a new political era after almost 20 years of one-party rule by the Movement Toward Socialism party.",
    "content": "LA PAZ, Bolivia (AP) - Bolivians voted on Sunday in an unprecedented presidential runoff between two conservative, capitalist candidates, ushering in a new political era after almost 20 years of one-party rule by the Movement Toward Socialism party. Voters are choosing between former right-wing President Jorge \"Tuto\" Quiroga and centrist Sen. Rodrigo Paz as they look for a leader to lift them out of their country's worst economic crisis in decades. : Bolivia heads to a runoff election after upset ends decades of ruling party dominance Since 2023, the Andean nation has been crippled by a shortage of U.S. dollars that has locked Bolivians out of their own savings and hampered imports. Year-on-year inflation soared to 23% last month, the highest rate since 1991. Fuel shortages paralyze the country. Quiroga and Paz have vowed to break with the budget-busting populism that dominated Bolivia under the Movement Toward Socialism, or MAS, party founded by Evo Morales, a charismatic coca growers' union leader who became Bolivia's first Indigenous president in 2006. \"We are living in a time of change and renewal,\" Paz told supporters as he cast his ballot in his hometown of Tarija, alongside his father, former President Jaime Paz Zamora. \"We are closing one cycle and opening another.\" The promise of change has energized some voters. \"Since 2005 we haven't had any real options, so this is exciting for me,\" said high school teacher Carlos Flores, 41, who was waiting to vote for Paz. Riven by internal divisions and battered by public anger over fuel lines, MAS suffered a historic defeat in the Aug. 17 elections that propelled Quiroga and Paz to the dead-heat runoff. Paz beat Quiroga but without enough votes to avoid a second round. Both candidates have promised to end Bolivia's fixed exchange rate, restructure state-owned companies and lure foreign investment. Among the factors that most distinguish them is how far and fast they propose pushing their reforms. Quiroga wants to get dollars flowing into Bolivia immediately with a big rescue package from the International Monetary Fund and other multilateral lenders. That would demand savage cuts in state spending, such as slashing fuel subsidies, shrinking the public payroll and cutting the state out of Bolivia's gas and mining businesses. He has run for president three times before but never made it this far. \"What's interesting is that even though Quiroga puts very drastic measures on the table, he has considerable support,\" said Gustavo Flores-Macías, dean of the School of Public Policy at the University of Maryland. \"It shows that a good share of Bolivians are just so tired of the crisis, the currency difficulties, the fuel shortages, that they're willing to support someone who says there will be pain before things get better.\" Paz favors a more cautious approach. He says he'll phase out fuel subsidies gradually and provide MAS-style social protections like cash handouts to cushion the blow. Shunning the IMF - an organization viewed with contempt in Bolivia during the nearly two decades of left-wing rule - Paz promises to scrape together dollars by legalizing Bolivia's black market and fighting corruption. Although Paz has spent more than two decades in politics as a lawmaker and mayor, he emerged as something of a political unknown in the August vote. His popularity, experts say, was further buoyed by the outsider status of his running mate, ex-police Capt. Edman Lara, who was fired from the force in 2023 for denouncing corruption in viral TikTok videos that drew a huge following. Many are former MAS supporters who appreciated the party's egalitarian ethos, but soured on its taxes and regulation. The pair mounted a fast-paced underdog campaign, crisscrossing cities and rural communities to throw beer-soaked, no-frills events with the message of \"capitalism for all.\" They played up their contrast with the wealthy Quiroga and his large campaign war chest, portraying their rival as part of Bolivia's elite political establishment. Quiroga briefly served as president from 2001-2002, after his predecessor Hugo Banzer fell ill and stepped down. \"The socioeconomic backgrounds of the leadership and, ultimately, of the voters, are very different. There's a divide between those with greater economic access and those with less,\" said Verónica Rocha, a Bolivian political analyst. Quiroga appeals more to the industrialists and business leaders in the crucial agriculture sector, and Paz to the merchants, micro-entrepreneurs and self-employed, she said. The next president faces a task that's about as simple as running a marathon in Bolivia's highlands - altitude: 4,150 meters (13,600 feet). In the heady early days of Morales' long tenure (2006-2019), a boom in natural gas exports underwrote the state's unbridled spending. Now, gas exploration and production has collapsed. But Bolivia continues to splurge to keep fuel practically free, paying $2 billion last year on the subsidies. Previous attempts to lift the subsidies didn't go well: Morales' bid to lift fuel subsidies in 2011 lasted less than a week as mass protests engulfed the country. Public transportation unions have already threatened to ignite unrest if fuel subsidies are eliminated. Widespread disillusionment over the scope of the crisis has led many Bolivians to believe that all politicians have failed them and left around 10% of voters undecided, according to recent polls. \"Every candidate promises and promises, but when they get to power, they forget about the people,\" said Javier Quisbert, 40, who emerged from a polling station Sunday saying that he spoiled his ballot just to avoid a punitive fine. Voting is compulsory for Bolivia's nearly 8 million eligible voters. \"There's no life anymore in Bolivia,\" Quisbert said. Whoever wins, the end of MAS after around 20 years of hegemony will trigger a major economic and geopolitical realignment that could reverberate across the continent. The candidates say they'll welcome foreign investment and encourage private enterprise in Bolivia, which has the world's greatest lithium resources. The election also means a shift away from Bolivia's current allies, China and Russia, and toward the United States, after decades of anti-American hostility. Both Quiroga and Paz flew to Washington to meet with IMF and Trump administration officials. \"Both candidates running in the runoff election want strong and better relations with the United States, so that's another transformative opportunity,\" U.S. Secretary of State Marco Rubio said at a news conference Tuesday as U.S. President Donald Trump welcomed Argentine President Javier Milei, a close ally, to the White House. \"Like Bolivia, there are numerous other countries coming our way,\" Trump said."
  },
  {
    "source": "Swimming World Magazine",
    "title": "Cal Baptist Men Repeat, Rice Women Win MPSF Open Water Championships",
    "link": "https://www.swimmingworldmagazine.com/news/cal-baptist-men-repeat-rice-women-win-mpsf-open-water-championships/",
    "pub_date": "2025-10-19T21:31:59+00:00",
    "snippet": "Cal Baptist Men Repeat, Rice Women Win MPSF Open Water Championships The Cal Baptist men's team won its second straight MPSF Open Water Championship on Saturday, while the Rice women The post Cal Baptist Men Repeat, Rice Women Win MPSF Open Water Championships appeared first on Swimming World .",
    "content": "Cal Baptist Men Repeat, Rice Women Win MPSF Open Water Championships\n\nThe Cal Baptist men's team won its second straight MPSF Open Water Championship on Saturday, while the Rice women claimed their first title.\n\nCBU scored 135 points to lift the title again at Marine Stadium in Long Beach, California at the conference's third staging of the event. The Lancers' score included a win in the men's 2,000-meter relay. Second in the team standings with 110 points was Grand Canyon, while Whittier College's 101 points edged BYU for third place.\n\nRice scored 148 points, tops among 17 scoring programs on the women's side. Washington State was second with 118, followed by 89 points for Cal Baptist in finishing third.\n\nThe gold medal in the men's race went to Whittier's Thomas Langlois, who covered the 5,000 meters in 59 minutes, 6.41 seconds. It took breaking an hour to get on the podium, with Cal Baptist's Mark Kovacsics second in 59:07.15, then Batu Servi of Grand Canyon.\n\nCBU placed four in the top eight, though only three score. Holden Short was fifth, Cody Meyer seventh and Fernando Manceras eighth. UC Santa Barbara got a fourth-place finish from Connor Martilla. Wojciech Chalat of Quincy University was sixth.\n\nThe Lancers' relay team of Kovacsics, Short, Andrew Teh and Eli Rollen went 24:30.02, besting BYU's quartet of Darwin Anderson, Easton Mousser, Tanner Nelson and Dan Weber by five minutes. Anderson, who finished ninth in the 5,000, was BYU's top individual finisher. Grand Canyon was third in the relay.\n\nOn the women's side, Rice ran away with the title via a 1-2 finish. Ella Dyson, who has twice won the CSCAA open water individual title, added another trophy to the cabinet by going 1:01:21.0 to win. She finished 59 seconds ahead of teammate Ava Portello.\n\nRice's third scorer was Ava Hamblett in fifth place in 1:03:34.0, with teammate Renee Tan seventh for good measure.\n\nThird place went to Kyra Rabess of Northern Colorado in 1:03:13.0. Washington State's Sophie Hay was fourth, with teammate Tatum Janning sixth. New Mexico State's Estel Galo Nogueira secured eighth place.\n\nRice rolled in the 2,000-meter relay, winning by 42 seconds. Dyson, Portello, Hamblett and Mollie McAlorum comprised that squad. Washington State was second with Hay, Janning, Vivien Nett and Avery Bulkley. BYU finished third."
  },
  {
    "source": "Swimming World Magazine",
    "title": "Celtics Star Jaylen Brown Details Partnership with Dara Torres, Boston College",
    "link": "https://www.swimmingworldmagazine.com/news/celtics-star-jaylen-brown-details-partnership-with-dara-torres-boston-college/",
    "pub_date": "2025-10-19T21:07:54+00:00",
    "snippet": "Celtics Star Jaylen Brown Details Partnership with Dara Torres, Boston College Celtics All-Star forward Jaylen Brown incorporated an aquatic regimen to his offseason this year, working with Boston College coach The post Celtics Star Jaylen Brown Details Partnership with Dara Torres, Boston College appeared first on Swimming World .",
    "content": "Celtics Star Jaylen Brown Details Partnership with Dara Torres, Boston College\n\nCeltics All-Star forward Jaylen Brown incorporated an aquatic regimen to his offseason this year, working with Boston College coach Dara Torres.\n\nBrown discussed the training during a recent interview with NBC Sports Boston on the Celtics preseason media day.\n\nCeltics athletic trainer Drew Moore reached out to BC to see if someone on Torres' staff would be interested in helping one of their players. It turned out to be Brown, the four-time All-Star and 2024 NBA Finals MVP.\n\nTorres, a 12-time Olympic medalist about to start her second season as the head coach of the Eagles' men's and women's teams, volunteered. She worked first with Brown in a therapy pool at the Celtics' Auerbach Center team complex before relocating to BC's Margot Connell Recreation Center pool about two miles away.\n\nBrown went from a couple of workouts with Torres and assistant coach Chris Morgan to several weeks of multiple days of training.\n\n\"Just to perfect my form in the water,\" Brown said. \"Try to master your efficiency, no wasted movement. I feel like the better swimmer you are is an analogy to life. You don't want no wasted movement, no drag, no extra. You want to just be able to get from Point A to Point B as easy as possible.\"\n\nBrown, who turns 29 this month, stands 6-6 and 223 pounds. He's been remarkably durable in his NBA career since the Celtics took him No. 3 overall in the 2016 NBA Draft out of Cal, playing in at least 57 games in all nine of his pro seasons, though he was recovering this summer from surgery to repair a partially torn meniscus in his knee.\n\nHe averaged 22.2 points, 5.8 rebounds and 4.5 assists in 63 games last season, perhaps somewhat hampered by the meniscus. He has averaged 19.3 points in 135 career playoff games, winning an NBA title in 2024.\n\nHe and Torres worked on learning new techniques with apparatuses like fins and snorkels. Torres was impressed by his aerobic capacity to start with as well as his attention to detail. Brown had a fixation on making sure he was improving his technique in each workout.\n\n\"He could see the mistakes that he made at the beginning, and then the corrections that he made afterwards,\" Torres said. \"You can see how much more efficient he was as he made those changes.\"\n\nVideo of Brown's training and his interview is available at NBC Sports Boston."
  },
  {
    "source": "Swimming World Magazine",
    "title": "World Cup Westmont - Day Three Prelims: Gretchen Walsh Closes in on Another Record Swim",
    "link": "https://www.swimmingworldmagazine.com/news/world-cup-westmont-day-three-prelims-gretchen-walsh-closes-in-on-another-record-swim/",
    "pub_date": "2025-10-19T15:48:20+00:00",
    "snippet": "World Cup Westmont - Day Three Prelims: Gretchen Walsh Closes in on Another Record Swim The final day of the World Cup stop in Westmont will unfold on Sunday, with The post World Cup Westmont - Day Three Prelims: Gretchen Walsh Closes in on Another Record Swim appeared first on Swimming World .",
    "content": "World Cup Westmont - Day Three Prelims: Gretchen Walsh Closes in on Another Record Swim\n\nThe final day of the World Cup stop in Westmont will unfold on Sunday, with the series then shifting to Toronto for its final leg. Action in the Chicago suburbs has been sensational, highlighted on Saturday night by world records from Mollie O'Callaghan in the 200-meter freestyle and Regan Smith in the 100 backstroke.\n\nDuring the Sunday morning prelims, O'Callaghan will be back in the water for the 100 freestyle and Smith will race the 200 backstroke. On the men's side, Canadian Ilya Kharun has enjoyed a strong first two days in Westmont, claiming victories in the 50 freestyle and 200 butterfly. He's now set to contest the 50 butterfly, an event he won last week in Carmel.\n\nHere is an event-by-event recap of the Day Three prelims:\n\nThe 400 IM is a timed final at the World Cup so the fastest heat based on entry times will swim in the finals.\n\nIn the earlier heats, Australia's Brendon Smith was the fastest of the morning, getting to the wall in 4:07.36.\n\nLucas Henveaux followed with a 4:08.56.\n\nThere was an 11-second gap from Henveaux to the rest of the field.\n\nWorld record holder Gretchen Walsh took the top seed in the 100 fly, predictably, in 54.28. The time is less than a second off the World Cup record she swam last week in Carmel.\n\nHer world record time is 52.71.\n\nAustralia's Alex Perkins took the second seed in 56.01, ahead of Belgium's Roos VanOtterdijk (56.90) and Finland's Laura Lahtinen (56.92), who all broke 57 seconds.\n\nAustralia's Olivia Wunsch took the fifth seed in 57.10, followed by Ireland's Ellen Walshe (57.43), New Zealand's Vanessa Ouwehand (57.75) and Australia's Brittany Castelluzzo (58.00).\n\nCanada's Ilya Kharun put together a strong back-half of the race to touch the wall in 22.04 and take the top seed.\n\nWorld Record holder Noe Ponti from Switzerland took the second seed in 22.18. He holds the World Cup record at 21.50 and the world record (SCM) in 21.32.\n\nFinlay Brooks took the third seed in 22.22, followed by Canada's Josh Liendo (22.23), Singapore's Tzen Wei Teong (22.44), Trinidad and Tobago's Dylan Carter (22.62) - and a tie for the seventh seed with Ralf Tribuntsov and Simone Stefani at 22.63.\n\nWorld record holder Regan Smith grabbed the top seed in the 200 backstroke, but not by much, and the field looks to bring perhaps the most interesting final tonight.\n\nSmith took the top seed in 2:03.12 - four seconds off her World Cup record and nearly five off her world record - but it was just one hundredth of a second ahead of Miranda Grana (2:03.13) and that doesn't include Olympic medalists Phoebe Bacon (2:03.55) and Kaylee McKeown (2:03.77) looming.\n\nAustralia's Hannah Fredericks took the fifth spot in 2:03.99, followed by Anastasiya Shkurdai (2:04.23), Canada's Madison Kryger (2:04.62) and USA's Rhyan White (2:04.81).\n\nHungary's Hubert Kos was out strong and hung on to take the top seed in the 100 backstroke, getting to the wall in 50.22.\n\nCanada's Finlay Knox was also sub-51, turning in a time of 50.85.\n\nAustralia's Enoch Robb was just behind with a 51.02, followed by Kacper Stokowski (51.06), Italy's Thomas Ceccon (51.13), Miroslav Knedla (51.28), Poland's Ksawery Masiuk (51.34) and Grant Bochenski (51.61).\n\nBelgium's Florine Gaspard took a narrow lead into the turn and held on to take the top seed 29.79.\n\nIreland's Mona McSharry was just behind in 29.91, also under 30 seconds.\n\nCanada's Sophie Angus took the third seed (30.16), Skyler Smith (30.22), Israel's Anastasia Gorbenko (30.29), Hungary's Henrietta Fangli (30.48), Emelie Fast (30.48) and Japan's Satomi Suzuki (30.56).\n\nCaspar Corbeau of the Netherlands took the top seed by more than a second, getting to the wall in 2:04.07.\n\nDavid Schlicht took the second spot in 2:05.37, followed by USA's Josh Matheny (2:05.63).\n\nSpain's Carles Coll Marti took fourth in 2:05.72, followed by a trio of Japanese swimmers - Shin Ohashi (2:05.95), Ippel Watanabe (2:05.97) and Yamato Fukasawa (2:06.20).\n\nIlya Shymanovich took the last finals spot in 2:06.49, just ahead of Great Britain's Adam Peaty (2:06.96).\n\nUSA's Kate Douglass took the top seed in the 100 free, cruising to the wall in 51.27 after an opening 50 of 24.39.\n\nAustralia's Olivia Wunsch was a second behind at 52.26, followed by strong race from Canadian Olympian Taylor Ruck (52.30).\n\nMarrit Steenbergen of the Netherlands took the fourth spot in 52.35, ahead of Polish Olympic medalist Kasia Wasick (52.41) and Italy's Sarah Curtis (52.43).\n\nAustralia's Mollie O'Callaghan took the seventh spot in 52.49 and USA's Anna Peplowski rounded out the finalists in 52.71.\n\nUSA's Chris Guiliano battled his way to the top seed with a 1:42.13 as just a second was the difference between spots 1-8.\n\nGreat Britain's Matthew Richards took the second seed in 1:42.38, ahead of USA's Luke Hobson (1:42.55). Hobson set the world record (SCM) in the event last year in Budapest.\n\nBelgium's Lucas Henveaux took the fourth seed in 1:42.59, followed by USA's Patrick Sammon (1:42.76), Grant House (1:42.84), Brooks Curry (1:43.09) and Kieran Smith (1:43.16).\n\nSouth Africa's Rebecca Meder claimed the top spot in the 200 IM, getting to the wall in 2:07.58.\n\nUSA's Alex Walsh took the second spot in 2:08.11, ahead of Israel's Anastasia Gorbenko (2:08.37), Great Britain's Abbie Wood (2:08.49), USA's Phoebe Bacon (2:08.82), while Japan's Mio Narita (2:09.00), Ireland's Ellen Walshe (2:09.01) and GB's Freya Colbert (2:09.26) rounded out the top eight.\n\nI get paid over 220 Dollars per hour working from home with 2 kids at home. i never thought i'd be able to do it but my best friend earns over 15k a month doing this and she convinced me to try. it was all true and has totally changed my life. This is what I do, check it out by Visiting Following Website...W­w­w­.­C­a­s­h­p­r­o­f­i­t­7­.­s­i­t­e"
  },
  {
    "source": "TechRadar",
    "title": "Meta joins Nvidia, OpenAI, and AMD to launch Ethernet for Scale Up Network - ESUN competes with InfiniBand but will work with Ultra Ethernet Consortium",
    "link": "https://www.techradar.com/pro/meta-joins-nvidia-openai-and-amd-to-launch-ethernet-for-scale-up-network-esun-competes-with-infiniband-but-will-work-with-ultra-ethernet-consortium",
    "pub_date": "2025-10-19T21:37:00+00:00",
    "snippet": "A new OCP initiative unites major tech firms to develop open Ethernet standards for AI data centers, challenging InfiniBand's dominance.",
    "content": "The Open Compute Project (OCP) has announced a new initiative known as Ethernet for Scale-Up Networking (ESUN), aimed at developing open standards for high-performance connections within artificial intelligence clusters.\n\nThis collaboration brings together companies such as Meta, Nvidia, AMD, Cisco, and OpenAI to explore how Ethernet can rival existing interconnects like InfiniBand in large-scale data centers.\n\nOther companies joining the collaboration include Arista, ARM, Broadcom, HPE Networking, Marvell, Microsoft, and Oracle.\n\nInfiniBand has long dominated the market for high-speed AI networking, accounting for roughly 80% of the infrastructure connecting GPUs and accelerators.\n\nHowever, the ESUN group believes that Ethernet's maturity, cost-effectiveness, and interoperability make it a strong candidate for scaling up AI clusters.\n\nUnlike proprietary systems, Ethernet's widespread familiarity among engineers could help reduce complexity in managing massive AI workloads.\n\nSupporters argue that using Ethernet as an open standard will allow operators to scale infrastructure while lowering costs.\n\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\n\nOCP's new AI tools initiative builds on earlier work under its SUE-Transport (SUE-T) program, which explored Ethernet transport for multi-processor systems.\n\nESUN's participants will meet regularly to define standards for switch behavior, including protocol headers, error handling, and lossless data transfer.\n\nThe group will also study how network design affects load balancing and memory ordering within GPU-based systems.\n\nIt plans to coordinate with the Ultra Ethernet Consortium and the IEEE 802.3 standards body to ensure alignment across the wider Ethernet ecosystem.\n\nSeveral firms have already developed Ethernet-based products targeting AI scale-up - Broadcom's Tomahawk Ultra switch, for example, supports up to 77 billion packets per second, and Nvidia's Spectrum-X platform also combines Ethernet with acceleration hardware for AI clusters.\n\nHowever, Meta, which co-founded OCP in 2011, views ESUN as a natural extension of its push for open hardware within data centers.\n\nEven so, observers note that replacing established InfiniBand networks would require Ethernet to prove itself under the most demanding AI workloads, where latency and reliability are critical.\n\nESUN's success will depend on balancing openness with performance. Advocates see a future where AI systems run on interoperable hardware using standardized Ethernet technologies.\n\nYet, given the scale and sensitivity of AI infrastructure, it remains uncertain whether industry momentum will shift decisively away from proprietary interconnects.\n\nFor now, ESUN represents an ambitious effort, and whether it can match InfiniBand's performance remains to be seen.\n\nFollow TechRadar on Google News and add us as a preferred source to get our expert news, reviews, and opinion in your feeds. Make sure to click the Follow button!\n\nAnd of course you can also follow TechRadar on TikTok for news, reviews, unboxings in video form, and get regular updates from us on WhatsApp too.\n\nEfosa has been writing about technology for over 7 years, initially driven by curiosity but now fueled by a strong passion for the field. He holds both a Master's and a PhD in sciences, which provided him with a solid foundation in analytical thinking.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPlease login or signup to comment\n\nPlease wait..."
  },
  {
    "source": "TechRadar",
    "title": "Oracle claims to have the largest AI supercomputer in the cloud with 16 zettaFLOPS of peak performance, 800,000 Nvidia GPUs",
    "link": "https://www.techradar.com/pro/oracle-claims-to-have-the-largest-ai-supercomputer-in-the-cloud-with-16-zettaflops-of-peak-performance-800-000-nvidia-gpus",
    "pub_date": "2025-10-19T20:18:00+00:00",
    "snippet": "Oracle unveils Zettascale10, a claimed 16 zettaFLOP cloud AI supercomputer using 800,000 Nvidia GPUs with advanced RoCE networking architecture.",
    "content": "Oracle has announced what it calls the largest AI supercomputer in the cloud, the OCI Zettascale10.\n\nThe company claims the system can deliver 16 zettaFLOPS of peak performance across 800,000 Nvidia GPUs.\n\nThat output, when divided, equals about 20 petaflops per GPU, roughly matching the Grace Blackwell GB300 Ultra chip used in high-end desktop AI systems.\n\nOracle says the platform is the foundation for OpenAI's Stargate cluster in Abilene, Texas, built to handle some of the most demanding AI workloads now emerging in research and commercial use.\n\n\"The highly scalable custom RoCE design maximizes fabric-wide performance at gigawatt scale while keeping most of the power focused on compute...,\" said Peter Hoeschele, vice president, Infrastructure and Industrial Compute, OpenAI.\n\nAt the core of the Zettascale10 system is Oracle Acceleron RoCE networking, designed to increase scalability and reliability for data-heavy AI operations.\n\nThis architecture uses network interface cards as mini switches, linking GPUs across several isolated network planes.\n\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\n\nThe design aims to reduce latency between GPUs and allow jobs to continue running if one network path fails.\n\n\"Featuring Nvidia full-stack AI infrastructure, OCI Zettascale10 provides the compute fabric needed to advance state-of-the-art AI research and help organizations everywhere move from experimentation to industrialized AI,\" said Ian Buck, vice president of Hyperscale, Nvidia.\n\nOracle claims this structure can lower costs by simplifying tiers within the network while maintaining consistent performance across nodes.\n\nIt also introduces Linear Pluggable and Receiver Optics to reduce energy and cooling use without cutting bandwidth.\n\nAlthough Oracle's figures are impressive, the company has not provided independent verification of its 16 zettaFLOPS claim.\n\nCloud performance metrics can vary depending on how throughput is calculated, and Oracle's comparison may rely on theoretical peaks rather than sustained rates.\n\nGiven that the system's advertised total equals the sum of 800,000 top-end GPUs, real-world efficiency could depend heavily on network design and software optimization.\n\nAnalysts may wait to see whether the configuration delivers performance comparable to leading AI clusters already run by other major cloud providers.\n\nThe Zettascale10 positions Oracle alongside other major players racing to provide the infrastructure behind the best GPUs and AI tools.\n\nThe company says customers could train and deploy large models across Oracle's distributed cloud environment, supported by data sovereignty measures.\n\nOracle also says Zettascale10 offers operational flexibility through independent plane-level maintenance, allowing updates with less downtime.\n\n\"With OCI Zettascale10, we're fusing OCI's Oracle Acceleron RoCE network architecture with next-generation Nvidia AI infrastructure to deliver multi-gigawatt AI capacity at unmatched scale,\" said Mahesh Thiagarajan, executive vice president, Oracle Cloud Infrastructure.\n\n\"Customers can build, train, and deploy their largest AI models into production using less power and will have the freedom to operate across Oracle's distributed cloud with strong data and AI sovereignty...\"\n\nStill, observers note that other providers are building their own large-scale GPU clusters and advanced cloud storage systems, which could narrow Oracle's advantage.\n\nThis system will roll out next year, and only then will it be clear whether the architecture can meet demand for scalable, efficient, and reliable AI computation.\n\nVia HPCWire\n\nFollow TechRadar on Google News and add us as a preferred source to get our expert news, reviews, and opinion in your feeds. Make sure to click the Follow button!\n\nAnd of course you can also follow TechRadar on TikTok for news, reviews, unboxings in video form, and get regular updates from us on WhatsApp too.\n\nEfosa has been writing about technology for over 7 years, initially driven by curiosity but now fueled by a strong passion for the field. He holds both a Master's and a PhD in sciences, which provided him with a solid foundation in analytical thinking.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPlease login or signup to comment\n\nPlease wait..."
  },
  {
    "source": "TechRadar",
    "title": "New startup wants to build self-updating, autonomous websites that 'generate' content and 'optimize themselves' without human intervention - but I wonder what Google will make of this",
    "link": "https://www.techradar.com/pro/new-startup-wants-to-build-self-updating-autonomous-websites-that-generate-content-and-optimize-themselves-without-human-intervention-i-wonder-what-google-will-make-of-this",
    "pub_date": "2025-10-19T19:15:00+00:00",
    "snippet": "Flint, backed by Accel and Sheryl Sandberg, is developing autonomous AI websites that generate and optimize themselves without human oversight.",
    "content": "A new startup has announced a plan to create fully autonomous websites that can \"generate\" their own pages and \"optimize themselves\" without human input.\n\nFlint's platform already runs live pages for firms such as Cognition, Modal, and Graphite, producing comparison pages, ad landing pages, and AI-generated SEO content.\n\nUsers only need to upload a content brief and a link to their existing site for Flint to interpret the brand's design system and automatically publish coded pages directly to their domain.\n\n\"It's time to kill the traditional website. We're moving from a world of websites as static assets to one where they're autonomous agents. Your website is either autonomous or obsolete,\" said Michelle Lim, co-founder and CEO of Flint.\n\nEarly figures claim strong SEO rankings and faster ad conversions, although the data remains limited to company reporting.\n\nFlint has raised $5 million in seed funding led by Accel, joined by Sheryl Sandberg's venture fund and Neo.\n\nThe funds will support expansion in applied AI and design engineering, as the company moves beyond its stealth phase with a waitlist for its beta program.\n\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\n\nInvestors describe Flint as part of a new wave of digital infrastructure intended to keep pace with AI-driven changes in marketing and online discovery.\n\nThis blend of AI and website design points to a future where free website builders and AI website builders evolve beyond static templates into systems capable of constant adaptation.\n\n\"The web is being disrupted by AI, and companies need to adapt their websites quickly if they want them to remain effective marketing and acquisition channels,\" said Sheryl Sandberg, co-founder of Sandberg Bernthal Venture Partners.\n\n\"Flint is building the next generation of infrastructure that will solve this challenge, shaping discoverability and online advertising for the AI generation.\"\n\nHowever, the long-term implications remain unclear, especially regarding how self-modifying websites might interact with search engines such as Google.\n\nFlint's vision is ambitious: websites that detect competitor activity, modify layouts based on visitor profiles, and even communicate directly with AI agents.\n\n\"Marketers are gravely underserved by outdated tools. Flint finally gives them AI superpowers to compete,\" said Dan Levine, partner at Accel.\n\nYet full autonomy in web systems could introduce challenges around control, transparency, and compliance with optimization standards.\n\nThe concept could also reshape how traditional free website builders and AI website builders operate if it proves viable.\n\nFor now, Flint's idea adds to a growing debate about automation's role in website design, raising the question of whether the web can remain predictable once it begins updating itself.\n\nFollow TechRadar on Google News and add us as a preferred source to get our expert news, reviews, and opinion in your feeds. Make sure to click the Follow button!\n\nAnd of course you can also follow TechRadar on TikTok for news, reviews, unboxings in video form, and get regular updates from us on WhatsApp too.\n\nEfosa has been writing about technology for over 7 years, initially driven by curiosity but now fueled by a strong passion for the field. He holds both a Master's and a PhD in sciences, which provided him with a solid foundation in analytical thinking.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPlease login or signup to comment\n\nPlease wait..."
  }
]