[
  {
    "title": "‘No More Trump!’: Protesters Denouncing the President Unite Across the Country",
    "url": "https://www.nytimes.com/2025/10/18/us/protests-trump-no-kings.html",
    "content": ""
  },
  {
    "title": "Sue Goldie Has Parkinson’s Disease",
    "url": "https://www.nytimes.com/interactive/2025/10/13/us/sue-goldie-parkinsons.html",
    "content": "Dr. Sue Goldie is an award-winning Harvard professor, a physician and a public health scientist.\n\nShe is an expert at artfully explaining complicated global problems, like pandemics.\n\nWhen she noticed something that put everything at risk — her health, her career, her identity — she kept it a secret as long as she could.\n\nNow she has to explain the most complicated question of all: What is happening to her?\n\nBy John Branch Photographs by Sophie Park\n\nIt starts with a tingle, a tremor, a sense that something is off.\n\nDr. Sue Goldie doesn’t recognize the symptoms at first. Maybe she ignores them, wishes them away.\n\nIt is 2021. She is 59, in the prime of a long teaching career at Harvard. She has just immersed herself in the sport of triathlon.\n\nOne coach notes something off with her running cadence. Another wonders why her left arm isn’t fully lifting out of the water. A trainer sees a slight tremor. The first time Sue races, she feels a strange vibration, like an internal tremble.\n\nThen Sue sees it herself: Twitching fingers on her left hand.\n\nTests reveal it is Parkinson’s, the incurable neurological disease that robs its victims of their motor skills, and sometimes their minds, one extinguished neuron at a time. Parkinson’s doesn’t always alter life spans, but it always upends lives.\n\nThe diagnosis elicits a storm of emotions, but also raises questions, both pragmatic and deep, that have consumed Sue since.\n\nAt what point, if ever, do I have to say something? Who needs to know? What do I reveal and what do I conceal?\n\nAnd, most profoundly: Does a diagnosis have to be an identity?\n\nFor nearly four years, she keeps her diagnosis from most Harvard administrators, colleagues and students, worried about what it will do to her reputation. She grows more comfortable revealing herself away from work, in the world of triathlon.\n\n“I feel very strongly that I should be able to disclose this when I want, how I want, and it’s under my control,” she tells me last year. But Parkinson’s does not wait.\n\nMaybe others don’t notice the physical signs, not yet. They don’t see her in the early morning, shuffling off-balance to the bathroom before her medications kick in, a daily reminder that Parkinson’s was not something she dreamed last night.\n\nMaybe they don’t see the pill boxes in her purse, the exposed feeling she gets when the dopamine medications wear off, the persistent worry behind her cheerful disposition.\n\nThey certainly don’t know how hard everything has become. They don’t know how terrified she is.\n\nHer symptoms are worsening. Disguising them is exhausting.\n\nStarting today, she is Sue with Parkinson’s.\n\nMost people she knows will learn of her diagnosis by reading this story.\n\nEven some of those closest to her will discover that she has been secretly chronicling her fight through thousands of video diaries. She began recording them when her symptoms made writing by hand too tedious.\n\nThe videos are time capsules of joy and grief, of wonder and despair. They are a chronological library of her symptoms, a place where she sorts her feelings. The transcriptions fill three-ring binders on her bookshelves.\n\nShe records the videos on her phone — in her Subaru, in her office, on the go. Some are optimistic and self-deprecating. Some are searingly emotional, like when she opens up about her struggles, her worries, her fear over whether she can even go on.\n\n“Hello, Sue,” she will say, or “Hello to myself,” and she will explain how she is feeling.\n\nSue and I meet in 2023. She and I agreed from the outset that this story would not be published until she was ready for her diagnosis to be revealed.\n\nFor more than two years, she confides her darkest thoughts and her evolving hopes — in person and during hourslong video calls, but mostly through hundreds of videos sent by text message. I see and learn things that she tells no one else.\n\n“I’m strong,” she says to me. “Really strong. And vulnerable, too. Both can be true.”\n\nSue knows what’s coming. There is no reversing the course. She can picture the images of Michael J. Fox and others who have Parkinson’s, many of whom are in wheelchairs and struggle to speak. They are windows to her future.\n\nMost of the one million Americans living with Parkinson’s — a growing number, because of an aging population — will quietly fade away. But how many have her skills and connections?\n\n“I’ll die with this disease,” she tells me. “But I do have control over what I do with it for the next few years.”\n\nAfter decades of examining the world’s biggest health problems, she has to turn the lens around. She has to try to explain what Parkinson’s does to a person. But not just any person. Herself.\n\n“I want to get things done while I’m still the best me,” she says.\n\nIt’s time. And time, she knows, is running out.\n\nJanuary 2023\n\nI’m trying hard to, like, do all this stuff that will help,\n\nbut I'm not feeling OK and I don’t know.\n\nI’m feeling so desperate, and so by myself.\n\nI don’t want to —\n\nI don’t know what to do.\n\nI just need to not\n\nBe alone with it\n\nI don't want to talk\n\nBut I just feel like I don't know where to turn\n\nSue is an enthusiastic storyteller, and now she is telling a story from the summer of 2019. She is watching one of her two grown sons prepare for an upcoming Ironman triathlon — a 2.4-mile swim, 112-mile bicycle ride and 26.2-mile run.\n\nSue is inspired. She rushes to a store to buy a swimsuit, jumps in the lake, swims a bit and throws up. She loves it. She announces to her family that she is going to do Ironmans, too.\n\nSue is not a swimmer, cyclist or runner. She will become the rare triathlete, she says, “who sucks at all three.”\n\n“It just seemed so intriguing and so impossible — and I liked the little outfits,” she tells me.\n\nSue finds a patient triathlon coach who will become a trusted confidant. She chooses a bike, red because she likes the color, and befriends the triathletes at the local bike shop. She starts to jog around her block in Newton, Mass.\n\n“I thought she was nuts,” her husband, Aaron Waxman, says. “But I learned long ago that things will never just pass. If she says she’s going to do something, get out of her way.”\n\nOne step, then another. It’s her mantra. If you can do 10 steps, you can do 11. If you can do a million, you can do a million and one. Keep moving until something stops you.\n\nSoon Sue is working out 12, 15, 20 hours a week. She swims at a rec center before dawn, runs miles along the Charles River at sunset, pedals in her basement for hours late at night. She and Aaron, an avid cyclist, go on long weekend rides.\n\nSue attempts her first Ironman in 2021 at Lake Placid, N.Y. She passes out on the bike and wakes up in an ambulance. She is smitten. She vows to return in 2022.\n\nThen comes the diagnosis. Sue “freaks out,” she says, but tells almost no one. She throws herself into medical research, one of the places where she is most comfortable.\n\nTwo things have been shown to stem the symptoms of Parkinson’s, if not slow the progression: medication and exercise.\n\n“I was reading paper after paper, and I’m like, ‘This is unbelievable,’” she says. “How lucky could I be? The very sport I’m doing is probably the most effective thing for this disease.”\n\nShe will be her own experiment. She will try to offset her body’s imminent erosion with intense exercise.\n\n“I am an N of 1,” she says.\n\nThrough trial and error, she and others develop workarounds for her growing symptoms: Pink tape on her hands to provide visual clues of her swim stroke. Special gear shifters and a long tube rigged as a straw on her bike’s water bottle because she no longer has the dexterity and balance to take a hand off the handlebars.\n\n“First year I could, second year a little, third year not at all,” she says.\n\nTransitions between triathlon’s three disciplines is where Sue often loses the most time compared with other triathletes.\n\nWorsening tremors and declining balance complicate simple tasks, like pulling zippers, fastening clips or changing shoes.\n\nShe struggles to climb out of wetsuits, open nutritional gel packets and tinker with equipment.\n\nMedications? She has to manage tiny pills and wild swings in her dopamine levels over hours of racing. Too much, she vomits; too little, she collapses.\n\nIn 2022, Sue completes the Lake Placid Ironman. Short of the finish line, out of sight, she stops, sits down and cries. Those tracking her coordinates wonder what happened. Is Sue OK?\n\nSue applies lipstick and jogs to the finish. S.F.G., her tiny team calls her, the middle initial standing for an unprintable adjective. How many Parkinson’s patients have completed a full Ironman?\n\nThat’s not the story. That finish line was just the start.\n\nOctober 2023\n\nToday was a day that looked like it was going to be terrible.\n\nBut after the first mile, it actually kept getting better.\n\nSo, note to self,\n\nbear with it, feeling crappy for the beginning,\n\ndon't make judgments\n\nand just start all over again,\n\nevery mile, with a new, fresh outlook and a forced smile, if need be.\n\nFour major symptoms of Parkinson’s are related to movement, and they often start on one side of the body: tremors, bradykinesia (slowness of movement), rigidity (limb stiffness) and postural instability (balance). They sneak up until one day they are all you notice.\n\nNonmotor problems can include depression and anxiety. Cognition can suffer. There may be an increased possibility of dementia.\n\nSue’s biggest fears, for now, are a loss of identity, of dignity, of worth. It’s a theme of her videos: a sense that she is disappearing. She has recurring dreams about drowning.\n\n“Tremors or symptoms — that pales in comparison to knowing that I’m losing who I am,” she says.\n\nHer humor skews dark, and no subject is off limits. After one long run, Sue records a video to herself about incontinence. “Fun fact for a Sunday,” she says, cheerfully. “It’s a big problem with Parkinson’s. No one wants to talk about it. Even your doctor doesn’t really want to talk about it. Case in point: I’m talking to myself right now.”\n\nParkinson’s patients slowly lose the neurons that produce dopamine, a neurotransmitter that acts as a messenger between neurons, or nerve cells. The disease mostly affects a cluster of neurons that control the speed and quality of a person’s movement.\n\nMedications can help raise dopamine levels. Eventually, though, the key neurons fade, like stars at dawn. Even the strongest medications won’t help.\n\nSue wonders how many neurons she has left. “Saving the neurons” is a personal motto, written on her water bottles, ID bracelets and bike bag. “I don’t have the neurons for that!” she will shout when her patience is tested.\n\n“Scientifically, when you get diagnosed, you’ve probably lost 80 percent of your neurons,” she says. “But you might live another 15 years. So we’re in the ‘forgotten’ section. You’re not bad enough to get all the attention. You’re not stooped over or in a wheelchair, which is what the visuals are. But you’re also not the healthy person who doesn’t have it. You’re in the middle.”\n\nAs her Parkinson’s is revealed, Sue worries that others will reduce her to little more than her diagnosis. She has a deep fear of being misunderstood, underestimated, dismissed.\n\n“Telling people, even people close to me, can make it harder,” Sue tells me in 2024. “Even the people close to you can’t fully understand.”\n\nI feel this at times, when a glib comment makes her fearful that I don’t understand basic things about her. She has recorded videos to me, including angry ones that I have never seen and good-humored ones that I have, in response to things I didn’t realize upset her.\n\nShe often tells me how distressing it is when someone who knows her diagnosis — a doctor, a friend — tells her how well she seems to be doing.\n\n“You have no idea how hard it is to trick you into thinking I’m OK,” she says.\n\nThis plays out most starkly at Harvard. Sue knows that whispers about health or mental capacity can alter reputations, especially at esteemed universities. It is touchy. But shouldn’t these issues be in the open? Sue wonders. Shouldn’t we talk about them?\n\nShe wants to spark the discussion. She worries about the silent repercussions from people who might now see her as diminished.\n\nLast fall, before she tells her own dean and others in her administrative chain of command, Sue goes to the top, to Harvard’s president, Alan Garber. He is a longtime friend and colleague. She brings a framed photo from her office of the two of them smiling after receiving awards at Harvard years ago.\n\nHis response to her diagnosis is kind but more muted than Sue hopes. She instantly regrets telling him.\n\n“I’m just feeling, like, super institutionally vulnerable,” she says in a tearful video message afterward. “I’m feeling like I’ve told the most important person at the university, but I’m not having any exhale moment at all.”\n\nA few days later, he sends a friendly note expressing full support. Sue exhales.\n\nBut the episode spooks her. There is a new dean and a new provost, and she will wait until the eve of this story’s publication to tell them. She is confident that she is still in her prime as an educator and that she will recognize when she can’t teach anymore. But she worries whether she can trust others to trust her.\n\n“I can’t change this,” she says to me earlier this year, in her office. “I can’t make it not happen. So what happens when I get worse?”\n\nShe looks at her handwriting. Five years ago, it was quick, sharp, fully legible.\n\nNow she barely recognizes it. It is a series of shrinking scribbles, fading and tilting with each line.\n\nDecember 2024\n\nI have to, at the same time, deal with their ambiguity over\n\nwhether I can do my job or whether\n\nI can continue to be who I am.\n\nI have to deal with my own ambiguity about\n\nam I going to be OK in a year?\n\nAnd at the same time,\n\nI have to still do my job.\n\nSue Goldie has one of those official biographies that go on and on. She is an endowed professor at the Harvard T.H. Chan School of Public Health. She is director of both a research center at the school and a universitywide teaching center. As a 2005 MacArthur Foundation fellow, she was awarded a “genius grant” for her work in women’s health care in underserved populations.\n\nAround Harvard, she is known for the conversational and visual way that she teaches. In lecture halls and carefully constructed online videos, she takes thorny global problems — infectious diseases, climate change, gun violence — and breaks them into digestible lessons using colored markers, hand-drawn iconography, her own handwriting.\n\nJust off campus in Harvard Square, she oversees the Global Health Education and Learning Incubator, a cluster of studios and meeting spaces where professors, teachers and students learn how to explain complicated subjects more simply, more effectively.\n\nFor some of her classes, she records video lessons by sitting close to the camera and talking directly to the viewer.\n\nShe uses an overhead camera, as if she were on a cooking show, to showcase her drawings, writing and explanations.\n\nIt’s not just how she teaches. It’s how she thinks. When confronted with a problem, she draws, she scribbles, she cuts pieces of paper, she storyboards.\n\nWhen I ask Sue about key moments with Parkinson’s, she produces a color-coded timeline of symptoms, injuries, races, training and medication changes.\n\nShe wonders if anyone notices that she draws and writes less than she used to during her lectures and videos, relying instead on a cache of prewritten, predrawn cutouts that she can move around in front of her. Do they notice her hand held firm against the table, or holding something, to hide the resting tremors?\n\nIn April 2024, I arrive at Sue’s office around 8 a.m. She is barefoot and wearing a T-shirt. She has been there for hours, preparing for an 11 a.m. lecture.\n\nShe moves images around on a computer screen, trying to coordinate the information with the story she wants to tell about infectious diseases. She is frustrated. The stress level is high.\n\n“If I put this here, does it make sense?” she asks herself. She glances at the clock. She swears. “I’m spending too much time on this.”\n\nShe turns to Meg Harding, the associate director of educational initiatives at the incubator and one of her assistants. “It would be better with chickens, wouldn’t it?” Sue asks.\n\n“I’ll put chickens in it,” Meg says.\n\n“Then I’ll say, ‘Big picture, let’s go back, 16 million deaths … ’” Sue says, clicking and scrolling and reading. “I have to do this like a story. It would be good if I had something here to remind me, maybe a small font as a cue.”\n\nShe sighs.\n\n“This is mortifying that I have to have a cue here,” she says.\n\nShe asks Meg to close the door. She reaches for her meds. She turns to me.\n\n“It’s all I can do not to cry and fall apart,” she says. “I’m so embarrassed. This is something I know so well, that I’m an expert in.”\n\nShe has 10 minutes to get dressed, put on makeup and head for Boylston Hall. “Looking at a 10:20 departure!” she calls out. Several staff members shuttle to campus with her.\n\nMinutes later, Sue enters the lecture hall with a smile.\n\n“Good morning, everyone!” she says to about 100 students. “Let’s start with a teeny bit of a recap, and then we’ll talk about where we’re headed.”\n\nA switch has flipped. Sue is on her game: Clear, concise, confident, witty. She walks students through a case study of H5N1 in Indonesia — 16 million poultry deaths, 19 human cases, including victims with no contact with poultry.\n\nThe big screen shows all of this: pictograms, charts, bright colors. Sue moves pieces around. Students are rapt. Sue is distracted by a tremor in her left leg, but no one notices. She directs students to form small groups to discuss a case. Sue walks around, answering questions, easygoing and approachable. Who knew infectious diseases could be so fun?\n\n“Thank God that’s over,” Sue says when class ends and the hall empties.\n\nLater, when she and I are alone, she acknowledges the vital support provided by close members of her staff. They know that she has Parkinson’s, though Sue tells me she hasn’t uttered the word to them. Not yet.\n\nI wonder aloud if it will be freeing to have her diagnosis out in the open to everyone.\n\nMaybe, she says, but it’s complicated. How much detail should she share? And it is not as if she has a broken bone, or even a tumor that might be removed. Sue will never heal. She will not get well soon.\n\n“What do you say to me?” she says. “‘I hope you don’t degenerate too fast’?”\n\nShe gets frustrated when I conflate feeling alone and being lonely. “It’s never loneliness,” she says. “It’s alone. Two different things.”\n\nShe later identifies a better word. It’s “accompanied,” Sue says.\n\n“This is a big fundamental thing for people in a situation like mine, even if it’s not Parkinson’s,” she says. “You are alone. You are the person whose neurons are checking out. For me, it’s accepting that part of me will be alone in this and thinking: What spaces can I create for myself where I actually just feel accompanied?”\n\nThere are places where she feels this — at triathlons; with close friends and family; with personal trainers and physical therapists; with doctors like her neurologist, who oversees an ever-shifting array of medications.\n\nBut videos to herself remain the primary outlet for Sue’s deepest feelings. They sometimes document just how turbulent things can be.\n\nIn August 2024, Sue prepares an annual lecture to hundreds of incoming students. Administrators will be there. Her symptoms are worsening. She has a dream beforehand about not showing up, and another about blurting out, mid-lecture, that she has Parkinson’s. Maybe it would just be easier. Rip the Band-Aid off.\n\nSue conceals that anxiety. The night before the lecture, she records a video to me with her staff, laughing at how hopelessly far behind they are in piecing things together.\n\nAt 3 a.m., now alone, Sue records another message. “It’s really dangerous that I feel right now like jumping in front of a train,” she says, weakly. “I just — I feel like there’s no way out.”\n\nShe rushes home for a shower. Back at work with the sun, Sue gives the lecture.\n\nIt is a hit. People commend her. But they only saw the finish line, Sue thinks, not the hours of work it took to get there.\n\nFrom her car that afternoon, after a long run where she struggles with balance, she records a video through tears.\n\nSue is at ease in the world of triathlon, a place she keeps mostly secret from those at Harvard. She finds joy in small achievements instead of anxiety in her fading abilities. She is not afraid to look foolish. She approaches strangers and says, “I have Parkinson’s and I need help.”\n\n“I hate swimming, biking and running,” she tells me, “but I love triathlon.”\n\nSue’s coach, Jeffrey Capobianco, is an accomplished Ironman triathlete who orchestrates her workouts. He talks or texts with Sue almost every day.\n\nIn the spring of 2024, Sue and Jeffrey are together, talking about the triathlons she has on the calendar. Sue makes her joke about having just a few neurons left.\n\n“It’s good that you started out so damn smart,” Jeffrey says. “You have some brain cells to give.”\n\nShe smiles. He always knows the right thing to say.\n\nJeffrey is concerned that Ironman triathlons are now too much for Sue. He worries about the risk of her being on a course for up to 17 hours, the maximum time allowed for an Ironman.\n\nSue is struggling to manage wild dopamine swings with medications and dosages. She is recovering from a string of serious injuries she endured in 2023 from falls and collisions — a broken clavicle, a broken rib, an orbital fracture from smashing into a two-by-four sticking out of a truck bed during a training run. Most of them, she thinks, would not have happened without Parkinson’s.\n\nDuring a bike ride with Aaron, her husband, Sue can’t get her feet unclipped from the pedals. Unsure what else to do, she slows down and falls over. Aaron spends several minutes trying to free her.\n\nJeffrey recommends focusing on half Ironmans — called 70.3s, for the total mileage. Athletes are given 8½ hours to finish.\n\n“We need to keep you moving forward,” Jeffrey says. “We need to make sure you can do these things on a continual basis, and you’re not just checking a box.”\n\nSue appeases herself by believing that multiple halves are harder than one full Ironman. It means more variables: more courses, more transition zones, more calculated training across the calendar.\n\n“Maybe my goal now is 100 halves in my lifetime,” Sue says. It’s hard to tell if she’s joking.\n\nSue completes one in Massachusetts in June and another in Maine in July. A September event in Georgia is canceled at the last moment, so she signs up for one in Florida in December. But through the fall, her symptoms, including rigidity and bradykinesia, seem to be accelerating.\n\nIn November she sends me a video from her car. She is “brimming with excitement” to declare that she has achieved a secret goal: She reached the podium in her age group in her town’s Turkey Trot 5K.\n\nShe jokes that she will use this confidence boost to help her tell her bosses about her diagnosis. Then she runs 13 more miles.\n\nSue is anxious before races, but increasingly happy to explain her workarounds to anyone who notices. She replaces zippers with large Velcro tabs that are simpler to manage. Her gloves are two sizes too big to overcome her worsening dexterity. She sticks pink tape around the transition zone to point her to her gear amid the midrace chaos. Colorful pill boxes are filled with carefully dosed dopamine, clearly marked for various times during the race.\n\nOn the course, usually near the back of the pack, Sue often has an optimistic buoyancy. She writes “SUE” on her race bib so spectators can shout her name.\n\nSince the 2021 Ironman at Lake Placid that ended in an ambulance, Sue has finished every race she has started. Days before the Florida race, Sue doesn’t think she will compete. But she does, and she finishes.\n\n“She’s Sue Goldie,” Jeffrey says with a shrug.\n\nIt’s difficult, if not impossible, to measure the effect of her exercise against the silent creep of Parkinson’s. There are so many variables, and she is just one person. But she has little doubt that she would be much worse off without triathlon.\n\nIt’s 2025. In her home office, Sue scans a pair of recent papers published in major medical journals. Both have page after page of evaluations of Parkinson’s medications. Both make small, secondary mentions of exercise.\n\n“Not one of these 500 drugs does anything for progression,” she says. “But, like, nine studies in humans show high-intensity exercise does slow progression.”\n\nSue wonders, then, why doctors are so quick to prescribe medication, but not exercise or physical therapy.\n\nShe is animated now, in full lecture mode. Patients, she says, should have access to therapists and trainers as soon as they’re diagnosed with Parkinson’s, not just after a fall or injury or when symptoms become debilitating. Insurance companies should pay for it, she says. Studies show that exercise is good for patients — for Parkinson’s symptoms, yes, and maybe for the progress of the disease itself, but also to help stave off problems and comorbidities that come when people stop moving much, like heart disease and diabetes.\n\n“I’m hoping that I live the next 10 years and that I’m not going to progress as fast as others,” she says. “And that some of what I’m doing, the way that I’m documenting it and the way I’m planning to share it, that there can be learning from that.”\n\nIt is May 2025. The university has been in an epic battle with the Trump administration, and a brutal semester at Harvard has ended. For Sue, it has meant layoffs for her staff, cuts to research for her graduate students, uncertainty for her centers and her roles.\n\nSue’s moods sway from glum to feisty. She wants to stand up for herself, for others with Parkinson’s. She also wants to stand up for research, for science, for Harvard. She wants to go public.\n\n“I want to combine my specialty with my disease, and me being scared to death,” she says.\n\nShe begins sketching and storyboarding more educational videos, the kind that she uses to teach. This time, though, the subject of the course will be Parkinson’s disease.\n\nShe begins recording pieces in her studio. Topics range from “What Goes Wrong in Parkinson’s Disease?” to “Explaining the Brain” to “Why Does Dopamine Stop Working?” There will be one called “Handwriting.”\n\nThey will be geared toward patients and caregivers, but also medical professionals, therapists, family and friends.\n\nShe feels the crush of time. “My Parkinson’s is worse,” she tells me over the summer. Tremors are emerging, doses are increasing. “It’s a one-way train,” she likes to say. It might slow, or might even pause, but it is headed only one direction.\n\nShe resolves to keep competing in triathlons as long as she can. In December 2024, she signs up for six half Ironmans in 2025. Days later, she falls down some steps — a slip related to Parkinson’s, she is sure — and breaks several bones in her foot. She has surgery and is told she will spend months in a boot.\n\nAgainst doctors’ orders, she is swimming, cycling and running within weeks. She revises her goal to four triathlons in 2025. She misses one springtime event and is about to miss a second in western Massachusetts in late June.\n\nThe night before the race, she decides to go — not to race, necessarily, but to show herself that she can still get to the starting line. Sue does not tell Jeffrey, her coach, because he might try to talk her out of it. Her husband, Aaron, presumes that Sue will turn around and come home first thing in the morning.\n\nIt is midnight before she settles into her hotel room. The alarm is set for 2:30 a.m. At the course long before dawn, Sue figures that she will at least get her wetsuit on. She’s come all this way, after all.\n\nWhen the scrum of athletes surges toward the water, Sue is swept up. She might as well try the swim. She finishes it. She might as well do the bike, then. She completes that, too.\n\nDuring the 13.1-mile run, Sue becomes aware of how bent over she is, her face to the pavement, a shuffling question mark. She knows what is happening. It’s postural instability, one of the four leading Parkinson’s symptoms and often the last to show itself.\n\nShe lies on the ground and stretches herself straight to make sure the condition isn’t permanent. She stands up and keeps running. The process repeats, mile after mile: run, bend, stop, straighten, stand, continue.\n\nOne foot in front of the other. Keep going until something stops you.\n\nSue knows no one at the race, but she feels less alone than she has in weeks.\n\n“I just felt genuine,” she says to me afterward. “I’m not holding anything in. I’m just — this is me. This is who I am right now. And I’m doing it.”\n\nAs she approaches the finish line, Sue is sobbing, unable to stand straight. Out of the corner of her eye, she glimpses a man running alongside her, accompanying her, scared that she is going to fall over.\n\nOnly later does she realize that it is her husband. When she didn’t come home from the race, he raced to her.\n\nShe hears the M.C. on the loudspeaker. He is reading something that she submitted with her race application, something for all to hear.\n\n“Here’s Sue Goldie!” he shouts at the finish line. “She’s fighting Parkinson’s disease!”\n\nAdvertisement"
  },
  {
    "title": "Nory Doesn’t Go to School Here Anymore",
    "url": "https://www.nytimes.com/2025/10/17/us/ice-immigration-deportations.html",
    "content": ""
  },
  {
    "title": "In This Small Mississippi Delta City, Even Adults Race Home to Beat Curfew",
    "url": "https://www.nytimes.com/2025/10/15/us/greenville-mississippi-crime-curfew.html",
    "content": ""
  },
  {
    "title": "Trump and Colombian President Trade Digital Attacks Over Boat Strikes",
    "url": "https://www.nytimes.com/2025/10/19/us/politics/trump-colombia-petro-aid.html",
    "content": ""
  }
]