[
  {
    "category": "World",
    "title": "Israel Strikes Gaza and Temporarily Halts Aid, Saying Hamas Broke Truce",
    "link": "https://www.nytimes.com/2025/10/19/world/middleeast/israel-gaza-ceasefire.html",
    "pub_date": "Sun, 19 Oct 2025 19:17:32 +0000",
    "pub_date_fmt": "2025-10-19 15:17 EDT",
    "snippet": "Israel launched a wave of attacks on Gaza after accusing Palestinian militants of attacking its forces across cease-fire lines. Both sides say they are still committed to the truce.",
    "content": "Advertisement\n\nIsrael on Sunday launched its heaviest wave of attacks on Gaza since a fragile cease-fire took hold a week ago and said it was temporarily suspending humanitarian aid to the territory after accusing Hamas of firing on its forces and violating the truce.\n\nThe aid was halted because of the intensity of the Israeli strikes, and was expected to resume once the bombing was over, according to an Israeli official, who spoke on condition of anonymity to discuss a sensitive matter. Israeli officials had initially said that humanitarian aid would be suspended until further notice, but later appeared to step back from that decision.\n\nIsrael said two of its soldiers were killed on Sunday when Palestinian militants attacked forces who were operating in an area where the Israeli military is allowed to be under the cease-fire agreement. The deaths prompted a strong response.\n\nGaza’s health ministry initially reported 14 Palestinian deaths across the territory on Sunday.\n\nBoth Israel and Hamas have now accused each other of violating the truce after repeated flare-ups of violence over the past three days. But both sides made clear on Sunday that they were still committed to maintaining the truce.\n\nThe Israeli military said the Palestinian fighters had fired an anti-tank missile at its troops and then shot at them in the Rafah area of southern Gaza that remains under Israeli control.\n\nThe military called this “a blatant violation” of the truce. In response, the military said, Israeli forces struck in the area “to eliminate the threat” and dismantle tunnel shafts and other military structures."
  },
  {
    "category": "World",
    "title": "Louvre Closed After Thieves Steal ‘Priceless’ Jewels in Brazen Daylight Robbery",
    "link": "https://www.nytimes.com/2025/10/19/world/europe/louvre-paris-robbery.html",
    "pub_date": "Sun, 19 Oct 2025 18:20:11 +0000",
    "pub_date_fmt": "2025-10-19 14:20 EDT",
    "snippet": "French officials said the thieves broke into a second-floor wing of the Paris museum that houses a collection including the French crown jewels.",
    "content": "Advertisement\n\nThieves made off with jewelry of “incalculable” value in a brazen daylight robbery on Sunday at the Louvre Museum in Paris, according to France’s interior minister.\n\nThe heist unfolded around 9:30 a.m. Laurent Nuñez, the interior minister, told France Inter radio that the thieves had used a lift mechanism on a truck — typically used to move furniture into Parisian apartments through the windows — to break into the Galerie d’Apollon, a second-floor wing of the museum.\n\nThe Apollon Gallery’s gilded hall holds the royal collection of gems and the crown diamonds, including “The Regent,” “The Sancy” and the “Hortensia.” The thieves broke into two display cases and snatched eight precious objects before fleeing on motor scooters with their loot — all within just seven minutes, according to Mr. Nuñez.\n\nThe jewels included a royal sapphire necklace and earring; a royal emerald necklace and earrings; and a pearl and diamond encrusted diadem worn by Empress Eugénie, the wife of Napoleon III, who governed France from 1848 to 1870, according to a statement put out by the French Ministry of Culture.\n\n“It’s a major robbery,” Mr. Nuñez said, adding that investigators believed that three or four thieves were involved and that the robbery bore the hallmarks of an experienced team of veteran criminals given its precision and speed.\n\nBut in their haste to leave, the robbers dropped a crown of Empress Eugénie, which features 1,354 diamonds and 56 emeralds, according to the Louvre website.\n\nAccording to the French Culture Ministry, five museum staff were in the Apollon Gallery when the burglars broke in, sounding the security alarms. They applied the museum’s security protocol: contacting the police and “prioritizing the protection of people.”"
  },
  {
    "category": "World",
    "title": "A Fragile Cease-fire Between Afghanistan and Pakistan Ends Violence, for Now",
    "link": "https://www.nytimes.com/2025/10/19/world/asia/afghanistan-pakistan-cease-fire.html",
    "pub_date": "Sun, 19 Oct 2025 17:23:13 +0000",
    "pub_date_fmt": "2025-10-19 13:23 EDT",
    "snippet": "The two committed to stop attacking each other after the worst outbreak of hostilities in years. But the underlying causes remain, analysts warn.",
    "content": "Advertisement\n\nA cease-fire announced by Afghanistan and Pakistan on Sunday has brought respite from the worst flare-up of tensions between the neighboring countries in years.\n\nFor nearly two weeks, Afghanistan and Pakistan exchanged military attacks that killed dozens of people, injured hundreds and threatened to turn into full-on conflict.\n\nAfter meeting in Doha on Saturday under the mediation of Qatar and Turkey, Afghanistan and Pakistan vowed to de-escalate and to meet again later this month. “Terrorism from Afghanistan on Pakistan’s soil will be stopped immediately,” Pakistan’s minister of defense, Khawaja Asif, said on social media on Sunday.\n\n“Neither country will undertake any hostile actions against the other,” Zabiullah Mujahid, the spokesman for the Afghan Taliban, wrote on X. There was no joint statement.\n\nDespite the lull, Pakistan has a resilient Taliban problem, analysts and former diplomats say, and the quagmire remains nearly impossible to resolve without strong measures that neither side has been willing to take so far.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\n\nThank you for your patience while we verify access."
  },
  {
    "category": "World",
    "title": "Bolivia’s Presidential Runoff Election: Here’s What to Know",
    "link": "https://www.nytimes.com/2025/10/19/world/americas/bolivia-presidential-runoff-election.html",
    "pub_date": "Sun, 19 Oct 2025 18:39:44 +0000",
    "pub_date_fmt": "2025-10-19 14:39 EDT",
    "snippet": "Bolivians are voting for president in Sunday’s runoff, which pits two conservative candidates promising to improve the economy and restore confidence in the nation’s governance.",
    "content": "Advertisement\n\nBolivia’s runoff election on Sunday will determine which of two conservative candidates will lead the country after two decades of leftist rule.\n\nIn the first round in August, Rodrigo Paz, a right-leaning centrist and son of a former president, emerged as a surprise front-runner, climbing from the bottom of the polls to secure 32 percent of the vote. He is facing off against a conservative former president, Jorge Tuto Quiroga.\n\nA recent poll shows Mr. Quiroga in the lead; however, the race is widely considered a tossup.\n\nThe economy dominates the election, with rising prices, fuel shortages and difficulties in gaining access to imported goods and U.S. dollars fueling widespread discontent.\n\nThe high cost of government-financed fuel subsidies has long been discussed, but dismantling them is considered politically costly.\n\nBeyond economics, many voters express frustration with the South American country’s turbulent politics and a legal system that many consider dysfunctional.\n\nWhile the economy is central, Carlos Saavedra, a Bolivian political analyst, said that there was a broader crisis with lack of faith in the country’s governance."
  },
  {
    "category": "World",
    "title": "Sanae Takaichi Is Set to Be Japan’s First Female Prime Minister. But Will She Advance Women’s Rights?",
    "link": "https://www.nytimes.com/2025/10/19/world/asia/japan-women-prime-minister.html",
    "pub_date": "Sun, 19 Oct 2025 14:36:35 +0000",
    "pub_date_fmt": "2025-10-19 10:36 EDT",
    "snippet": "Sanae Takaichi is poised to break Japan’s political glass ceiling. But some worry she will maintain policies that have held women back.",
    "content": "Advertisement\n\nIn Japan, women have long been severely underrepresented at the highest levels of business, government and society, the product of a culture that expects them to bear a disproportionate share of child care and housework.\n\nBut on Tuesday, the country is poised for a milestone: Sanae Takaichi, a hard-line conservative lawmaker who idolizes Margaret Thatcher, is expected to be named Japan’s next prime minister during an extraordinary session of Parliament. She would be the first woman to serve in that role and the first woman at the top of Japanese government in centuries.\n\nMs. Takaichi, 64, is a divisive figure in Japan, and her breaking of the glass ceiling has drawn a range of reactions. Her supporters have hailed her as a pioneer who knows firsthand the challenges of Japan’s male-dominated culture. Activists and scholars have expressed concern that she will continue to support policies that have held Japanese women back. Political rivals have accused her of serving as a puppet to men in her party; one male lawmaker recently described her as a bride who had married into a powerful political faction.\n\nBut many Japanese women say they hope Ms. Takaichi will help normalize the image of strong female leaders and use her platform to push family-friendly policies, like expanding access to day care.\n\n“This is a first for Japan,” said Hikari Minagawa, 19, a freshman at Otsuma Women’s University in Tokyo. “I want Takaichi to make it easier for women to become politicians and representatives. Stepping confidently into the political world for women — I think she’ll be able to achieve that. Takaichi is strong. She’s cool.”\n\nMs. Takaichi’s own views on gender are complex. She is not known as a feminist. And like other conservative women in politics, including Ms. Thatcher and Giorgia Meloni, Italy’s prime minister, Ms. Takaichi has embraced policies that critics say have eroded women’s rights. She opposed changing a longstanding law that requires married couples to share a surname, and she has backed efforts to preserve the male lineage of Japan’s imperial family.\n\nSome activists, scholars and politicians worry that little would change for Japanese women under Ms. Takaichi, who won election as president of the governing Liberal Democratic Party this month, beating four men for the post."
  },
  {
    "category": "U.S.",
    "title": "Trump and Colombian President Trade Digital Attacks Over Boat Strikes",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/trump-colombia-petro-aid.html",
    "pub_date": "Sun, 19 Oct 2025 19:12:37 +0000",
    "pub_date_fmt": "2025-10-19 15:12 EDT",
    "snippet": "The U.S. president threatened to withdraw aid to Colombia after that country’s leader, Gustavo Petro, accused the United States of murdering a fisherman in a Caribbean strike last week.",
    "content": "Advertisement\n\nPresident Trump traded jabs with his Colombian counterpart, Gustavo Petro, over social media on Sunday, accusing him of not doing enough to curb the production of illegal drugs and threatening to stop payments and subsidies — or worse.\n\n“Petro, a low rated and very unpopular leader, with a fresh mouth toward America, better close up these killing fields immediately, or the United States will close them up for him, and it won’t be done nicely,” Mr. Trump wrote, hours after Mr. Petro accused the United States of killing an innocent fisherman in its campaign against vessels that it says carried drugs in the Caribbean.\n\nMr. Trump and the Colombian president have feuded before, but the latest episode started on Saturday night when Mr. Petro accused the United States of murdering the fisherman in mid-September, after his vessel broke down and he activated a distress signal.\n\nThat strike was the second in a string of attacks by U.S. forces that have killed dozens of people aboard vessels that, according to postings by Mr. Trump, were ferrying drugs to the United States. The administration has provided no evidence to support the claim beyond descriptions of intelligence assessments and declassified videos of portions of the attacks.\n\nBut Mr. Petro said the man killed in the mid-September attack, Alejandro Carranza, was a “lifelong fisherman” whose boat had experienced damage and was adrift, probably in Colombian waters, at the time of the attack.\n\n“U.S. government officials have committed a murder and violated our sovereignty in territorial waters,” Mr. Petro wrote. He also urged his attorney general to help Mr. Carranza’s family file claims against the United States. Colombian news media reported that Mr. Carranza was 40 years old and a resident of Santa Marta.\n\nAlthough the U.S. campaign has been aimed primarily at those suspected of being Venezuelan drug runners, the strikes have killed or wounded individuals from other countries."
  },
  {
    "category": "U.S.",
    "title": "Hit-and-Run at a Child’s Birthday Party Leaves 1 Dead, 13 Hurt",
    "link": "https://www.nytimes.com/2025/10/19/us/crash-birthday-party-bladensburg.html",
    "pub_date": "Sun, 19 Oct 2025 18:06:06 +0000",
    "pub_date_fmt": "2025-10-19 14:06 EDT",
    "snippet": "The driver fled the scene after ramming a vehicle into a group of people, including children, outside a Maryland home Saturday night. He later turned himself in, the police said.",
    "content": "Advertisement\n\nOne person was killed and 13 others, including children, were injured after a hit-and-run driver plowed into a group of people at a children’s birthday party in a Maryland town on Saturday night, the police said.\n\nThe police in Bladensburg, Md., outside Washington, were called around 10:15 p.m. about a driver who had crashed into a tent where people were gathered for the party, the police said on Sunday.\n\nAmong the victims were eight children, ranging from 1 year to 17 years old, and six adults. One of the adults, Ashley Hernandez Gutierrez, 31, of Washington, died from her injuries, the police said\n\nThree adults were admitted to the hospital and were in stable condition. One was awaiting treatment, and one was discharged, the police said early on Sunday afternoon.\n\nSeven of the children were treated and discharged from a hospital. One was admitted and was in stable condition, the police said.\n\nThe driver abandoned the vehicle and fled the scene on foot, the police said. A 66-year-old man from Washington later identified himself as the driver and turned himself in, according to the police. He was not publicly named.\n\nA crash investigator has interviewed the driver, who faces criminal charges, the police said."
  },
  {
    "category": "U.S.",
    "title": "Trump Posts Fake A.I. Video of Himself Flying a ‘King Trump’ Jet Over Protesters",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/trump-fake-video-no-kings.html",
    "pub_date": "Sun, 19 Oct 2025 17:28:07 +0000",
    "pub_date_fmt": "2025-10-19 13:28 EDT",
    "snippet": "President Trump shared what appeared to be an A.I.-generated video on social media. It shows Mr. Trump wearing a crown and flying a jet that dumps brown liquid on demonstrators.",
    "content": "Advertisement\n\nPresident Trump has posted a fake video on social media that showed him wearing a crown and flying a jet labeled “King Trump” that dumps brown liquid on protesters.\n\nThe short video, shared on Mr. Trump’s Truth Social account late Saturday, was posted on the same day that protesters participated in a daylong mass demonstration, known as “No Kings,” against the Trump administration. The protests were held in cities and towns in all 50 states, with participants holding signs such as “I Pledge Allegiance to No King” and chanting slogans against the president, accusing him of acting in authoritarian ways.\n\nThe fake video, set to the song “Danger Zone” by Kenny Loggins, shows the plane dropping a brown liquid resembling feces onto the heads of protesters, who appeared to be gathered in a city.\n\nThe White House on Saturday also posted on social media an A.I.-generated image of Mr. Trump and Vice President JD Vance wearing crowns. “Have a good night, everyone,” the post said, with the crown emoji.\n\nMr. Trump regularly reposts A.I.-generated or mocked-up imagery on his Truth Social account. Last month, he posted a meme of Representative Hakeem Jeffries, Democrat of New York and the House minority leader, which shows Mr. Jeffries wearing a fake mustache and a sombrero, with mariachi music playing in the background. Mr. Jeffries, who is Black, said the video was racist and bigoted.\n\nThe No Kings protests followed another mass demonstration in June, when an estimated five million people participated in some 2,000 protests nationwide. The event on Saturday was organized by national and local groups and well-known progressive coalitions, including Indivisible, 50501 and MoveOn. Republican leaders denounced the protests, blaming them for prolonging the government shutdown and calling the event the “hate America rally.”\n\nWhen asked whether the president had a comment on the demonstrations, Abigail Jackson, a White House spokeswoman, gave a brief response in an email. “Who cares?” she said."
  },
  {
    "category": "U.S.",
    "title": "Shutdown Fight Reopens Debate in G.O.P. Over Health Care",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/obamacare-republicans-shutdown-subsidies.html",
    "pub_date": "Sun, 19 Oct 2025 13:41:28 +0000",
    "pub_date_fmt": "2025-10-19 09:41 EDT",
    "snippet": "The spending showdown has highlighted Republicans’ failure to produce an alternative to Obamacare, which many of them assail but concede is too politically risky to undo.",
    "content": "Advertisement\n\nThe federal shutdown that is nearing its fourth week with no end in sight carries plenty of political risk for Democrats, who Republicans have accused of refusing to fulfill their responsibility to fund the government.\n\nBut it has also thrust President Trump and the G.O.P. onto the defensive on health care, an issue that has long been a major weakness for the party.\n\nDemocrats in Congress are holding fast to their position that they will not agree to a spending deal unless Republicans include an extension of expiring Affordable Care Act tax credits that would stave off premium increases and the loss of coverage for millions of Americans.\n\nIn doing so, they have forced the G.O.P. to wrestle publicly with its divisions about what to do with the health care law, which most Republicans revile but many recognize would be impossible to unravel without bringing political disaster to their party.\n\nSome hard-line Republicans are still pressing to repeal Obamacare outright, while others concede it is unwise to do so without a clear plan of what to do instead — something that their party has long discussed but has never been able to agree upon. Mr. Trump, who told Republicans in 2023 to “never give up” in seeking to repeal the 2010 health law, has yet to clearly articulate what he favors instead.\n\nFor now, Republican leaders in Congress have mostly opted to try to change the conversation, insisting that they have a health care plan but declining to describe what it is.\n\n“This is not a health care fight,” Speaker Mike Johnson insisted in a television interview last week when discussing the shutdown impasse. Democrats, he added, “have created a red herring. The subsidies don’t expire until the end of the year. They grabbed that issue from the end of the year and pulled it back into September.”"
  },
  {
    "category": "U.S.",
    "title": "An ICE Raid at a Building in Chicago Swept Up Dozens of U.S. Citizens",
    "link": "https://www.nytimes.com/2025/10/19/us/chicago-south-shores-border-patrol-raid.html",
    "pub_date": "Sun, 19 Oct 2025 12:27:51 +0000",
    "pub_date_fmt": "2025-10-19 08:27 EDT",
    "snippet": "An immigration raid on an apartment building in Chicago followed years of problems with crime, and neglect by landlords. It swept up dozens of U.S. citizens who were detained in the middle of the night.",
    "content": "Windows are boarded up at an apartment building in Chicago’s South Shore neighborhood where federal agents staged a massive raid.Credit...Todd Heisler/The New York Times\n\nSupported by\n\nBy Nicholas Bogel-BurroughsJulie BosmanHamed AleazizJesus Jiménez and Brent McDonald\n\nVideos by Arijeta Lajka\n\nReporting from Chicago\n\nOn a humid September night in Chicago, Cameo Polk was asleep in his fifth-floor apartment when he heard the thump thump thump of a helicopter overhead.\n\nOutside, hundreds of men with masks and rifles were scurrying around the building. He briefly wondered if an invasion was underway.\n\nBut they were U.S. law enforcement agents, rappelling from a Black Hawk helicopter and swarming the 130-unit building he lives in. Once inside, they kicked down doors, emptied bookshelves and overturned mattresses."
  },
  {
    "category": "Business",
    "title": "Epoch Times Reporter Resigns After Publication Signs Pentagon Rules",
    "link": "https://www.nytimes.com/2025/10/19/business/media/epoch-times-pentagon-press-rules.html",
    "pub_date": "Sun, 19 Oct 2025 18:45:31 +0000",
    "pub_date_fmt": "2025-10-19 14:45 EDT",
    "snippet": "The reporter, Andrew Thornebrooke, also cited a recent editorial directive to refer to antifa, the far-left ideological movement, as a terrorist organization.",
    "content": "Advertisement\n\nA national security reporter at the right-wing Epoch Times newspaper has resigned after the publication signed on to rules restricting news gathering within the Pentagon.\n\nThe reporter, Andrew Thornebrooke, submitted his resignation in writing on Friday. Although he did not have an active Pentagon press pass, he regularly covered issues related to the Defense Department and frequently reported from the cavernous military complex while working at the publication.\n\nIn his resignation email, a copy of which was obtained by The New York Times, Mr. Thornebrooke called The Epoch Times’s signing of the pledge a choice to “abdicate our responsibility as journalists in favor of merely repeating state narratives.”\n\nHe also cited a recent editorial directive to refer to antifa, the far-left ideological movement, as a terrorist organization. There is no designation for domestic terrorism under existing U.S. law. The editorial change came soon after President Trump signed an executive order designating antifa a terrorist group.\n\n“I can no longer reconcile my role with the direction the paper has chosen, including its increasing willingness to promote partisan materials, publish demonstrably false information, and manipulate the reporting of its ground staff to shape the worldview of our readers,” Mr. Thornebrooke wrote.\n\nThe Epoch Times, which publishes online and also has a weekly print newspaper that is circulated nationwide, did not respond to a request for comment on the resignation. The publication is closely linked to the Falun Gong religious movement, which was founded in China. It is known for its fierce criticism of that country’s Communist government, for spreading conspiracy theories and for its staunch support of Mr. Trump, backing his policies and criticizing his political opponents.\n\nThe paper is one of only three U.S.-based outlets to sign the 21-page pledge, which was first distributed to news outlets late last month. The other organizations that signed are the conservative cable network One America News Network and the digital outlet The Federalist. A handful of freelancers and independent journalists also signed."
  },
  {
    "category": "Business",
    "title": "Wealthy Americans Are Spending. People With Less Are Struggling.",
    "link": "https://www.nytimes.com/2025/10/19/business/economic-divide-spending-inflation-jobs.html",
    "pub_date": "Sun, 19 Oct 2025 09:01:30 +0000",
    "pub_date_fmt": "2025-10-19 05:01 EDT",
    "snippet": "Data show a resilient economy. But that largely reflects spending by the rich, while others pull back amid high prices and a weakening labor market.",
    "content": "Outside the Pilsen Food Pantry in Chicago. The divide between rich and poor is hardly new, in Chicago or the rest of the country, but it has become more pronounced in recent months.Credit...Akilah Townsend for The New York Times\n\nSupported by\n\nBy Ben Casselman and Colby Smith\n\nBen Casselman reported from Chicago and Colby Smith from New York.\n\nBy the time the Pilsen Food Pantry opened on a recent morning, Ulysses Moreno had been there for two hours — with a line of people behind him that snaked around the corner.\n\n“This is a lifeline for me,” said Mr. Moreno, 39. He had lost his construction job a few days earlier, and with three teenagers at home, he wanted to make sure he could stock up. “Our food budget doesn’t stretch as far as it used to.”\n\nA few miles away, on Chicago’s glitzy Magnificent Mile, luxury hotels are bustling. Jewelry stores and designer boutiques do brisk business. The restaurants are packed with diners sipping $20 cocktails while they wait for tables.\n\nTo Evelyn Figueroa, a family physician who founded and runs the Pilsen pantry, the dichotomy is striking."
  },
  {
    "category": "Business",
    "title": "The Tech Right Gets Its Own Phyllis Schlafly",
    "link": "https://www.nytimes.com/2025/10/19/business/katherine-boyle-andreesen-horowitz-american-dynamism.html",
    "pub_date": "Sun, 19 Oct 2025 09:01:05 +0000",
    "pub_date_fmt": "2025-10-19 05:01 EDT",
    "snippet": "Katherine Boyle, an influential venture capitalist who is a friend of the vice president, thinks the country’s path forward involves cultural conservatism and more weapons production.",
    "content": "Advertisement\n\nIn early 2022, the investor Katherine Boyle looked out and saw a nation in malaise. Birthrates were declining. The military was overspending and underdelivering, in her estimation. Public trust in institutions had sunk to historic lows. And the American government, she believed, was too hamstrung by bureaucracy and special interests to fix any of it.\n\nShe also spotted an unlikely silver lining: The pandemic had been a disruptive “black swan” event that she believed could finally crack open the status quo. In an essay titled “Building American Dynamism,” she declared, “I believe the only way to reverse the course of stagnation and kick-start nationwide renewal post-Covid is through technologists building companies that support the national interest.”\n\nThe post, published on the website of Andreessen Horowitz, where Ms. Boyle is a general partner, marked the launch of that venture capital firm’s $600 million “American Dynamism” fund. Targeting early-stage companies in industries like defense, energy, education and manufacturing, the fund has already helped produce billion-dollar start-ups. It also opened a new chapter in Ms. Boyle’s bid to exert influence in both Silicon Valley and Washington.\n\nFor most of her career, Ms. Boyle — religious, Republican and not unlike a 21st-century Phyllis Schlafly — was an outlier in the tech world. But today, as Silicon Valley undergoes a generational shift to the right, many of her once-contrarian views are making their way into the mainstream. Thanks in part to her longstanding friendship with Vice President JD Vance, she has also become one of the tech world’s most reliable conduits to the Trump administration.\n\nHer impact is visible in the venture capital industry’s newfound embrace of defense tech, in its open support for Donald J. Trump’s 2024 presidential campaign and in the government’s deepening ties with the tech industry, from the Department of Government Efficiency to the Department of Defense.\n\nSince 2022, Ms. Boyle’s investing thesis has snowballed into a new language of “patriotic investing,” a crop of copycat funds across the industry and a rising class of politically conservative hard-tech founders who talk a lot about what America represents.\n\nMany of the ideas that Ms. Boyle, 39, has promoted have nothing ostensibly to do with her investing portfolio. In a keynote speech at the American Enterprise Institute last winter, Ms. Boyle told the audience: “We are living in an age of memetic power and memetic war. Meme it and we will be it.” As one of X’s most influential posters, she has declared that we are entering “an era of the martyr” after the assassination of the conservative activist Charlie Kirk and endorsed the Trump administration’s military strikes on drug cartels. (“Destroy them all.”)"
  },
  {
    "category": "Business",
    "title": "The WNBA Has Become Extremely Popular. Ticket Prices Are Now Rising.",
    "link": "https://www.nytimes.com/2025/10/19/business/wnba-fans-tickets-prices.html",
    "pub_date": "Sun, 19 Oct 2025 09:00:52 +0000",
    "pub_date_fmt": "2025-10-19 05:00 EDT",
    "snippet": "Significant growth over multiple seasons has earned professional women’s basketball a wider audience, and with it higher prices.",
    "content": "Advertisement\n\nJudy Berkowitz isn’t really the type of fan the Women’s National Basketball Association is focused on attracting these days.\n\nMs. Berkowitz, 57, lives in Dunwoody, Ga., and has been an Atlanta Dream fan since the team’s first season in 2008. When she was in her late 30s, team representatives visited her local women’s basketball league and handed out tickets. The next year they offered a grateful Ms. Berkowitz free season tickets.\n\n“She said, ‘Here’s the deal with it: Bring somebody new to every game, and if you can’t make a game, make sure the seats are filled,’” Ms. Berkowitz said of the Dream rep. “And I did. It was trying to get other people to enjoy the W.N.B.A.”\n\nMs. Berkowitz is now a single mother with two children ages 11 and 13. She used to work as a federal contractor, but her career prospects have suffered in recent years. She is unemployed and living off her retirement savings.\n\nIn the W.N.B.A.’s early years, Ms. Berkowitz recalled, four people could go to a Dream game and buy concessions for $40. Now, the better seats are around $70 or more. She hasn’t seen the Dream in person since 2016, though she has attended several men’s and women’s college basketball games in recent years. In March, the Dream announced that they had sold out their season ticket allotment for the second straight year.\n\n“It’s such a great family-friendly event, but I can’t afford $250 for one night out with the kids,” she said.\n\nThe W.N.B.A., often treated like the National Basketball Association’s kid sister since launching in 1996, is rapidly maturing. The last two years have brought record attendance and broadcast ratings. Five expansion franchises will take the league to 18 teams by 2030, the largest it has ever been. A media rights deal starting next season will pay an average of $200 million a year, quadruple the previous deal. And expansion fees ($250 million each for the last three teams) and team valuations have ballooned."
  },
  {
    "category": "Business",
    "title": "Can a University From Tennessee Help Accelerate Growth in West Palm Beach?",
    "link": "https://www.nytimes.com/2025/10/19/business/vanderbilt-university-expansion.html",
    "pub_date": "Sun, 19 Oct 2025 09:00:10 +0000",
    "pub_date_fmt": "2025-10-19 05:00 EDT",
    "snippet": "At a time of financial and enrollment uncertainty in higher education, Vanderbilt University, along with other schools, has forged ahead with expansion.",
    "content": "Advertisement\n\nAt a dinner in San Francisco this year, an attendee suggested to Daniel Diermeier, the chancellor of Vanderbilt University, that the Nashville institution founded 150 years ago should build a campus in the Bay Area.\n\nThe proposal wasn’t completely out of left field: Vanderbilt was already designing a new campus in West Palm Beach, Fla., entering a 99-year lease for a former theological seminary in Manhattan and planning an expansion in Nashville.\n\nThe Bay Area has no shortage of world-class schools, with Stanford and the University of California, Berkeley, flanking the region. Nonetheless, “community interest is high,” Mr. Diermeier said, especially as a means to revitalize San Francisco’s downtown area. For its part, the university is attracted to the area’s tech and artificial intelligence ecosystems, which could serve as a draw for students and a vibrant source for jobs.\n\nNew campuses not only allow universities to meet potential students where they live, but can also have significant impacts on the surrounding cities. Much as professional sports teams have revitalized neighborhoods with real estate projects beyond arenas and stadiums, universities entering new communities can drive economic development by attracting new businesses that cater to students, faculty and staff. They can also act as community resources with programs and lectures open to the public, and can contribute to entrepreneurship through the development of patents and other innovations at the university.\n\n“The research shows that universities are major drivers of long-term growth and prosperity as well as wages,” said Scott Andes, a professor at Carnegie Mellon University in Pittsburgh who also advises the school’s president on economic development. “The main driver is human capital — talented people coming and staying in a region, increasing the skills in the area.”\n\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\n\nThank you for your patience while we verify access."
  },
  {
    "category": "Technology",
    "title": "Benioff Apologizes for Saying Trump Should Send Troops to San Francisco",
    "link": "https://www.nytimes.com/2025/10/17/us/benioff-apologizes-san-francisco.html",
    "pub_date": "Fri, 17 Oct 2025 22:06:07 +0000",
    "pub_date_fmt": "2025-10-17 18:06 EDT",
    "snippet": "Marc Benioff, the chief executive of Salesforce, said he no longer believed that National Guard troops were needed in the city.",
    "content": "Advertisement\n\nMarc Benioff apologized on Friday for saying President Trump should send the National Guard to San Francisco after a week of being hammered by the city’s leaders and even some of his fellow tech titans for the remarks.\n\n“I do not believe the National Guard is needed to address safety in San Francisco,” Mr. Benioff, the Salesforce founder and chief executive, posted on X. He added that he made the remarks out of caution as his annual Dreamforce conference ramped up in the city and brought an extra 50,000 people downtown.\n\n“I sincerely apologize for the concern it caused,” he wrote. “It’s my firm belief that our city makes the most progress when we all work together in a spirit of partnership.”\n\nMr. Benioff initially said the National Guard should come to San Francisco in a phone interview with The New York Times last week. He said that San Francisco’s police force needed 1,000 more officers and that he hoped the National Guard could help fill those gaps.\n\n“We don’t have enough cops, so if they can be cops, I’m all for it,” he had said in the interview.\n\nThose remarks drew condemnation from many San Francisco leaders.\n\nMayor Daniel Lurie and Representative Nancy Pelosi said federal troops were not needed or wanted in a city where crime rates were dropping and more police officers were being hired. The local district attorney, Brooke Jenkins, blasted Mr. Benioff for backing “government-sponsored violence against U.S. citizens.”"
  },
  {
    "category": "Technology",
    "title": "Instagram Unveils Teen Safety Features for A.I. Chatbots",
    "link": "https://www.nytimes.com/2025/10/17/technology/instagram-teen-safety-features-ai-chatbots.html",
    "pub_date": "Fri, 17 Oct 2025 16:28:54 +0000",
    "pub_date_fmt": "2025-10-17 12:28 EDT",
    "snippet": "Instagram is introducing parental controls and limits to conversations on topics like self-harm as concerns grow over how A.I. chatbots affect mental health.",
    "content": "Advertisement\n\nInstagram on Friday unveiled safety features for teenagers who use its artificial intelligence chatbots amid growing concerns over how the chatbots are affecting young people’s mental health.\n\nThe features, which will be rolled out early next year, would give parents more control over how teenagers used Instagram’s “A.I. characters,” which have fictional personalities that users can message with as they would other human accounts.\n\nParents would be able to block their children from having conversations with certain A.I. characters, and Instagram would send them summaries of their children’s chats, the company said. Instagram would also limit chatbot conversations on topics like self-harm, eating disorders and romance, while allowing “age-appropriate topics” like education, sports and hobbies.\n\n“We hope today’s updates bring parents some peace of mind that their teens can make the most of all the benefits A.I. offers, with the right guardrails and oversight in place,” the company said in a blog post. The post was signed by Adam Mosseri, the head of Instagram, and Alexandr Wang, the chief A.I. officer of Meta, which owns Instagram.\n\nA.I. chatbots, which can generate responses in chats in seemingly humanlike ways, have been under scrutiny for how they affect teenagers who spend hours a day confiding in them. They have been blamed for driving some children to suicide and sending some adults into delusional spirals.\n\nMeta is not the only company contending with how to make its chatbots safer. Last month, OpenAI, the A.I. start-up behind ChatGPT, announced new teen safety features such as parental controls.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times."
  },
  {
    "category": "Technology",
    "title": "Renting a San Francisco Apartment in the A.I. Boom? Good Luck.",
    "link": "https://www.nytimes.com/2025/10/16/technology/san-francisco-rent-ai-boom.html",
    "pub_date": "Thu, 16 Oct 2025 13:00:10 +0000",
    "pub_date_fmt": "2025-10-16 09:00 EDT",
    "snippet": "The artificial intelligence gold rush has pushed San Francisco’s residential rents up by the most in the nation, as A.I. companies lease apartments and offer rent stipends to employees.",
    "content": "Roy Lee, Cluely’s chief executive, at his home in Cluely’s office in San Francisco. His start-up has leased apartments for its employees.Credit...Amy Osborne for The New York Times\n\nSupported by\n\nBy Natallie Rocha\n\nReporting from San Francisco\n\nAfter Roy Lee’s artificial intelligence start-up, Cluely, landed $5.3 million in venture capital funding this spring, he orchestrated a San Francisco real estate coup.\n\nIn May, Cluely leased eight apartments for its employees at a new luxury complex — where rents start at $3,000 a month and reach $12,000 a month for penthouse units — just a one-minute walk from its office in the city’s South of Market neighborhood. The apartments were a mix of one-bedroom and two-bedroom units in the 16-story building, which offers a fitness center, a rooftop bar, and concierge and housecleaning services.\n\n“Going to the office should feel like you’re walking to your living room, so we really, really want people close,” said Mr. Lee, 22, who chose not to move into the apartments and lives in Cluely’s office, which is housed in a loftlike single-family home. “I feel like I’m more trying to build a frat house, and you don’t commute to a frat house.”\n\nDriven by a boom in A.I. companies like Cluely, San Francisco’s residential rents have soared the most in the nation over the past year. Apartment prices in the city rose an average of 6 percent in that time, more than double the 2.5 percent increase in New York City, according to the real estate tracker CoStar. That now puts the average rent for a San Francisco apartment at $3,315 a month, right behind New York City’s $3,360, which is the nation’s highest."
  },
  {
    "category": "Technology",
    "title": "California Regulates A.I. Companions + OpenAI Investigates Its Critics + The Hard Fork Review of Slop",
    "link": "https://www.nytimes.com/2025/10/17/podcasts/california-regulates-ai-companions-openai-investigates-its-critics-the-hard-fork-review-of-slop.html",
    "pub_date": "Fri, 17 Oct 2025 11:00:06 +0000",
    "pub_date_fmt": "2025-10-17 07:00 EDT",
    "snippet": "Could this be a blueprint for the nation?",
    "content": "Hosted by Kevin Roose and Casey Newton\n\nProduced by Rachel Cohn and Whitney Jones\n\nEdited by Jen Poyant\n\nEngineered by Chris Wood\n\nOriginal music by Dan PowellElisheba IttoopRowan Niemisto and Diane Wong\n\nThis week, Gov. Gavin Newsom of California signed a big package of A.I. and social media bills into law — including the first state law in the United States to regulate A.I. companions. We talk through what stood out to us in the package and whether these protections will work. Then, the subpoena that has the whole tech world talking. Nathan Calvin, general counsel at Encode, an A.I. safety advocacy group that has been critical of OpenAI, talks with us about why he thinks the company is investigating him. And finally, grab your opera glasses. It’s time for the first edition of The Hard Fork Review of Slop.\n\nGuests:\n\nNathan Calvin, vice president of state affairs and general counsel at Encode"
  },
  {
    "category": "Technology",
    "title": "The Culture Wars Came for Wikipedia. Jimmy Wales Is Staying the Course.",
    "link": "https://www.nytimes.com/2025/10/18/magazine/jimmy-wales-interview.html",
    "pub_date": "Sat, 18 Oct 2025 16:47:08 +0000",
    "pub_date_fmt": "2025-10-18 12:47 EDT",
    "snippet": "Attacks on the site are piling up. Its co-founder says trust the process.",
    "content": "Credit...Philip Montgomery for The New York Times\n\nSupported by\n\nBy Lulu Garcia-Navarro\n\nAs one of the most popular websites in the world, Wikipedia helps define our common understanding of just about everything. It’s the closest thing the internet has to a public utility. Founded in 2001 by Larry Sanger and Jimmy Wales, Wikipedia has always operated as a nonprofit with a decentralized system of editing by mostly anonymous volunteers. There are rules for how people should engage on the site (cordially) and how changes are made (transparently). That has led some to call Wikipedia “the last best place on the internet.”\n\nBut recently, the site has become a favorite target of Elon Musk, congressional Republicans and right-wing influencers, who all claim that Wikipedia is biased. (Sanger now says the same.) In many ways, this tension is a microcosm of broader conversations we’re having about consensus, civility, shared reality, truth and facts.\n\nNow Jimmy Wales has written a book titled “The Seven Rules of Trust: A Blueprint for Building Things That Last,” which will be published this month. In it, Wales tries to apply the lessons of Wikipedia’s success to our increasingly partisan, trust-depleted world. I talked to Wales about what, in his view, makes Wikipedia great, the various threats it’s facing and his persistent belief that most people are acting in good faith. And a note: Wales and I spoke several weeks before a man with a gun walked up on the stage at a Wikipedia conference in Manhattan on Friday. You can read more about that incident here.\n\nSubscribe: Apple Podcasts | Spotify | YouTube | Amazon | iHeart\n\nThis is a very tenuous moment for trust, and your new book is all about that. Big picture: How would you describe our current trust deficit? I draw a distinction between what’s going on with politics, journalism, the culture wars and all of that, and day-to-day life. In day-to-day life, people still do trust each other. People generally think most people are basically nice and we’re all human beings bumping along on the planet trying to do our best. But the crisis we see in politics — trust in politicians, trust in journalism, trust in business — is coming from other places and is something that we can fix."
  },
  {
    "category": "Science",
    "title": "Sea Otters Are Stealing Surfboards in Santa Cruz. Again.",
    "link": "https://www.nytimes.com/2025/10/18/science/sea-otters-surfboard-santa-cruz.html",
    "pub_date": "Sat, 18 Oct 2025 20:44:23 +0000",
    "pub_date_fmt": "2025-10-18 16:44 EDT",
    "snippet": "Two years after Otter 841 menaced wave riders near Santa Cruz, there have been new encounters between the furry marine mammals and surfers.",
    "content": "Advertisement\n\nOn Wednesday, Isabella Orduna was catching some waves at Steamer Lane, a popular surf spot off Santa Cruz, Calif., when she felt a small nip on her foot.\n\nStartled, Ms. Orduna, a 21-year-old college student, rolled into the water. The moment she surfaced, she saw a “big, fuzzy, chunky bear of an otter” sitting on her board, she said. “I was like, wow, what do I do now?”\n\nThe hijacking of Ms. Orduna’s surfboard was the first of two such incidents reported this week at Steamer Lane. On Thursday, another surfer had their board commandeered by a sea otter.\n\nIf this sounds familiar, that’s because similar incidents happened there in 2023: A female sea otter known as 841 became a sensation after she climbed aboard several surfboards and evaded capture.\n\nIt’s unclear if 841 is the culprit in this week’s cases. If it’s her, the cases may be written off as troublesome behavior by a repeat offender. But experts say it’s possible that another otter has begun to see the appeal of surfing.\n\nThat may highlight the need to manage clashes between a rising number of human aquatic sports enthusiasts and a resurgent population of marine mammals in their natural habitat. For now, people in the community are calling on surfers and others in the ocean to keep their distance for their own safety and that of the otters.\n\nMs. Orduna, who is new to surfing, was about done for the day and heading back to shore when she had her otter encounter."
  },
  {
    "category": "Science",
    "title": "How Psychedelic Mushrooms Evolved Their Magic",
    "link": "https://www.nytimes.com/2025/10/18/science/how-psychedelic-mushrooms-evolved-their-magic.html",
    "pub_date": "Sat, 18 Oct 2025 09:02:07 +0000",
    "pub_date_fmt": "2025-10-18 05:02 EDT",
    "snippet": "Two distantly related groups of mushrooms take radically different routes to producing psilocybin, a mind-bending molecule.",
    "content": "Advertisement\n\nNo one knows why magic mushrooms evolved to produce psilocybin, a powerful psychedelic molecule. But this trait was apparently so beneficial for fungi that it independently evolved in two distantly related types of mushrooms.\n\nAn even greater surprise to biologists was that rather than arriving at the same solution for producing psilocybin, the two groups pursued completely different biochemical pathways, according to a study published last month in the journal Angewandte Chemie International Edition.\n\n“This finding reminds us that nature finds more than one way to make important molecules,” said Dirk Hoffmeister, a pharmaceutical microbiologist at Friedrich Schiller University Jena in Germany and an author of the study. He added that it was also evidence that mushrooms were “brilliant chemists.”\n\nPractically speaking, Dr. Hoffmeister said, the research also suggested a possible new path for synthesizing psilocybin for use in scientific research and therapies. “We can expand our toolbox,” he said.\n\nPsilocybe and Inocybe mushrooms occur in some of the same habitats, but they follow different lifestyles. Psilocybe, the group that includes what are traditionally called magic mushrooms, thrives on decaying material such as decomposing organic matter or cow dung. Inocybe, commonly known as fiber caps, are symbiotic organisms that form intimate, mutually beneficial relationships with trees.\n\nIn 1958, Albert Hofmann, the Swiss chemist who discovered LSD, became the first researcher to isolate psilocybin from Psilocybe mushrooms. Some scientists later suspected that a few Inocybe mushrooms also produced the compound. Since then, psilocybin has been identified in around half a dozen Inocybe species. (The other species tend to produce a potent neurotoxin.)\n\nSome researchers hypothesized, however, that the enzymatic formula magic mushrooms use to make psilocybin might not be the only way nature has found to create the molecule. The new study offers biochemical evidence supporting that hunch."
  },
  {
    "category": "Science",
    "title": "You’re About to Learn How Part of the Sausage Gets Made",
    "link": "https://www.nytimes.com/2025/10/19/science/sausage-casings.html",
    "pub_date": "Sun, 19 Oct 2025 09:00:56 +0000",
    "pub_date_fmt": "2025-10-19 05:00 EDT",
    "snippet": "If Oktoberfest brings links to your plate, there’s more to know about the meat- and vegetable-based casings they’re stuffed into.",
    "content": "Advertisement\n\nHumans have been making sausages for thousands of years. Grinding up meaty odds and ends and repurposing them into the kinds of sausages now found at an Oktoberfest celebration ensured that no part of a kill went to waste.\n\nAnd animal intestines provided a ready-made way of holding that meat, said Gary Sullivan, a meat scientist at the University of Nebraska-Lincoln.\n\n“We had these natural tubes,” he said.\n\nBut now, with a proliferation of options for holding sausages together, some of them plant-based, one could say there have never been more wurst cases.\n\nSausage makers rely on intestines from a variety of animals. The differences mainly have to do with the desired size of the final sausage.\n\n“The intestine of a sheep is small like your finger,” said Christie Eichentopf, an owner of Otto’s Sausage Kitchen in Portland, Ore. “The intestine of a cow is like a half-dollar.”\n\nBut there are drawbacks to natural casings. For starters, they typically cost more."
  },
  {
    "category": "Science",
    "title": "An Army of Robot Telescopes in Texas Makes the Stars Feel Closer Than Ever",
    "link": "https://www.nytimes.com/2025/10/17/science/starfront-observatories-remote-astronomy.html",
    "pub_date": "Fri, 17 Oct 2025 09:00:19 +0000",
    "pub_date_fmt": "2025-10-17 05:00 EDT",
    "snippet": "Starfront Observatories allows amateur astronomers to rent a spot for their telescopes and photograph the cosmos over a high-speed data connection.",
    "content": "In a year and a half, Starfront Observatories in Rockwood, Texas, has grown from zero telescopes to more than 550.Credit...Jordan Vonderhaar for The New York Times\n\nSupported by\n\nBy Kenneth Chang\n\nKenneth Chang stayed up late during an August visit to Starfront Observatories’ 11 sheds in Rockwood, Texas.\n\nDuring the day, this patch of land in sparsely populated Central Texas is not remarkable. Eleven buildings, nearly identical, look like bland, oversize backyard sheds. Several large R.V.s are parked nearby.\n\nNot long ago, cows grazed here.\n\nBut as the sun sets on a clear day, the buildings groan and creak as the roof of each shed rolls back, like the sliding lid on a wooden box.\n\nRevealed within the sheds are hundreds of telescopes, which intermittently twitch and pirouette, a robot army awakening. Their owners are nowhere to be seen."
  },
  {
    "category": "Science",
    "title": "Save the Whales. But Save the Microbes, Too.",
    "link": "https://www.nytimes.com/2025/10/17/science/microbes-endangered-preservation.html",
    "pub_date": "Fri, 17 Oct 2025 09:02:24 +0000",
    "pub_date_fmt": "2025-10-17 05:02 EDT",
    "snippet": "Conservation biologists propose a daunting task: protecting Earth’s diversity of bacteria and other microbes.",
    "content": "Advertisement\n\nHundreds of scientists have joined together to save a group of species from extinction, a group that might not seem like it needs saving: microbes.\n\nMicrobes need protection for many reasons, researchers say, including the fact that other species — indeed, entire ecosystems — depend on their well-being. “We need them in order to help conserve the pandas and the rainforests and the whales and the oceans and everything else in between,” said Jack Gilbert, a microbiologist at the University of California, San Diego.\n\nWe are living through an extinction crisis, but nearly all of the extinctions conservation biologists have definitively documented so far have involved animals or plants. On Friday, the International Union for Conservation of Nature, which publishes a list of endangered and vulnerable species, announced the newest additions, including the slender-billed curlew, a migratory shorebird and an ebonylike tree called Diospyros angulata.\n\nHumans are driving these species to extinction by hunting them, destroying wetlands and other habitats, cutting down forests, and heating the planet. But as powerful as these pressures are, extinction is not inevitable. On Friday, the I.U.C.N. also announced that the green sea turtle had rebounded, thanks to measures such as protecting the eggs the animals lay on beaches. The organization has officially changed the status of the species from endangered to least concern.\n\nBut animals and plants represent only a fraction of the biological diversity on the planet. Fungi — which are a separate lineage from animals and plants — include millions, or perhaps even tens of millions, of species. But I.U.C.N. scientists started assessing their status only a decade ago, and so far they’ve evaluated just 1,300 species. That’s enough species to reveal that fungi are also gravely threatened. One-third of those 1,300 species are at risk of extinction.\n\nNow I.U.C.N. researchers are casting an even wider net: They’re setting out to protect the world’s diversity of bacteria and other microbes.\n\nThis may be the most daunting effort in the history of conservation. Microbes make up the most of the genetic diversity on Earth, but microbiologists have barely begun cataloging them. All told, there may be 100 billion species of microbes."
  }
]