[
  {
    "id": 1,
    "title": "Reeves refuses to rule out income tax rises in Budget",
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/cgr4g89g1x8o?at_medium=RSS&at_campaign=rss",
    "description": "Chancellors rarely reveal tax plans before the Budget, but Reeves has softened her language on raising income tax.",
    "pub_date": "Fri, 24 Oct 2025 16:55:49 GMT",
    "content": "Chancellor Rachel Reeves has refused to rule out an income tax rise in next month's Budget, amid speculation she is considering breaking a key Labour election pledge.\n\nAsked about reports, first published in The Guardian newspaper, that the Treasury is in active discussions over raising the rate, Reeves said she would \"continue to support working people by keeping their taxes as low as possible\".\n\nReeves' refusal to rule out a rise does not mean one is inevitable as Chancellors rarely confirm or deny specific tax measures ahead of a Budget.\n\nBut her careful language contrasts with comments in September that \"manifesto commitments stand\" on not raising income tax, National Insurance or VAT.\n\nLabour's 2024 general election manifesto contained a pledge not to raise \"the basic, higher, or additional rates of income tax\".\n\nThe party also promised not to increase National Insurance - prompting a row last autumn when it announced a hike in the contributions paid by employers.\n\nSpeaking to journalists in Leeds on Friday, Reeves said: \"Although I can't talk about individual measures at this stage, I understand that the cost of living is still people's number one concern.\"\n\nShe went on to say that her aim was to \"ensure that we continue to support working people by keeping their taxes as low as possible\" but that she was still \"going through the process\" of writing her Budget.\n\nShe also said that although the inflation figures this week \"came in better than expected\" there was \"obviously much more to do.\"\n\nThe chancellor has signalled she is likely to focus on wealthy individuals at the Budget, saying \"those with the broadest shoulders should pay their fair share\".\n\nHowever, economists say such steps will not raise enough to close the hole in the government's finances, leaving Reeves under pressure to consider more politically sensitive options.\n\nInfluential think-tank the Institute for Fiscal Studies (IFS) says Reeves will \"almost certainly\" have to raise taxes to make up a £22bn shortfall in the government's finances.\n\nThe effective interest rates on UK government debt has fallen sharply, but Reeves has been left with very little room to meet her self-imposed fiscal rules without increasing taxes.\n\nThese rules mean her plans must be projected to get government debt falling as a share of national income by 2029-30, and day-to-day government costs must be paid for by tax income rather than borrowing.\n\nCurrently, Income tax is charged on earnings above the personal allowance of £12,570, which is tax-free.",
    "crawled_at": "2025-10-24T16:18:38.209140",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 4,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 2,
    "title": "Tech bosses could stop mobile phone theft, say MPs",
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/cx2y037pg41o?at_medium=RSS&at_campaign=rss",
    "description": "The chair of the Science, Innovation and Technology Committee says \"robust technical measures\" could help reduce phone thefts. ",
    "pub_date": "Fri, 24 Oct 2025 13:14:09 GMT",
    "content": "Tech giants including Apple, Samsung and Google are not doing enough to stop mobile phone thefts, MPs on the Science, Innovation and Technology Committee have said.\n\nIn a letter to the Home Secretary Shabana Mahmood, committee chair Chi Onwurah accused the companies of failing to put in place technical measures that would make stolen phones less valuable.\n\nThe letter follows a stormy committee hearing, where MPs accused tech bosses of profiting from phone thefts.\n\nResponding to the letter, Google said it had \"invested in advanced theft protection features\" including the theft detection lock after \"listening to victims and partnering closely with law enforcement and industry\".\n\nApple and Samsung have also been contacted for comment.\n\nWriting to Mahmood, Onwurah said that during the hearing in June, the committee had sought to \"answer the question: Is there a way to design out phone theft?\"\n\n\"The answer, in the view of the committee, is yes.\"\n\nThe problem of mobile phone thefts is particularly prevalent in London where, in 2024, 80,000 smartphones were reported as stolen - up from 64,000 in 2023.\n\nStolen devices are blocked from being used in the UK by phone networks by using the phone's unique identifying number - known as an IMEI - but this is not the case globally.\n\nOnwurah argued that \"robust technical measures\" such as blocking stolen phones taken overseas from accessing cloud services could make devices \"far less valuable\".\n\nShe also pointed to comments by Mobile UK, the trade association of the UK's mobile network operators, who said blocking IMEI in other countries was a \"necessary step to dismantle the business model of organised crime\".\n\nHowever, she said when giving evidence, Apple, Google and Samsung had avoided saying why they would not implement the technology.\n\n\"Their repeated pivots to answering questions about data security rather than devices, and insistence that the phones were broken down and sold for parts, without any evidence to support this assertion, was telling,\" she said.\n\n\"Technology to deter phone theft is available, and we have yet to hear a convincing reason why, with co-operation on all sides, the available solutions shouldn't be used to disincentivise phone theft and disrupt the market in stolen devices.\"\n\nOnwurah asked the home secretary if she would push the tech giants to implement cloud-based blocking and also pressed the minister to provide a data for the next phone theft summit.",
    "crawled_at": "2025-10-24T16:18:38.565742",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 4,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 3,
    "title": "Booker Prize launches new award for children's fiction including young judges",
    "source": "BBC Entertainment",
    "url": "https://www.bbc.com/news/articles/c5ydgg1lzdgo?at_medium=RSS&at_campaign=rss",
    "description": "The prize will be judged by both adults and children, with the first award to be announced in 2027.",
    "pub_date": "Fri, 24 Oct 2025 08:46:37 GMT",
    "content": "The prestigious Booker Prize organisers have launched a new prize for children's fiction, featuring a panel of child and adult judges.\n\nThe Children's Booker Prize, which will launch in 2026 and be awarded annually from 2027, will celebrate the best contemporary fiction for children between the ages of eight and 12.\n\nUK Children's Laureate Frank Cottrell-Boyce, whose books include the hugely popular Millions, published in 2004, will be the inaugural chair of judges for 2027.\n\nHe said: \"I am absolutely buzzing about the news that I'm going to be chairing the judging panel. It's going to be - as they say - absolute scenes in there. Let the yelling commence.\"\n\nCottrell-Boyce and two other adult judges will select a shortlist of eight books, with three children then joining to help choose the winning book.\n\nGaby Wood, chief executive of the Booker Prize Foundation, said: \"The Children's Booker Prize is the most ambitious endeavour we've embarked on in 20 years - and we hope its impact will resonate for decades to come.\"\n\nAt least 30,000 copies of the shortlisted and winning books will be gifted to children.\n\nWood said the award aimed to \"champion future classics\" and was also designed \"to inspire more young people to read\".\n\n\"This prize will make books more available for a lot of kids,\" he said, adding it was also \"going to really ignite a conversation\".\n\nOther authors and previous Children's Laureates who have welcomed the announcement included Dame Jacqueline Wilson, who said it was \"a marvellous idea\".\n\nFellow children's author Anne Fine said: \"When it comes to book prizes, we all say, The More The Merrier [in a nod to her book of the same name], and especially when it comes to writing for children, which has all too often been the overlooked Cinderella of the book world.\"\n\nAs with the Booker Prize and International Booker Prize, the shortlisted authors will each receive £2,500 and the winning author £50,000.\n\nThe prize will accept submissions from publishers in spring 2026, when the remaining two adult judges will be announced.\n\nThe shortlist of eight books - and the three child judges - will be revealed in November next year, while the winner will be announced at an event for young readers in February 2027.\n\nThe prize will be open to global authors for books written originally in English and for those translated into English, as long as they are published in the UK or Ireland between 1 November 2025 and 31 October 2026.",
    "crawled_at": "2025-10-24T16:18:44.963083",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 4,
    "title": "Huge noise then I yelled to get out - Louvre attendant recalls shock of heist",
    "source": "BBC Entertainment",
    "url": "https://www.bbc.com/news/articles/ckgk2ppvl5wo?at_medium=RSS&at_campaign=rss",
    "description": "The attendant describes the moment thieves used an angle grinder to burst into the Gallery of Apollo.",
    "pub_date": "Fri, 24 Oct 2025 10:29:01 GMT",
    "content": "A gallery attendant on duty at the Louvre when thieves broke in and stole eight of France's crown jewels has said \"no-one could have been prepared\" for what unfolded as visitors began to arrive on Sunday morning.\n\n\"All of a sudden we heard an huge noise,\" she told radio station France Inter, in the first account given by an attendant at the scene.\n\nThe unnamed attendant and two colleagues initially thought the noise to be an angry visitor, but it was not a normal sound: \"It was a dull, slightly metallic noise.\"\n\nIt was, in fact, the moment thieves had used an angle grinder to burst through a reinforced window into the Gallery of Apollo, where the Louvre's collection of historic jewelry is kept.\n\nWithin eight minutes, the gang seized treasures, including a necklace that belonged to Napoleon's wife Empress Marie-Louise and a diadem of Napoleon III's wife Empress Eugenie, worth an estimated total of €88m (£77m).\n\nThe thieves used a mechanical ladder on the back of a lorry to lift them to a first-floor balcony to gain entry to the gallery.\n\nTwo tourists ran towards them in panic, she said.\n\n\"I saw one of the criminals turn around with something that looked to me like a chainsaw, then I yelled at my colleagues to get out,\" she recalled. She shouted a second time that it was a robbery and that they should run.\n\nOne of her colleagues raised the alarm over a walkie-talkie and then \"we finished evacuating the visits without quite realising really what was going on\". They shut all the doors as they left to protect the neighbouring galleries.\n\nOn reflection, the attendant said \"for us it was unbelievable the display cases could have been broken... never for a moment did we think there was such a risk... nobody can be prepared for that\".\n\nAnother Louvre employee came forward to describe the moments after the gang escaped.\n\nThe anonymous security guard spoke of a very strong smell of petrol as he arrived at the scene outside the Louvre where the gang had parked their lorry.\n\n\"I ran outside through the [glass] pyramid and across the courtyard... I got there at the very moment the criminals got away by scooter,\" he told BFMTV.\n\nThe gang had ruptured the lorry's fuel tank and there was a blowtorch near by, he said. \"It's clear they intended to set fire to their vehicle. I genuinely think we thwarted their plan because they would never have left behind so much evidence.\"\n\n\"They even lost one of the pieces they'd meant to steal, because they'd lost [Empress] Eugenie's crown, which they'd just stolen and it had fallen on the ground.\"",
    "crawled_at": "2025-10-24T16:18:45.265521",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 5,
    "title": "Ukraine allies pledge to take Russian oil and gas off global market",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/c17p54edxljo?at_medium=RSS&at_campaign=rss",
    "description": "A \"coalition of the willing\" meeting in London seeks to increase pressure on Russia to end its war in Ukraine.",
    "pub_date": "Fri, 24 Oct 2025 19:10:15 GMT",
    "content": "The UK and US have in recent days sanctioned Russia's two biggest oil companies, while the EU targeted Moscow's liquefied natural gas (LNG) exports.\n\nUkrainian President Volodymyr Zelensky, who was also in London, said \"pressure\" on Russia was the only way to stop the fighting. However, no long-range missile deliveries to Ukraine were announced at the summit.\n\nZelensky has long argued that US-made Tomahawks and European missiles would help make the war costs heavier for Moscow by hitting key military targets - including oil refineries and weapons depots - deep inside Russia.\n\nBut during last week's talks in Washington, US President Donald Trump indicated to Zelensky that he was not ready to supply Tomahawks.\n\nOn Thursday, President Putin warned that if \"such weapons are used to strike Russian Federation territory the response will be... overwhelming\".\n\nRussia launched a full-scale invasion of Ukraine in February 2022.\n\nSpeaking at a joint press conference after the London summit, Starmer said Putin was \"not serious about peace\", and therefore Ukraine's allies agreed a \"clear plan for the rest of the year\" on supporting Ukraine.\n\nThe UK prime minister said this also included targeting Russia's sovereign assets to \"unlock billions to help finance Ukraine's defence\". He gave no further details.\n\nOn Thursday, EU leaders agreed to help support Ukraine's \"financial needs\" for the next two years - but stopped short of agreeing to use frozen Russian assets worth €140bn (£122bn).\n\nAsked about a so-called \"reparations loan\" for Ukraine funded by the Russian assets, Danish Prime Minister Mette Frederiksen said she hoped a decision would be made by Christmas Eve\n\nIn London, the \"coalition of the willing\" also pledged to strengthen Ukraine's air defences\" amid almost daily Russian air assaults on Ukrainian civilians and energy infrastructure.\n\nZelensky warned that Russia \"wants to make the winter cold a tool of torment\", adding that \"they want to break us\".\n\nComments by the leaders in London will be disappointing for those who were hoping to hear specific examples of how Ukraine's allies were planning to make Russia stop attacking Ukraine.\n\nNo doubt, a lot of the words said will be pleasing to the Ukrainian ear. For example, Starmer said the UK and Ukraine's other allies were prepared to ratchet up pressure on Moscow.\n\nBut there were no concrete examples of how exactly the allies were planning to force a change on the battlefield or make Putin come to the negotiating table.",
    "crawled_at": "2025-10-24T16:18:50.595183",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 6,
    "title": "Prince Andrew's banner removed from chapel at Windsor Castle",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/c867j2wyxj0o?at_medium=RSS&at_campaign=rss",
    "description": "The flag is linked to his role as Knight of the Garter (KG), which he recently gave up. ",
    "pub_date": "Fri, 24 Oct 2025 16:08:34 GMT",
    "content": "The flag, linked to his membership of the Order of the Garter, which the prince gave up last week, was on display inside St George's Chapel but is no longer hanging there.\n\nLast Friday, Andrew announced he would also no longer use his royal titles, including Duke of York, after the publication of a posthumous memoir by Virginia Giuffre revived claims about his ties to Epstein.\n\nThe prince is under increasing pressure to lose further privileges, including the formal removal of his titles and his residence at Royal Lodge in Windsor.\n\nThe book, Nobody's Girl, was written by Ms Giuffre before she died earlier this year. She accused the prince of sexually assaulting her - allegations Prince Andrew has strenuously denied.\n\nPrince Andrew's banner, which he was given when he became a Knight of the Garter (KG) in 2006, had been hanging in the quire - the area where clergy and the choir sit for services.\n\nA virtual tour of the area available on the website for St George's Chapel shows it still hanging near the door leading into the quire. It is not known when the tour was created.\n\nHowever, the banner has now been removed and only three now hang in the space. It is thought it was taken down earlier in the week.\n\nThe Order of the Garter is the oldest and most senior order of chivalry in Britain and includes other senior members of the royal family and those said to have contributed notably to public life.\n\nCurrent non-royal members include former prime ministers Sir Tony Blair and Sir John Major.\n\nPrince Andrew is facing scrutiny over his Royal Lodge home in Windsor Great Park, where he has paid a \"peppercorn rent\" for more than 20 years.\n\nThe government this week refused to give MPs time to debate Prince Andrew's titles or taxpayer-funded home, despite growing pressure for scrutiny.\n\nThe Metropolitan Police has said it is \"actively\" looking into media reports that Prince Andrew tried to obtain personal information about Ms Giuffre through his police protection.\n\nPrince Andrew has also removed his royal titles from Companies House, changing his name from \"HRH the Duke of York KG\" to \"Prince Andrew.\" A document was filed listing a change of his details for his start up venture Pitch@Palace.\n\nOn 17 October, Andrew said he would stop using the titles because the \"continued accusations about me distract from the work of His Majesty and the Royal Family\".\n\n\"I vigorously deny the accusations against me,\" he said.",
    "crawled_at": "2025-10-24T16:18:50.909789",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 7,
    "title": "Sinner wins but host of players retire in Basel",
    "source": "BBC Tennis",
    "url": "https://www.bbc.com/sport/tennis/articles/ce8zgl03p00o?at_medium=RSS&at_campaign=rss",
    "description": "World number two Jannik Sinner progresses to the semi-finals of the Vienna Open with a dominant straight-set win over Alexander Bublik.",
    "pub_date": "Fri, 24 Oct 2025 19:54:10 GMT",
    "content": "Jannik Sinner reached all four Grand Slam singles finals in 2025\n\nJannik Sinner progressed to the semi-finals of the Vienna Open with a dominant straight-set win over Alexander Bublik.\n\nA single break of serve in both sets was enough for Italian world number two Sinner to maintain his pursuit of his fourth title of the year.\n\nFour-time Grand Slam champion Sinner, who lost only five points on serve during the entire match, will face Australia's Alex de Minaur for a place in the final.\n\nThe 24-year-old, dethroned as the top-ranked men's player by Carlos Alcaraz following defeat by his rival in the US Open final, has won 60 of his past 66 matches.\n\nWorld number 16 Bublik beat Sinner in Halle in June, but the Kazakh was no match for the Australian Open and Wimbledon champion on Friday.\n\nSinner never conceded more than one point in any of his service games, while applying consistent pressure on Bublik and managing to take two of his eight break points.\n\nSinner is on a 19-match winning streak on indoor hard courts and a seven-match winning streak in Vienna, having won this title on his previous appearance in 2023.\n\nSemi-final opponent De Minaur progressed by defeating Italian Matteo Berrettini 6-1 7-6 (7-4).\n\nThat was his 53rd win of the season - second only to world number one Alcaraz on the ATP Tour in 2025.\n\nGerman world number three Alexander Zverev is also through to the last four in Vienna after Dutchman Tallon Griekspoor withdrew from their quarter-final match.\n\nWith that result, Zverev, seeded second in Vienna, joined Alcaraz, Sinner and Novak Djokovic as the first four players to qualify for the season-ending ATP Finals in November.\n\nZverev will play Italian fourth seed Lorenzo Musetti or Frenchman Corentin Moutet in the other semi-final on Saturday.\n\nMeanwhile, at the Swiss Indoors, three of the four quarter-finals scheduled for Friday ended as walkovers.\n\nNorway's Casper Ruud decided he could not continue after losing a first-set tie-break against Spain's Alejandro Davidovich Fokina, and Canada's Felix Auger-Aliassime retired after Spaniard Jaume Munar won the first set 6-3.",
    "crawled_at": "2025-10-24T16:18:56.140703",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 8,
    "title": "Rybakina clinches last spot in WTA Finals",
    "source": "BBC Tennis",
    "url": "https://www.bbc.com/sport/tennis/articles/c1d0r2x05e4o?at_medium=RSS&at_campaign=rss",
    "description": "Elena Rybakina clinches the last spot for next month's WTA Finals by reaching the semi-finals of the Pan Pacific Open.",
    "pub_date": "Fri, 24 Oct 2025 07:13:49 GMT",
    "content": "Rybakina has failed to advance past the round robin stage in her two previous appearances at the WTA Finals\n\nElena Rybakina has clinched the last spot for next month's WTA Finals by beating Victoria Mboko to reach the Pan Pacific Open semi-finals.\n\nThe 2022 Wimbledon champion, who has won two WTA 500 titles this year, beat 19-year-old Mboko 6-3 7-6 (7-4) to seal her place in the end-of-season event.\n\nThe WTA Finals, which features the top eight singles players and doubles teams of the year, starts on 1 November in Saudi Arabia.\n\nKazakhstan's Rybakina needed to reach at least the semi-finals in Tokyo to pass Russian 18-year-old Mirra Andreeva in the race for the eighth and final spot.\n\nHer victory over Mboko means she will join Aryna Sabalenka, Iga Swiatek, Coco Gauff, Amanda Anisimova, Madison Keys, Jessica Pegula and Jasmine Paolini in Riyadh.\n\n\"It's great to qualify and play some more matches, especially against top players,\" Rybakina said.\n\n\"Last week I was focusing one match at a time and I knew that to qualify it's going to take a long road.\"\n\nAndreeva and fellow Russian Ekaterina Alexandrova, 30, are the first and second alternates for the Finals.\n\nRybakina won her second title of the season at the Ningbo Open in China on Sunday to boost her chances of reaching the WTA Finals for a third successive year.\n\nThe 26-year-old, who will rise to world number six when the rankings are updated on Monday, will face sixth seed Linda Noskova of the Czech Republic in the Tokyo semi-finals on Saturday.\n\nLive scores, results and order of play\n\nGet tennis news sent straight to your phone\n\nPremier League: Leeds two up against despondent West Ham\n\nLeclerc fastest as rookies dominate first practice in Mexico",
    "crawled_at": "2025-10-24T16:18:56.487288",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 9,
    "title": "Ontario premier says he’ll pull ad that upset Trump so U.S.-Canada trade talks can resume",
    "source": "PBS NewsHour",
    "url": "https://www.pbs.org/newshour/world/ontario-premier-says-hell-pull-ad-that-upset-trump-so-u-s-canada-trade-talks-can-resume",
    "description": "The leader of Canada&rsquo;s most populous province said Friday he&rsquo;ll pull the anti-tariff ad that prompted U.S. President Donald Trump to&nbsp;end trade talks&nbsp;with Canada.",
    "pub_date": "Fri, 24 Oct 2025 16:06:17 -0400",
    "content": "Rob Gillies, Associated Press Rob Gillies, Associated Press\n\nTORONTO (AP) - The leader of Canada's most populous province said Friday he'll pull the anti-tariff ad that prompted U.S. President Donald Trump to end trade talks with Canada.\n\nOntario Premier Doug Ford said after talking with Prime Minister Mark Carney he's decided to pause the advertising campaign effective Monday so that trade talks can resume.\n\n\"We've achieved our goal, having reached U.S. audiences at the highest levels,\" Ford said in a statement.\n\n\"Our intention was always to initiate a conversation about the kind of economy that Americans want to build and the impact of tariffs on workers and businesses.\"\n\nFord said the commercials will continue to run this weekend including during the first World Series games between the Toronto Blue Jays and Los Angeles Dodgers.\n\n\"I've directed my team to keep putting our message in front of Americans over the weekend so that we can air our commercial during the first two World Series games,\" he said.\n\nOn Thursday Trump posted, \"The Ronald Reagan Foundation has just announced that Canada has fraudulently used an advertisement, which is FAKE, featuring Ronald Reagan speaking negatively about Tariffs.\"\n\nTrump doubled down on his criticism of the Ontario ads Friday and accused Canada of trying to influence an upcoming U.S. Supreme Court ruling on his global tariff regime.\n\nTrump's call for an abrupt end to negotiations has further inflamed trade tensions between the neighbors and longtime allies.\n\nCarney said this week he aims to double his country's exports to countries outside the U.S. because of the threat posed by Trump's tariffs. Canadian officials remain ready to continue talks to reduce tariffs in certain sectors, he said.\n\n\"We can't control the trade policy of the United States. We recognize that that policy has fundamentally changed from the 1980s,\" Carney said Friday morning before boarding a flight to Asia. \"We have to focus on what we can control and realize what we can't control.\"\n\nCarney is trying to secure a trade deal with Trump, but tariffs are taking a toll in the aluminum, steel, auto and lumber sectors.\n\nCarney spoke to Ford Thursday night and again Friday.\n\nWhite House spokesman Kush Desai said talks with Canada have not led to any constructive progress.",
    "crawled_at": "2025-10-24T16:19:02.297424",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 10,
    "title": "The East Wing of the White House has been demolished. Here’s a look at its history",
    "source": "PBS NewsHour",
    "url": "https://www.pbs.org/newshour/politics/the-east-wing-of-the-white-house-has-been-demolished-heres-a-look-at-its-history",
    "description": "Several preservation groups have expressed concern in recent weeks about the project, which is the first major change to the exterior of the White House in 83 years. ",
    "pub_date": "Fri, 24 Oct 2025 15:35:52 -0400",
    "content": "The East Wing of the White House, the traditional headquarters for the first lady and her staff as well as the public entrance to the \"people's house,\" was largely torn down this week to make way for President Donald Trump's new $300 million ballroom.\n\nBut the images that emerged this week of construction equipment demolishing the facade have prompted outrage over the lack of oversight of the project and raised questions about its scope.\n\nTwo satellite views that show the East Wing of the White House before (top) and after demolition (below) in Washington, D.C. Images by 2025 Planet Labs PBC via Reuters\n\nA Virginia couple sued the Trump administration on Thursday in an attempt to halt the ballroom project. Charles and Judith Voorhees asked a federal judge to issue a temporary restraining order to stop further destruction to the mansion, saying the project moved forward \"without legally required approvals or reviews.\"\n\nSeveral preservation groups have expressed concern in recent weeks about the project, which is the first major change to the exterior of the White House in 83 years. Collectively, their separate statements said a more transparent and thorough review process was needed before the ballroom project got underway.\n\nCommunication about how the ballroom project would affect the main structure of the building was confusing from the beginning, said Priya Jain, chair of the Society of Architectural Historians' Heritage Conservation Committee.\n\n\"There was kind of an ambiguity about the way things were framed from the get-go,\" she said, adding that the society's letter asked for more clarification and transparency around the White House's statements, given the mansion is a highly significant historical building.\n\nThank you. Please check your inbox to confirm.\n\nIn remarks to reporters last week, Trump said that two unnamed advisors had told him he could start the ballroom construction immediately, forgoing any oversight or zoning. He said the advisors told him, \"Sir, this is the White House. You're the president of the United States.\n\nIn flattening the East Wing of the White House, \"we lose a significant piece of history,\" author Kate Andersen Brower said.\n\nThe wing, which was originally constructed in 1902 and renovated in 1942, served as the public entrance to the White House, and housed the family movie theater as well as offices on legislative affairs, the military and the in-house calligraphers. Perhaps most prominently, though, it included office space for the first lady and her aides.\n\nFor Brower, who wrote \"The Residence\" about daily life inside the White House and \"First Women\" about the role of modern first ladies, what has happened to the East Wing \"speaks a lot to how diminished the role of the president's spouse has become.\"\n\n\"Truly, the power center in the White House is always the Oval Office and the West Wing, and proximity to the Oval Office is so important,\" she added. \"If you have the first lady and her staff working out of the Eisenhower Executive Office Building, which I think is what will likely happen, they're even more removed from the center of power. I mean, the East Wing has been called 'Siberia' as a joke inside the White House.\n\nPresident Barack Obama with Melissa Winter, an aide to first lady Michelle Obama, in the East Wing, March 2009. Source: National Archives\n\n\"It was so, basically, vacant that her staff had it as a gift-wrapping room and had gifts put in there,\" she said.",
    "crawled_at": "2025-10-24T16:19:02.795983",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 11,
    "title": "Before T. rex, there was the “dragon prince”",
    "source": "Science Daily",
    "url": "https://www.sciencedaily.com/releases/2025/10/251024041828.htm",
    "description": "Scientists have unveiled Khankhuuluu, a new Mongolian dinosaur species that predates and closely resembles early Tyrannosaurs. With its long snout, small horns, and lean build, it represents a transitional form between swift mid-sized predators and giant apex hunters like T. rex. The find also suggests that large Tyrannosaurs first evolved in North America following an ancient migration from Asia.",
    "pub_date": "Fri, 24 Oct 2025 10:01:07 EDT",
    "content": "An international team of paleontologists has identified a previously unknown dinosaur species named Khankhuuluu, believed to be the closest-known ancestor of the giant Tyrannosaurs. The discovery, led by Jared Voris and Dr. Darla Zelenitsky from the University of Calgary's Faculty of Science, has been published in Nature.\n\nVoris, a PhD candidate in the Department of Earth, Energy, and Environment, explains that this newly identified Tyrannosaur lived about 86 million years ago. It was a medium-sized, fast-moving predator that evolved after the extinction of other large carnivorous dinosaurs.\n\nA Glimpse Into Tyrannosaur Evolution\n\nAccording to Voris, \"This new species provides us the window into the ascent stage of Tyrannosaur evolution; right when they're transitioning from small predators to their apex predator form.\" Khankhuuluu is regarded as the nearest known ancestor of the colossal Tyrannosaurs popularized by films like Jurassic Park.\n\nThe name Khankhuuluu comes from Mongolian and translates to \"prince of dragons\" or \"the dragon prince.\" The name reflects its position in the Tyrannosaur family tree -- standing as the \"prince\" before the \"king,\" Tyrannosaurus rex. At roughly 750 kilograms (about the size of a horse), it was two to three times smaller than its enormous descendants but shared many of their defining traits.\n\nPhysical Traits and Hunting Style\n\nKhankhuuluu displayed small horn-like structures on its head, features that later became more pronounced in later Tyrannosaur species such as Albertosaurus and Gorgosaurus, likely used for mating displays or intimidation. Its long, shallow skull indicates it lacked the bone-crushing bite strength of T. rex. Instead, scientists describe Khankhuuluu as a mesopredator, similar to modern coyotes, relying on speed and agility to hunt.\n\nFossils From Mongolia Tell a New Story\n\nThe fossils were unearthed from the Bayanshiree Formation in southeastern Mongolia and were first studied in the 1970s by paleontologist Altangerel Perle, who initially compared them to a similar species known as Alectrosaurus from China. When Voris examined the fossils in 2023 at the Institute of Paleontology in Mongolia, he noticed subtle but key differences that distinguished them from Alectrosaurus.\n\nThe Journey of Tyrannosaurs Between Continents\n\nDr. Zelenitsky explains that Khankhuuluu or a closely related species likely migrated from Asia to North America around 85 million years ago.\"Our study provides solid evidence that large Tyrannosaurs first evolved in North America as a result of this immigration event,\" she says.\n\nThe research suggests these migrations between Asia and North America were rarer and more limited than previously believed. Khankhuuluu appears to be the last known Asian ancestor of the Tyrannosaurs before their diversification in North America.\n\nFrom the \"Dragon Prince\" to the Tyrant King\n\nScientists believe that Khankhuuluu, or one of its relatives, crossed a land bridge into North America, where it evolved into the formidable apex predator Tyrannosaurs. Fossil evidence shows that Tyrannosaurs thrived in North America for several million years before returning to Asia, where their lineage split into two branches: one evolved into massive predators like T. rex, while the other produced more slender, long-snouted types nicknamed \"Pinocchio rexes.\"\n\nWhat Comes Next in the Research",
    "crawled_at": "2025-10-24T16:19:08.332342",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 12,
    "title": "Your gut microbes might be turning fiber into extra calories",
    "source": "Science Daily",
    "url": "https://www.sciencedaily.com/releases/2025/10/251024041819.htm",
    "description": "ASU scientists found that people whose gut microbes make more methane extract more calories from fiber-rich foods. Methanogens help the microbiome turn fiber into energy by consuming hydrogen and producing methane. Using advanced metabolic chambers, researchers measured how diet and gut chemistry interact, showing that methane may signal efficient digestion. The work could lead to personalized diets based on individual microbiomes.",
    "pub_date": "Fri, 24 Oct 2025 12:46:40 EDT",
    "content": "Deep within your gut lives a bustling world of microbes, each playing a role in digesting your food. Among them is one unusual microbe that produces methane -- a gas more often associated with cows and landfills than humans. According to new research from Arizona State University (ASU), this methane-making microorganism may influence how many calories your body extracts from what you eat.\n\nThe collection of microbes living in your digestive tract is known as the gut microbiome. While everyone has one, some people's microbiomes produce large amounts of methane, whereas others produce very little.\n\nMicrobes and the Energy Hidden in Fiber\n\nThe study found that people whose microbiomes generate more methane tend to extract more energy from high-fiber foods. This may help explain why the same meal can provide different calorie counts for different individuals once it reaches the colon.\n\nResearchers emphasized that high-fiber foods remain beneficial. People generally absorb more calories from a typical Western diet high in processed foods, regardless of methane levels. Even so, calorie absorption on a fiber-rich diet varies depending on how much methane a person's gut produces.\n\nThese findings suggest that gut methane could become a key factor in personalized nutrition -- a future where diets are tailored to the unique microbial activity in each person's digestive system\n\n\"That difference has important implications for diet interventions. It shows people on the same diet can respond differently. Part of that is due to the composition of their gut microbiome,\" says Blake Dirks, lead author of the study and graduate researcher at the Biodesign Center for Health Through Microbiomes. Dirks is also a PhD student in ASU's School of Life Sciences.\n\nPublished in The ISME Journal, the study identifies the key players: methane-producing microbes known as methanogens. These microorganisms appear to be linked with more efficient digestion and higher energy absorption.\n\nA major job of the microbiome is breaking down food that the body cannot digest on its own. Microbes ferment fiber into short-chain fatty acids (SCFAs), which provide a valuable energy source. During this process, hydrogen gas is released. Too much hydrogen can slow fermentation, but other microbes prevent this by consuming hydrogen -- keeping the digestive chemistry in balance.\n\nMethanogens are the hydrogen consumers. As they feed on hydrogen, they release methane as a byproduct. They are the only microbes in the human gut that produce this gas.\n\n\"The human body itself doesn't make methane, only the microbes do. So we suggested it can be a biomarker that signals efficient microbial production of short-chain fatty acids,\" says Rosy Krajmalnik-Brown, corresponding author of the study and director of the Biodesign Center for Health Through Microbiomes.\n\nHow Microbes May Shape Metabolism\n\nThe ASU researchers found that the interactions between these microbes may directly affect metabolism. Participants who produced more methane also had higher levels of short-chain fatty acids, indicating that more energy was being created and absorbed in the gut.\n\nTo test these effects, each participant followed two different diets. One included highly processed, low-fiber foods, while the other emphasized whole foods and fiber. Both diets contained equal proportions of carbohydrates, proteins, and fats.\n\nThe research was conducted in collaboration with the AdventHealth Translational Research Institute, which provided access to a specialized facility. Each participant spent six days in a sealed, hotel-like room called a whole-room calorimeter. This environment allowed researchers to precisely measure metabolism and methane output.",
    "crawled_at": "2025-10-24T16:19:08.636432",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 13,
    "title": "Incogni vs DeleteMe: Which data removal platform is your perfect choice?",
    "source": "TechRadar",
    "url": "https://www.techradar.com/phones/iphone/incogni-vs-deleteme-which-data-removal-platform-is-your-perfect-choice",
    "description": "\n                             Learn how Incogni and DeleteMe stack against each other in key areas, including broker coverage, reporting, ease of use, customer support, pricing, and complementary features. \n                                                                                                            ",
    "pub_date": "Fri, 24 Oct 2025 16:27:00 +0000",
    "content": "A detailed comparison of Incogni and DeleteMe, two of the most popular data removal services.\n\nWith a monthly or annual subscription, Incogni users can scan the web for their personal data and send automated removal requests to data brokers. After the initial scan, Incogni frequently rescans for the same personal data and sends fresh removal requests, particularly to new data brokers that seemingly don't cease to emerge.\n\nFounded in 2010, DeleteMe offers a similar data removal service. Users can submit their personal information and run a deep scan to find this information wherever it appears across the web. Then, DeleteMe will send removal requests to data brokers to scrub this information. It'll also run frequent re-scans and send new data removal requests to ensure your personal information stays off the web.\n\nWe've covered the surface of these two data removal services, but there's much more beneath. This guide compares Incogni and DeleteMe across key areas - broker coverage, pricing, features, ease of use, and customer support - to help you choose the best option for your needs.\n\nIncogni covers roughly 420 data brokers, while DeleteMe covers 750+ data brokers. However, these figures don't tell the complete story. These numbers represent the number of brokers where both platforms can send automated removal requests. However, users can send custom removal requests to other sites. A custom request involves Incogni or DeleteMe's team contacting the site on your behalf to request the deletion of your personal information.\n\nBased on the number of brokers to which you can send automated and manual removal requests, Incogni is a better option than DeleteMe.\n\nBoth Incogni and DeleteMe provide intuitive dashboards to track your data removal requests and their status. However, in my experience, DeleteMe offers more detailed, labeled reports, while Incogni offers generalized reports tailored to the risks associated with my data.\n\nOn Incogni, I received regular email updates on data removal requests, including when they were formally submitted and when the request was successful. I could also track the progress of my removal requests on the Incogni dashboard, including the estimated timeline for each pending request.\n\nOn DeleteMe, I also got frequent email updates about removal requests from start to finish. Likewise, I could always track the progress of each request from my DeleteMe dashboard.\n\nHowever, DeleteMe stood out with its PDF reports listing each site where my personal information was found, when removal requests were sent to each site, and the progress of each request. Its reports were more personalized than Incogni's.\n\nDeleteMe sends users their first detailed PDF report one week after signing up. Afterwards, detailed data removal reports are sent to users subscribed to the Standard plan every three months, or to users on the Premium plan every two months.\n\nDeleteMe offers the most comprehensive statistical reports, while Incogni offers simpler, generalized insights. Understandably, not everyone is interested in the minute details DeleteMe provides, but it's the best option if you want to understand every nook and cranny of your personal data removal.\n\nAlong with their core features, data removal services often provide some extra functionalities to help users boost their online privacy. From my experience testing Incogni and DeleteMe, the latter is the clear winner in this criterion.\n\nDeleteMe offers a complementary Cyber platform with valuable features. For one, you can search the dark web to see if your email address was compromised in any data leak. If you detect your email credentials on any website leak, it's a signal to change passwords for the affected website immediately.\n\nFor website owners, DeleteMe also offers a service to scan your domain name and detect whether sensitive data linked to it is present on the dark web. Several other complementary features exist, but these are the most notable I can point out.",
    "crawled_at": "2025-10-24T16:19:14.714535",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 14,
    "title": "Age verification could soon land in Russia – putting already precarious internet freedoms on the line",
    "source": "TechRadar",
    "url": "https://www.techradar.com/vpn/vpn-privacy-security/age-verification-could-soon-land-in-russia-putting-already-precarious-internet-freedoms-on-the-line",
    "description": "\n                             Russians could soon lose their anonymity on the internet, required to upload ther passport to access a wealth of online content. \n                                                                                                            ",
    "pub_date": "Fri, 24 Oct 2025 16:18:06 +0000",
    "content": "Russians could soon lose their anonymity on the internet\n\nMandatory age verification is arriving everywhere, with Russian lawmakers becoming the latest to consider age-gating online content.\n\nOn October 21, a member of the Russian Civic Chamber, Yevgeny Masharov, proposed a plan to force all internet users to prove their age. This would involve using their passport data, driver's license, or bank information to access online content intended for an 18+ audience.\n\nLike similar laws enforced across Western nations, the move stems from a bid to shield minors from harmful content. Yet, experts have long argued that age verification could negatively impact people's right to free speech, access to information, privacy, and digital security.\n\nFor Russian lawmakers, however, the risk is certainly worth the trouble - and adult-only content seems to be only the beginning.\n\nIn another announcement made to Gazeta.Ru, the Deputy Chairman of the State Duma Committee on Information Policy, Information Technology, and Communications, Andrei Svintsov, also said that Russians are set to lose their anonymity on the internet within the next three years, five at most.\n\n\"That is, every internet user will register with some specialized identifier that will verify their age and other necessary access rights,\" said Svintsov. \"I think the time has come to introduce something similar to purge all social networks and platforms of these bots and the seemingly limitless amount of generated content.\"\n\nWhen mandatory age verification landed in the UK and the US, it was met with a fierce debate.\n\nOn one hand, both citizens and security experts were concerned that sharing their most sensitive personal information could compromise their privacy, making them vulnerable to data leaks and identity theft.\n\nDigital rights campaigners also warned that a vague definition of \"lawful but harmful content to minors\" will lead to greater online censorship, which could hinder people's right to free speech and access to information.\n\nIn a country like Russia, where internet censorship is among the strictest worldwide, such a risk is even stronger. That's especially true considering that, as Masharov explained to RIA Novosti, adult-only content will also include videos from bloggers featuring foul language, scenes of violence, and propaganda of antisocial behavior.\n\n\"The internet censorship in Russia started in 2012 with the first law on protecting children from harmful information. This essentially opened a Pandora's box, ultimately leading to an incredible expansion of the list of grounds for blocking internet sites and the establishment of total state online censorship,\" Darbinyan said.\n\nThe Kremlin began its quest to deanonymize the data of every user eight years after the adoption of Putin's Strategy for the Development of the Information Society until 2030, Darbinyan explains.\n\n\"And now, with the example of Western countries that have taken this dangerous and false path, Russian authorities are seeking to completely close the loop of laws that already impose numerous restrictions on private and anonymous communication online,\" Darbinyan added.\n\nIt is then only fair to believe that an age-gated and de-anonymized internet in Russia will come hand in hand with a fresh new crackdown on circumvention tools.",
    "crawled_at": "2025-10-24T16:19:15.339413",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 15,
    "title": "Can the plastic recycling industry be saved?",
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/c5yv8e0prg9o?at_medium=RSS&at_campaign=rss",
    "description": "Plastic recycling plants in Europe are being shut as they struggle to find a business model",
    "pub_date": "Thu, 23 Oct 2025 23:03:07 GMT",
    "content": "In the plastic recycling industry, the casualties keep coming.\n\nWaste management company Biffa's Sunderland plant closed in February after opening in 2022 at a cost of £7m, while rival Viridor closed its Avonmouth plant in 2022, Skelmersdale in 2023 and confirmed this summer that its Rochester plant would close, too.\n\nLike falling dominoes, plastic recycling plant closures have been endemic across Europe too: another big name, Veolia, will close its two German operations this year, while seven plastic recyclers closed in the Netherlands last year.\n\nMeanwhile, companies Borealis, Dow and Neste have all dropped plans to construct new plastic recycling plants in Europe.\n\nIndustry body Plastic Recyclers Europe equates this to the loss of nearly one million tonnes of plastic recycling capacity since 2023.\n\nAnd more closures are likely, warns James McLeary, managing director for Biffa's polymers division, as the industry here and in Europe faces its most challenging year yet. High energy and labour costs here are two factors, in parallel with the fact that sourcing virgin and recycled plastic from Asia is currently cheaper than buying European recycled plastic.\n\nPlastic recycling plant closures are affecting the US as well, also prompted by the low price of virgin plastic, causing the country to miss its recycled content targets, as S&P Global reports.\n\n\"There's a big global dependence building on Asian plants, and we then have the situation where (plant operators in the UK and Europe) are going to make very tough decisions.\n\nLoopholes in current UK legislation mean plastic waste collectors are inadvertently incentivised to export rather than process domestically. Meanwhile, manufacturers using plastic packaging are still inclined to use cheaper virgin plastic from abroad, and stomach being taxed for it.\n\nAhmed Detta, CEO and founder of plastic waste recycler Enviroo, is frustrated by the flaws and contradictions that he feels are plaguing the industry and disrupting the goal of creating a circular economy that keeps materials in use for as long as possible.\n\n\"For me, a circular economy is a win-win. Every single person in that journey has to have some benefit, and that's not working,\" says Mr Detta, who is based in London.\n\n\"Brands aren't aligning with the circular economy. They're saying, 'why should I buy recycled material when it's cheaper for me to pay the fine for the plastics packaging tax, than actually pay for recycled materials? No one is saying, 'let's unite'.\"\n\nSo concerned is RECOUP, a UK-based plastic recycling independent authority, that its head of policy and infrastructure, Steve Morgan, warns: \"We are almost witnessing the demise of plastic recycling as we know it, unless we have some interventions. There's no way a lot of recyclers in the UK can compete.\"\n\nUK regulations have benefited foreign markets more than they have the UK, and serious reform is needed, Mr Morgan argues.\n\n\"There are an awful lot of fantastic technologies developing. But it's a scale up of those and how they can actually make money, to continue to exist and then also thrive, is the secondary thing,\" says Mr Morgan, who is based in Peterborough.",
    "crawled_at": "2025-10-24T16:20:32.315854",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 4,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 16,
    "title": "Growth won't justify climate damage in airport plans, say MPs",
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/c62exx578lzo?at_medium=RSS&at_campaign=rss",
    "description": "A committee of MPs says the government has not demonstrated if economic benefits from airport expansion outweigh climate impacts.",
    "pub_date": "Thu, 23 Oct 2025 23:01:33 GMT",
    "content": "Planned airport expansion that would result in hundreds of thousands of extra flights a year could risk the government's own net zero goals, a committee of MPs has found.\n\nThe report from the cross-party Environmental Audit Committee said the government had also \"not demonstrated\" that the negative climate impact of expansion would be outweighed by the economic growth created.\n\nThe government has approved several airport expansion schemes, most recently a third runway at London Heathrow and a second runway at Gatwick.\n\nThe Department for Transport said airport expansion plans would \"only go ahead if it aligns with our legal obligations on climate change\".\n\nMinisters are expected to announce which of two rival proposals is preferred for the expansion of Heathrow within weeks.\n\nThe Environmental Audit Committee said the only prospect of meeting net zero would be if airport expansion was \"accompanied by a serious strategic approach to increasing the pace of decarbonising aviation\".\n\nHowever, its chair Toby Perkin noted that technological solutions - such as sustainable aviation fuel - were not yet being used on a commercial scale.\n\nThe report said the plans were likely to provide some economic growth, but how much was unclear, and the government had not provided supporting evidence.\n\nThe UK has legally binding targets to reduce its levels of planet-warming emissions, and contribute to the global goal of preventing average temperatures rising by more than 1.5C by 2050.\n\nAbove this temperature level, scientists anticipate significant impacts from global sea level rise, more extreme weather and impacts on agriculture.\n\nTo prevent temperatures increasing there is a limit to the amount of greenhouse gases, such as CO2, that the world can release, and the UK has set out its own share of these - known as carbon budgets.\n\nOn Wednesday, the Transport Secretary Heidi Alexander told Parliament that Heathrow's expansion plans \"must align with our legal, environmental and climate commitments\".\n\nA spokesperson for the DfT said: \"We have been clear that airport expansion will only go ahead if it aligns with our legal obligations on climate change, including net zero, and we will be seeking advice from the independent Climate Change Committee to inform the ANPS review.\"\n\nBut Dr Alex Chapman, a senior researcher at New Economics Foundation (a think tank focused on environmental and social policies) who gave evidence to the environmental audit committee, said the inquiry was a \"damning assessment of this government's airport expansion agenda\".\n\n\"This government is unable to produce evidence that supports their central claim: that growing our airports will grow our economy.",
    "crawled_at": "2025-10-24T16:20:32.662261",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 4,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 17,
    "title": "Sabotage, Claudia's ire and the chess board is back as things heat up on The Traitors",
    "source": "BBC Entertainment",
    "url": "https://www.bbc.com/news/articles/c1m3epre5d9o?at_medium=RSS&at_campaign=rss",
    "description": "It was another night of mounting tension as the faithfuls hoped to finally catch a traitor.",
    "pub_date": "Thu, 23 Oct 2025 23:27:30 GMT",
    "content": "Spoiler warning: This article reveals details from the sixth episode of The Celebrity Traitors.\n\nIt started with a cliffhanger and ended with a cliffhanger.\n\nAnd host Claudia Winkleman was in no mood for messing around.\n\n\"Silence please,\" she barked at the contestants seated at the round table as the banishment vote was split and had to be decided for the first time by chance - or should we say, the Chest of Chance. A dramatic version of flipping a coin, if you will.\n\nPoor Mark Bonnar - an actor punished for overacting - took the high road (perhaps he shouldn't have sung The Bonnie Banks of Loch Lomond on Wednesday's episode) after the chest he picked was empty. Historian David Olusoga luckily found a protective shield in his.\n\nOne fan on X was clearly amused. \"Imagine the first time they do this chest's of chance thing and it's over 2 faithfuls,\" they mused, later joking: \"They've literally just made this up behind the cameras.\"\n\nIn the first series of The Traitors, it took the faithfuls six episodes to get a traitor. And the game was new. This lot are still on the hunt going into episode seven, with only nine players now left from the original 19. And three of those are traitors. The faithfuls have just three episodes left to catch them.\n\nOnce again, the faithfuls were left to mull over another failure.\n\nClaudia sounded genuinely distraught, her voice breaking as she told the group: \"You are breaking my heart, you are not getting it, what are you not seeing? You have to open your eyes please.\"\n\n\"I feel that we are disastrously losing this game. And I think it's going to get worse,\" David added gloomily.\n\nOn a lighter note, while we all know someone who fast forwards the challenges when watching on catch-up, there was some real excitement on Thursday night thanks to the return of last season's life-size chessboard and larger-than-life traitor figures. Think Darth Vader after a growth spurt.\n\nSir Stephen Fry lived up to his brainy reputation over breakfast, by predicting the chessboard was back: \"I could be a knight - oh, I already am,\" he joked. Comic Alan Carr was predictably quick to prick any potential pomposity: \"Or an old queen,\" he quipped.\n\nIn fact, Alan continues to relish his role as a traitor with increasing enthusiasm.\n\nWhen in the turret discussing who to murder next, he asked fellow traitors singer Cat Burns and presenter Jonathan Ross: \"Stephen Fry: Shall we just get on with it and kill him? What's a knighthood when you're dead?\"\n\n\"Brutal,\" Jonathan replied, and he wasn't wrong.",
    "crawled_at": "2025-10-24T16:20:41.648624",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 18,
    "title": "Canada will restart trade talks when 'Americans are ready', says Carney",
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/cdjrlmd4pmeo?at_medium=RSS&at_campaign=rss",
    "description": "President Trump abruptly ended negotiations over an advert that used Ronald Reagan speaking negatively about tariffs. ",
    "pub_date": "Fri, 24 Oct 2025 14:55:12 GMT",
    "content": "Canadian Prime Minister Mark Carney said his country is prepared to resume trade talks with the US \"when the Americans are ready.\"\n\nHis remarks come after US President Donald Trump announced an immediate end to all trade negotiations with Canada over an advert critical of the tariffs he has imposed on the nation.\n\nTrump wrote on social media that the advert was \"FAKE\" and \"egregious\", adding that trade talks were \"HEREBY TERMINATED\".\n\nTrump has allowed exemptions for goods that fall under a free trade agreement with Mexico and Canada, negotiated during his first term.\n\nBut since his election earlier this year, Canada's Carney has attempted to strike a deal that would ease the tariffs. Three-quarters of Canadian exports are sold to the US, making its economy particularly vulnerable.\n\nThis effort has been complicated by Ontario Premier Doug Ford, who is one of the most vocal critics of the taxes levied on US firms buying Canadian products.\n\nIn the minute-long advert published last week, Reagan's voice can be heard narrating over images that include the New York Stock Exchange and cranes adorned with both US and Canadian flags.\n\nThe video excerpts from a 1987 national radio address by Reagan that focuses on foreign trade.\n\n\"When someone says, 'let's impose tariffs on foreign imports', it looks like they're doing the patriotic thing by protecting American products and jobs. And sometimes, for a short while, it works - but only for a short time,\" Reagan says in the advert.\n\n\"Over the long run, such trade barriers hurt every American, worker and consumer.\n\n\"High tariffs inevitably lead to retaliation by foreign countries and the triggering of fierce trade wars... Markets shrink and collapse, businesses and industries shut down and millions of people lose their jobs.\"\n\nThe Ronald Reagan Foundation - which is charged with preserving his legacy - released a statement on Thursday saying the advert had used \"selective\" audio and video of the former president's remarks.\n\nIt said the advert \"misrepresents\" the former president's address, without specifying why, and accused the Ontario government of not seeking permission to use and edit the remarks.\n\nThe foundation said it was \"reviewing its legal options\".\n\nTrump referenced this statement, and said the video was designed to \"interfere with\" the US Supreme Court's upcoming decision in November on whether Washington's sweeping tariffs on many nations' products are legal.",
    "crawled_at": "2025-10-24T16:21:24.321142",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 4,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 19,
    "title": "Sheffield Wednesday placed in administration",
    "source": "BBC Business",
    "url": "https://www.bbc.com/sport/football/articles/c1lqmmml533o?at_medium=RSS&at_campaign=rss",
    "description": "Sheffield Wednesday have been placed in administration and hit with an automatic 12-point deduction by the EFL. ",
    "pub_date": "Fri, 24 Oct 2025 10:47:33 GMT",
    "content": "Sheffield Wednesday will be given a 12-point deduction for entering administration\n\nSheffield Wednesday have been placed in administration and hit with an automatic 12-point deduction by the EFL.\n\nJulian Pitts, Kris Wigfield and Paul Stanley of Begbies Traynor have been appointed joint-administrators after it was revealed His Majesty's Revenue & Customs were set to issue a winding-up petition against the club.\n\nStaff have been briefed, while administrators also held a meeting with players. The Owls host Oxford United at Hillsborough on Saturday (15:00 BST) with the club bottom of the Championship and now on -6 points.\n\nWhile enforcing the immediate deduction, in a statement the EFL said that administration was \"the opportunity to move matters towards a successful sale and secure future under new ownership\".\n\nThe move into administration effectively ends Dejphon Chansiri's decade-long ownership of the club with the Sheffield Wednesday Supporters Trust confirming their boycott of matches is over.\n\nSeats spelling out Chansiri's name in the North Stand at Hillsborough were removed on Friday afternoon.\n\nIn a statement, Sheffield Wednesday said administrators were appointed, \"following significant efforts to agree a sale to a credible future custodian in recent weeks which unfortunately could not be concluded and amid rising pressure from creditors.\"\n\nWhat does it mean when a club enters administration?\n\nLatest Sheffield Wednesday news, analysis and fan views\n\n'It's a tough day' - Pederson on Sheffield Wednesday administration\n\nWigfield, a managing partner at Begbies Traynor, said: \"The joint administrators have taken over the running of the club with immediate effect to protect the interests of creditors, and to ensure Sheffield Wednesday can continue operating while we seek a new owner as swiftly as possible.\n\n\"Like many football clubs, it has been trading at a significant loss for many years, with those losses historically funded by the owner. Mr Chansiri is no longer willing to provide that financial support.\n\n\"While the recent fan boycott has not directly caused the insolvency, it has increased financial pressure on the club. As a result, the owner has chosen to place the club into administration.\n\n\"Supporters are the backbone of any football club. The money they spend at the gate and in the ground is vital. I've been a season ticket holder since 1984 and know first-hand the passion of this fanbase.",
    "crawled_at": "2025-10-24T16:21:24.683487",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 4,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 20,
    "title": "Asylum seeker guilty of hotel worker's savage murder at railway station",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/cvgkpyr1ep4o?at_medium=RSS&at_campaign=rss",
    "description": "Deng Chol Majek stabbed Rhiannon Whyte 23 times, 11 in the head, on a deserted railway platform.",
    "pub_date": "Fri, 24 Oct 2025 17:08:53 GMT",
    "content": "An asylum seeker has been found guilty of murdering a hotel worker, who he stabbed 23 times with a screwdriver at a railway station.\n\nDeng Chol Majek had denied killing 27-year-old Rhiannon Whyte, who died three days after being attacked at Bescot Stadium station, in Walsall, in October 2024.\n\nThe killer was staying at the nearby Park Inn Hotel, where Ms Whyte worked, and staff reported Majek, originally from Sudan, had earlier been staring at her and others, in a \"scary\" and \"spooky\" manner.\n\nCCTV captured Majek following Ms Whyte to the station before he fled minutes later. He was then seen dancing and drinking in the hotel car park, behaviour described as \"callous\" by prosecutors.\n\nMajek denied he was the killer, repeatedly telling the court that CCTV and DNA evidence was wrong. No motive for why he attacked Ms Whyte has ever been established.\n\nHe showed no emotion when the jury returned its verdict after a little over two hours of deliberations.\n\nMs Whyte's mother Siobhan put her head in her hands and started crying when the verdict was read out, while Ms Whyte's two sisters were also in tears.\n\nIn a statement outside court, her sister Alexandra, who is now raising Ms Whyte's son, aged only five at the time, said: \"Deng Chol Majek stalked, hunted and then preyed on our defenceless Rhiannon, before cornering her and unleashing a vicious attack - and for what purpose?\n\n\"She was at work, helping people as she always did, and he chose her for no purpose other than cold-blooded self-gratification.\"\n\nAlexandra said Majek had stolen a \"crucial piece\" of her family.\n\n\"He took so many opportunities from Rhiannon, she will never watch her son grow up, we will never watch her marry, build a family, buy her first house or learn to drive,\" she said.\n\nShe said getting justice for her sister was not the end of her story and her family would continue to \"advocate to evoke change\" in her name.\n\n\"Many have tried to imply this is about immigration, but these are the choices of one man, not an ethnic group,\" she added.\n\nBefore he was convicted, in a trial that lasted two weeks at Wolverhampton Crown Court, the jury heard Majek travelled to the UK on a small boat, arriving on 29 July 2024.\n\nHe was living at the Park Inn Hotel, which was owned by Radisson but was then being managed by Serco as an asylum hotel.",
    "crawled_at": "2025-10-24T16:22:12.683671",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 21,
    "title": "Saudi Arabia to host new ATP tournament from 2028",
    "source": "BBC Tennis",
    "url": "https://www.bbc.com/sport/tennis/articles/cx24yg4pk7eo?at_medium=RSS&at_campaign=rss",
    "description": "A new ATP Masters 1000 tournament will be added to the tennis calendar from 2028 - and staged in Saudi Arabia.",
    "pub_date": "Thu, 23 Oct 2025 14:53:02 GMT",
    "content": "Jannik Sinner won the 2025 Six Kings Slam, held in Riyadh, Saudi Arabia, earlier this month\n\nA new ATP Masters 1000 tournament will be added to the tennis calendar from 2028 - and staged in Saudi Arabia.\n\nA 56-man field will contest a one week event, most likely in February, in another sign of the increasing pulling power of the Gulf state.\n\nHowever, with players expressing so much concern about the length of the season and the number of events they play, the new tournament will not be mandatory.\n\n\"We are dealing with players who are independent contractors, so ultimately they are free to choose their own schedule,\" said ATP chairman Andrea Gaudenzi.\n\n\"They also play outside of the system and we saw this last week with the Six Kings Slam exhibition [in Saudi Arabia].\n\nThis is the first time the Masters 1000 category has been expanded since the birth of the concept in 1990.\n\nThe Saudi Arabia event will join existing 1000 tournaments in Indian Wells, Miami, Monte Carlo, Madrid, Rome, Canada (which is rotated between Toronto and Montreal), Cincinnati, Shanghai and Paris.\n\nSaudi Arabia and Sport - The Explainer\n\nMonte Carlo is currently the only Masters 1000 which is not mandatory for the players.\n\nIf a player skips the new Saudi event, his share of the annual bonus pool would not be affected and, under the current rules, he would have the opportunity to make up some of the ranking points conceded at another tournament.\n\nSeven of the existing nine Masters events are now staged over 12 days, which has proved unpopular with many players.\n\nThe new Saudi tournament - at a venue still to be announced - will last just a week.\n\nIt will form part of a 2028 schedule which will have a slightly different look and possibly finish at least a week earlier as the ATP tries to streamline the end of season tournaments.\n\nâ\u0080\u009cI also have to notice that in today's world there's a lot more money, which means there is a lot more opportunity - and there is a lot more temptation of playing more and elsewhere.",
    "crawled_at": "2025-10-24T16:22:17.756876",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 22,
    "title": "What next for Djokovic after Paris withdrawal?",
    "source": "BBC Tennis",
    "url": "https://www.bbc.com/sport/tennis/articles/c5yl0gzl505o?at_medium=RSS&at_campaign=rss",
    "description": "Novak Djokovic pulling out of the upcoming Paris Masters without giving a reason raises questions about his plans for the rest of the season.",
    "pub_date": "Wed, 22 Oct 2025 13:31:12 GMT",
    "content": "Novak Djokovic has played just 12 tournaments this season - but only trails Carlos Alcaraz and Jannik Sinner in the ATP race\n\nNovak Djokovic pulling out of the upcoming Paris Masters without giving an explicit reason provides more uncertainty about his plans for the rest of the season.\n\nThe 38-year-old Serb was hampered by injury in his most recent ATP tournament, the Shanghai Masters, where he lost to qualifier Valentin Vacherot in the semi-finals.\n\nDjokovic also had to retire from his match against Taylor Fritz at the Six Kings Slam exhibition in Saudi Arabia last week.\n\nOn Tuesday, the 24-time major champion announced he had decided to withdraw from the Paris Masters, the final ATP 1000 event of the season which starts next week.\n\n\"Dear Paris, unfortunately I'll not compete at this year's Paris Masters,\" Djokovic wrote on social media.\n\n\"I have amazing memories and great success over the years, especially being able to conquer the title seven times.\"\n\nLeBron, Ronaldo, Brady 'inspire' Djokovic to keep playing\n\nDjokovic 'not giving up on Slams' - but can body keep up?\n\nAppearing at an ATP 250 event in Athens - a tournament owned by his family and relocated from Belgrade - is Djokovic's main focus.\n\nIt looks unlikely he will miss an event with such an emotional pull unless his physical problems are too great.\n\nFollowing that is the season-ending ATP Finals in Turin.\n\nDjokovic has qualified as the third best player on the men's tour, behind Carlos Alcaraz and Jannik Sinner, despite only showing up at only 12 tournaments this season.\n\nSkipping an event he has already won seven times might be a more logical decision for Djokovic, who has repeatedly emphasised how creating further \"history\" is his priority now.\n\nAfter pulling out of the Saudi match, Djokovic was non-committal about his upcoming schedule.",
    "crawled_at": "2025-10-24T16:22:18.088173",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 23,
    "title": "U.S. deploys aircraft carrier to waters off South America in major military escalation",
    "source": "PBS NewsHour",
    "url": "https://www.pbs.org/newshour/nation/u-s-deploys-aircraft-carrier-to-waters-off-south-america-in-major-military-escalation",
    "description": "The U.S. military is sending an aircraft carrier to the waters off South America, the Pentagon announced Friday, in the latest escalation of&nbsp;military firepower in a region&nbsp;where the Trump administration has unleashed more rapid&nbsp;strikes in recent days against boats&nbsp;it accuses of carrying drugs.",
    "pub_date": "Fri, 24 Oct 2025 15:34:35 -0400",
    "content": "Konstantin Toropin, Associated Press Konstantin Toropin, Associated Press\n\nWASHINGTON (AP) - The U.S. military is sending an aircraft carrier to the waters off South America, the Pentagon announced Friday, in the latest escalation of military firepower in a region where the Trump administration has unleashed more rapid strikes in recent days against boats it accuses of carrying drugs.\n\nDefense Secretary Pete Hegseth ordered the USS Gerald R. Ford and its strike group to deploy to the U.S. Southern Command region to \"bolster U.S. capacity to detect, monitor, and disrupt illicit actors and activities that compromise the safety and prosperity of the United States,\" Pentagon spokesman Sean Parnell said on social media.\n\nThe USS Ford, which has five destroyers in its strike group, is now deployed to the Mediterranean Sea. One of its destroyers is in the Arabian Sea and another is in the Red Sea, a person familiar with the operation told The Associated Press. As of Friday, the aircraft carrier was in port in Croatia on the Adriatic Sea.\n\nThe person, who spoke on condition of anonymity to discuss sensitive military operations, would not say how long it would take for the strike group to arrive in the waters off South America or if all five destroyers would make the journey.\n\nDeploying an aircraft carrier will surge major additional resources to a region that has already seen an unusually large U.S. military buildup in the Caribbean Sea and the waters off Venezuela. The latest deployment and the quickening pace of the U.S. strikes, including one Friday, raised new speculation about how far the Trump administration may go in operations it says are targeted at drug trafficking, including whether it could try to topple Venezuelan President Nicolás Maduro. He faces charges of narcoterrorism in the U.S.\n\nThere are already more than 6,000 sailors and Marines on eight warships in the region. If the entire USS Ford strike group arrives, that could bring nearly 4,500 more sailors as well as the nine squadrons of aircraft assigned to the carrier.\n\nComplicating the situation is Tropical Storm Melissa, which has been nearly stationary in the central Caribbean with forecasters warning it could soon strengthen into a powerful hurricane.\n\nHours before Parnell announced the news, Hegseth said the military had conducted the 10th strike on a suspected drug-running boat, leaving six people dead and bringing the death count for the attacks that began in early September to at least 43 people.\n\nHegseth said on social media that the vessel struck overnight was operated by the Tren de Aragua gang. It was the second time the Trump administration has tied one of its operations to the gang that originated in a Venezuelan prison.\n\nThe strikes have ramped up from one every few weeks when they first began last month to three this week, killing a total of at least 43 people. Two of the most recent strikes were carried out in the eastern Pacific Ocean, expanding the area where the military has launched attacks and shifting to where much of the cocaine from the world's largest producers is smuggled.\n\n\"If you are a narco-terrorist smuggling drugs in our hemisphere, we will treat you like we treat Al-Qaeda,\" Hegseth said in his post. \"Day or NIGHT, we will map your networks, track your people, hunt you down, and kill you.\"\n\nThe strike drew parallels to the first announced by the U.S. last month by focusing on Tren de Aragua, which the Trump administration has designated a foreign terrorist organization and blamed for being at the root of the violence and drug dealing that plague some cities.\n\nWhile not mentioning the origin of the latest boat, the Republican administration says at least four of the boats it has hit have come from Venezuela. On Thursday, the U.S. military flew a pair of supersonic heavy bombers up to the coast of Venezuela.\n\nMaduro on Thursday praised security forces and a civilian militia for defense exercises along some 2,000 kilometers (about 1,200 miles) of coastline to prepare for the possibility of a U.S. attack.",
    "crawled_at": "2025-10-24T16:22:23.843617",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 24,
    "title": "Will Trump meet with Kim? Speculation flares ahead of U.S. president’s visit to South Korea",
    "source": "PBS NewsHour",
    "url": "https://www.pbs.org/newshour/world/will-trump-meet-with-kim-speculation-flares-ahead-of-u-s-presidents-visit-to-south-korea",
    "description": "If realized, it would mark the two&rsquo;s first summit since their last meeting at the Korean border village of Panmunjom in June 2019, and fourth overall.",
    "pub_date": "Fri, 24 Oct 2025 15:13:57 -0400",
    "content": "Hyung-Jin Kim, Associated Press Hyung-Jin Kim, Associated Press\n\nKim Tong-Hyung, Associated Press Kim Tong-Hyung, Associated Press\n\nSEOUL, South Korea (AP) - The last time U.S. President Donald Trump visited South Korea in 2019, he made a surprise trip to the border with North Korea for an impromptu meeting with North Korean leader Kim Jong Un to revive faltering nuclear talks.\n\nNow, as Trump is set to make his first trip to Asia since his return to office, speculation is rife that he may seek to meet Kim again during his stop in South Korea. If realized, it would mark the two's first summit since their last meeting at the Korean border village of Panmunjom in June 2019, and fourth overall.\n\nMany experts say prospects for another impromptu meeting aren't bright this time but predict Trump and Kim could eventually sit down for talks again in coming months. Others dispute that, saying a quick resumption of diplomacy isn't still likely given how much has changed since 2019 - both the size of North Korea's nuclear program and its foreign policy leverage.\n\nTrump has repeatedly expressed his desire to restore diplomacy with Kim as he boasted of his relationship with the North Korean leader and called him \"a smart guy.\" Ending his silence on Trump's outreach, Kim last month said he held \"good personal memories\" of Trump and suggested he could return to talks if the U.S. drops \"its delusional obsession with denuclearization\" of North Korea.\n\nBoth Washington and Pyongyang haven't hinted at any high-profile meeting ahead of the Oct. 31-Nov. 1 Asia-Pacific Economic Cooperation meeting in South Korea. But South Korea's Unification Minister Chung Dong-young told lawmakers in mid-October that it was possible for Trump and Kim to meet at Panmunjom in the Demilitarized Zone again when the U.S. president comes to South Korea after visiting Malaysia and Japan.\n\n\"We should see prospects for their meeting have increased,\" said Ban Kil Joo, assistant professor at the Korea National Diplomatic Academy in Seoul. He cited the recent suspension of civilian tours to the southern side of Panmunjom and Kim's comments about a possible return to talks.\n\nIf the meeting doesn't occur, Ban said Kim will likely determine whether to resume diplomacy with Trump when he holds a major ruling party conference expected in January.\n\nNo notable logistical preparations that imply an impending Kim-Trump meeting have been reported, but observers note that the 2019 get-together was arranged only a day after Trump issued an unorthodox meeting invitation by tweet.\n\nSince his earlier diplomacy with Trump fell apart due to disputes over U.S.-led sanctions on North Korea, Kim has accelerated the expansion of an arsenal of nuclear-capable missiles designed to strike the U.S. and its allies. He has also strengthened his diplomatic footprint by aligning with Russia over its war in Ukraine and tightening relations with China.\n\nSubsequently, Kim's sense of urgency for talks with the United States could be much weaker now than it was six years ago, though some experts argue Kim would need to brace for the end of the Russia-Ukraine war.\n\n\"Considering the current situation, it seems difficult to imagine Kim Jong Un coming over for talks,\" said Kim Tae-hyung, a professor at Seoul's Soongsil University.\n\nWith an enlarged nuclear arsenal, stronger diplomatic backing from Russia and China and the weakening enforcement of sanctions, Kim has greater leverage and clearly wants the U.S. to acknowledge North Korea as a nuclear power, a status needed to call for the lifting of U.N. sanctions. But that would run counter to the U.S. and its allies' long-held position that sanctions would stay in place unless North Korea fully abandons its nuclear program.\n\n\"If a meeting with Kim Jong Un happens, Trump would brag of it and boast he's the one who can resolve Korean Peninsula issues as well, so he has something to gain ... But would the U.S. have something substantial to give Kim Jong Un in return?\" said Chung Jin-young, a former dean of the Graduate School of Pan-Pacific International Studies at South Korea's Kyung Hee University.",
    "crawled_at": "2025-10-24T16:22:24.200940",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 1,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 25,
    "title": "Popular cholesterol drugs may help prevent dementia",
    "source": "Science Daily",
    "url": "https://www.sciencedaily.com/releases/2025/10/251024041815.htm",
    "description": "A massive genetic study found that naturally lower cholesterol is linked to a dramatically reduced risk of dementia. The research simulated the effects of cholesterol-lowering drugs and showed up to an 80% lower risk for certain genetic profiles. Scientists believe high cholesterol may contribute to dementia through atherosclerosis and small blood clots. Long-term trials could confirm whether medications can replicate this protective effect.",
    "pub_date": "Fri, 24 Oct 2025 11:24:49 EDT",
    "content": "Having lower cholesterol levels may help protect against dementia, according to a large-scale international study led by the University of Bristol. The research, involving data from more than one million participants, found that people with genetic traits that naturally reduce cholesterol are less likely to develop dementia.\n\nThe work was led by Dr. Liv Tybjærg Nordestgaard during her time at the University of Bristol and at the Department of Clinical Biochemistry at Copenhagen University Hospital -- Herlev and Gentofte. The findings were published in Alzheimer's & Dementia: The Journal of the Alzheimer's Association.\n\nGenetic Clues and Cholesterol-Lowering Effects\n\nSome individuals are born with genetic variants that affect the same proteins targeted by cholesterol-lowering medications such as statins and ezetimibe. To explore whether these drugs might influence dementia risk, the team used a technique called Mendelian Randomization. This method allows scientists to study how specific genetic variants mimic the effects of a treatment while minimizing the influence of outside factors like weight, diet, or lifestyle.\n\nBy comparing people with and without these cholesterol-lowering genetic variants, the researchers observed a clear difference in dementia risk. A small decrease in cholesterol levels (about one millimole per liter) was associated with up to an 80% reduction in dementia risk for certain drug-related genetic targets.\n\nLower Cholesterol, Lower Dementia Risk\n\n\"What our study indicates is that if you have these variants that lower your cholesterol, it looks like you have a significantly lower risk of developing dementia,\" said Dr. Nordestgaard, who now works in the Department of Clinical Biochemistry at Copenhagen University Hospital -- Bispebjerg and Frederiksberg hospital.\n\nThe results suggest that keeping cholesterol levels low -- whether through genetics or medical treatment -- may protect against dementia. However, the research does not yet confirm that cholesterol-lowering drugs themselves directly prevent the disease.\n\nWhy Studying Dementia Is So Challenging\n\nBecause dementia often develops late in life, studying its causes requires tracking participants for decades. This makes it difficult to establish cause and effect in traditional clinical trials.\n\nIt also remains unclear why high cholesterol raises dementia risk. One explanation, according to Dr. Nordestgaard, is that high cholesterol contributes to atherosclerosis -- the buildup of fatty deposits in blood vessels.\n\nHow Cholesterol May Harm the Brain\n\n\"Atherosclerosis is a result of the accumulation of cholesterol in your blood vessels,\" Dr. Nordestgaard said. \"It can be in both the body and the brain and increases the risk of forming small blood clots -- one of the causes of dementia.\n\n\"It would be a really good next step to carry out randomised clinical trials over 10 or 30 years, for example, where you give the participants cholesterol-lowering medication and then look at the risk of developing dementia,\" Dr. Nordestgaard added.\n\nGlobal Collaboration and Funding",
    "crawled_at": "2025-10-24T16:22:29.582805",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 26,
    "title": "Scientists finally see what sparks Parkinson’s",
    "source": "Science Daily",
    "url": "https://www.sciencedaily.com/releases/2025/10/251024041757.htm",
    "description": "Researchers have finally seen and measured the tiny alpha-synuclein oligomers that may ignite Parkinson’s disease. With the ultra-sensitive ASA-PD imaging method, they captured these clusters in brain tissue, finding larger and more numerous versions in patients with Parkinson’s. The discovery could mark a turning point in diagnosing and treating the disease, revealing the first visible signs long before symptoms appear.",
    "pub_date": "Fri, 24 Oct 2025 10:58:12 EDT",
    "content": "For the first time, researchers have directly seen and measured the protein clusters thought to spark Parkinson's disease, marking a major milestone in understanding the world's fastest-growing neurological condition.\n\nThese microscopic clusters, known as alpha-synuclein oligomers, have long been suspected as the starting point for Parkinson's, but they have remained undetectable in human brain tissue -- until now.\n\nA team from the University of Cambridge, UCL, the Francis Crick Institute, and Polytechnique Montréal developed a powerful imaging approach that allows scientists to visualize, count, and compare these protein clumps in human brain tissue. One researcher described the breakthrough as \"like being able to see stars in broad daylight.\"\n\nPublished in Nature Biomedical Engineering, the findings could transform how scientists study Parkinson's, offering new insights into how it spreads through the brain and paving the way for earlier diagnosis and more targeted treatments.\n\nParkinson's: A Growing Global Health Challenge\n\nMore than 166,000 people in the UK currently live with Parkinson's disease, and the global total is expected to reach 25 million by 2050. While existing drugs can ease symptoms such as tremors and stiffness, none can halt or slow the disease's progression.\n\nFor over a century, doctors have identified Parkinson's by the presence of large protein deposits known as Lewy bodies. Yet researchers have long believed that smaller, early-stage oligomers may actually cause the damage to brain cells. Until now, these microscopic structures, just a few nanometers long, were impossible to observe directly.\n\nSeeing Parkinson's at Its Earliest Stages\n\n\"Lewy bodies are the hallmark of Parkinson's, but they essentially tell you where the disease has been, not where it is right now,\" said Professor Steven Lee from Cambridge's Yusuf Hamied Department of Chemistry, who co-led the research. \"If we can observe Parkinson's at its earliest stages, that would tell us a whole lot more about how the disease develops in the brain and how we might be able to treat it.\"\n\nTo achieve this, the researchers created a method called ASA-PD (Advanced Sensing of Aggregates for Parkinson's Disease). This ultra-sensitive fluorescence microscopy technique can detect and analyze millions of oligomers in post-mortem brain samples. Because the oligomers are so tiny, their signal is faint, but ASA-PD enhances that signal while reducing background noise, allowing scientists to clearly see individual alpha-synuclein clusters for the first time.\n\n\"This is the first time we've been able to look at oligomers directly in human brain tissue at this scale: it's like being able to see stars in broad daylight,\" said co-first author Dr Rebecca Andrews, who conducted the work when she was a postdoctoral researcher in Lee's lab. \"It opens new doors in Parkinson's research.\"\n\nThe researchers examined brain tissue from people with Parkinson's and compared it to samples from healthy individuals of similar age. They found that oligomers were present in both groups, but in those with Parkinson's, the clusters were larger, brighter, and far more numerous. This difference suggests a strong connection between oligomer growth and disease progression.\n\nClues to the Earliest Signs of Disease\n\nThe team also identified a unique subset of oligomers found only in Parkinson's patients, which may represent the earliest detectable signs of the disease -- possibly appearing years before symptoms emerge.\n\n\"This method doesn't just give us a snapshot,\" said Professor Lucien Weiss from Polytechnique Montréal, wo co-led the research. \"It offers a whole atlas of protein changes across the brain and similar technologies could be applied to other neurodegenerative diseases like Alzheimer's and Huntington's.",
    "crawled_at": "2025-10-24T16:22:29.834417",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 27,
    "title": "Amazon's Black Friday countdown begins – here are 15 deals to buy right now",
    "source": "TechRadar",
    "url": "https://www.techradar.com/seasonal-sales/amazons-black-friday-countdown-begins-here-are-15-deals-to-buy-right-now",
    "description": "\n                             Amazon has announced details of its official Black Friday sale and released early deals on its best-selling devices, including up to 60% off Fire TVs, Ring Doorbells, and Blink security cameras. \n                                                                                                            ",
    "pub_date": "Fri, 24 Oct 2025 16:00:30 +0000",
    "content": "Amazon has just released details on its upcoming Black Friday sale, and while the dates haven't been announced yet, the retailer has early deals you can shop right now.\n\n• Shop more early Amazon holiday deals\n\nWhile there are discounts on kitchen appliances, vacuums, holiday decor, and toys, the best early Black Friday deals that are worth buying are on Amazon's best-selling devices. You can find several record-low prices, with up to 60% off Fire TVs, Ring Doorbells, Blink security cameras, Fire TV Sticks, and more.\n\nI've rounded up today's 15 best early Black Friday device deals below, with prices starting at $17.99. While all of the offers listed below offer incredible value, a few stand-out deals include the latest Blink Video Doorbell on sale for only $29.99 (originally $69.99), a massive 50% discount on the latest Ring Video Doorbell, bringing the price down to $49.99 (originally $99.99), and the Blink Mini 2 security camera on sale for just $17.99 (originally $39.99).\n\nKeep in mind that many of today's early Black Friday device deals are at record-low or near-record-low prices, and I can't imagine you'll find significantly cheaper prices on Black Friday itself. If you see a gadget below that you like, I recommend taking advantage now and getting a head start on your holiday shopping.\n\nI've had my eye on the Blink Mini 2 since its release, and now that it's on sale for a record-low price of $17.99 - it's a must-buy. The compact security camera features two-way audio and will alert your phone when motion is detected. The Blink 2 also includes a 1080p HD live view, night view in color with a built-in spotlight, and a wider field of view.\n\nThe new version of Amazon's standard Fire TV Stick is on sale for just $19.99 ahead of Black Friday. In our Fire TV Stick review, we found the original version was a cheap way to add essential smart features to your TV, including access to streaming apps in HD, Alexa voice controls, and the ability to control other smart home devices.\n\nAs the name suggests, the Fire TV Stick 4K streams shows and movies on your TV in ultra-high definition 4K resolution. It's a good offer for a solid streaming stick that comes with access to all the major apps and supports voice controls through Alexa. Amazon's pre-Black Friday deal shaves 40% off the retail price.\n\nToday's price on Amazon's premium streaming device is just $7 shy of the record low. The Fire TV Stick 4K Max streams the same content in the same quality as the standard 4K version, but the extra power inside means faster performance when navigating apps. Plus, it uses WiFi 6E technology to give you a more stable and consistent streaming experience.\n\nOne of my favorite early Black Friday deals at Amazon is the all-new Blink Video Doorbell at its lowest price ever. The Blink doorbell alerts you when motion is detected and features infrared night vision, two-way audio, a two-year battery life, and an expanded field of view.\n\nAmazon's Echo devices are always best-sellers during the holidays, and the retailer currently has the Echo Show 8 smart display on sale for $99.99. Thanks to Alexa compatibility, the eight-inch display allows you to make calls, watch movies, check the weather, and control compatible smart home devices completely hands-free.\n\nThe 4th-generation Blink outdoor security camera features enhanced motion detection, two-way audio, a two-year battery life, and works with Amazon Alexa for hands-free control. Today's pre-Black Friday deal is a massive 60% discount and a return to the record-low price.\n\nI already own the best-selling Ring Video Doorbell and can't imagine living without it. The smart doorbell includes a built-in battery and allows you to see, hear, and speak to anyone from your phone or computer. Today's deal from Amazon is a new record-low price, and I can't imagine it will drop further on Black Friday.\n\nSave a whopping $100 on this premium wired video doorbell with head-to-toe HD+ video. As well as high-resolution footage, we love the 3D motion detection feature and its Alexa integration. All of this for a record-low price of a shade under $130 is an absolute steal ahead of Black Friday.\n\nThe Ring Floodlight Camera Wired Plus is on sale for a record-low price at Amazon's early sale. The motion-activated HD camera features two-way talk, customizable motion zones, and notifies your smartphone, tablet, or laptop when motion is detected.",
    "crawled_at": "2025-10-24T16:22:36.278806",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 28,
    "title": "I can’t believe Samsung and Apple made the same XR mistake when Meta already solved it over half a decade ago",
    "source": "TechRadar",
    "url": "https://www.techradar.com/computing/virtual-reality-augmented-reality/i-cant-believe-samsung-and-apple-made-the-same-xr-mistake-when-meta-already-solved-it-over-half-a-decade-ago",
    "description": "\n                             Samsung Galaxy XR and Apple Vision Pro cost more if you wear glasses, and that's not fair. \n                                                                                                            ",
    "pub_date": "Fri, 24 Oct 2025 15:32:06 +0000",
    "content": "This week we've gone hands-on with both the Samsung Galaxy XR and new Apple Vision Pro headsets, and while the M5-powered Vision Pro has impressed us - we gave it a four-and-a-half star review - we imagine the lower price yet still premium experience of Samsung's XR hardware will help to win over those still enthused about a prosumer headset.\n\nThanks to their impressive displays offering superb visual clarity, chipsets with plenty of pepper for a wide range of use cases and comfy designs - facilitated by the Galaxy XR's lower weight and Vision Pro's new headband - there's a lot to love about either option.\n\nDespite the positives, I have a bone to pick with both devices - why hasn't either headset found a clean and affordable solution for glasses wearers?\n\nA quick Google search for glasses-wearing stats (at least for the US) suggests well over half of adults wear (or at least should wear) prescription lenses. These same adults will be the target audience for Apple and Samsung's headsets - not simply because of the price, but because weighty VR devices aren't the most comfortable for kids owing to their smaller heads and necks.\n\nThis is not an insignificant sum, especially considering both devices already cost so much before you purchase add-ons, and doubly so when rivals like Meta already have a free solution.\n\nThat is, with Meta Quest 3 headsets, the facial interface is adjustable (or you can opt for a spacer in the case of the 3S), which leaves enough room for your glasses. The Meta Quest Pro (which matches up more closely capability-wise wise with the Samsung and Apple options) also left room for specs between your face and the display, and worked just fine with eye-tracking once calibrated.\n\nQuest Pro lenses were also available, and many felt they were a more elegant solution, but crucially, they were not essential for glasses wearers.\n\nI'd also be less critical of lens inserts if they were at least universal.\n\nIf you could take your lenses between devices - whether that's as you upgrade to a different brand, or, for example, you have your own personal Vision pro while your workplace relies on Samsung Galaxy XR headsets - paying close to $100 for standardized lenses would make more sense than model-specific alternatives.\n\nThat would be absurd, and it should be just as absurd in the XR space.\n\nAs headsets and glasses become the norm I do think we need to find a solution - and universal lenses do feel like the best option - because right now it's a constant friction point I hear from many glasses wearers, and there's an awful lot of us.",
    "crawled_at": "2025-10-24T16:22:36.760683",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 2,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 29,
    "title": "Xu through to Wrexham Open quarter-finals",
    "source": "BBC Tennis",
    "url": "https://www.bbc.com/sport/tennis/articles/c2dre47j17go?at_medium=RSS&at_campaign=rss",
    "description": "Wales' Mimi Xu books her spot in the Wrexham Open quarter-finals with a straight-sets win over Andre Lukosiute.",
    "pub_date": "Thu, 23 Oct 2025 14:45:36 GMT",
    "content": "Mimi Xu is playing her first major senior tournament on Welsh soil\n\nVenue: Wrexham Tennis and Padel Centre Date: 21-26 October\n\nWales' Mimi Xu reached the quarter-finals of the Wrexham Open with a straight-sets win over Lithuania's Andre Lukosiute.\n\nThe 18-year-old from Swansea conceded another early break in the second set but fought back to take it 7-5 and book her spot in the next round.\n\n\"It was definitely a tough match, she came out at the start of both sets hitting some amazing shots and all credit to her for putting me under pressure straightaway,\" said Xu.\n\n\"But I'm proud of myself how I fought back from being down a double break in both sets, and then I just stuck with it and I'm happy to be through.\n\n\"I really felt at home here again. I'm really grateful for everyone who came to support me today. That's what helped me get through it as well.\"\n\nXu is one of four British players through to the quarter-finals and she will take on sixth seed Harmony Tan.\n\nFrance's Tan is the lone seed left in the draw after her 6-3, 7-5 win over Sweden's Kajsa Rinaldo Persson.\n\nThere was more British success in the singles as Lily Miyazaki upset top seed Jessika Ponchet in a convincing 6-2, 6-4 win, while Ella McDonald defeated Ivana Sebestova in straight sets 6-3, 7-5.\n\nSixteen-year-old Mika Stojsavljevic triumphed 6-4, 6-4 in an all-British clash with Amarni Banks.\n\nCzechia's Lucie Havlickova is also through to the quarter-finals of the singles after a straight-sets win over fourth seed Kathinka von Deichmann.\n\nFifth seed Raluca Serban of Cyprus also bowed out in straight sets to Belgium's Jana Otzipka.\n\nEstonia's Elena Malygina completes the quarter-final line-up after a straight-sets win over Katarina Kuzmova.\n\nXu beats third seed Mikulskyte at Wrexham Open",
    "crawled_at": "2025-10-24T16:23:47.899849",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  },
  {
    "id": 30,
    "title": "Sinner to miss Italy's Davis Cup title defence",
    "source": "BBC Tennis",
    "url": "https://www.bbc.com/sport/tennis/articles/c4gj7v7ep61o?at_medium=RSS&at_campaign=rss",
    "description": "Four-time Grand Slam champion Jannik Sinner will not be part of the Italy team aiming to win a third consecutive Davis Cup title in November.",
    "pub_date": "Mon, 20 Oct 2025 15:58:08 GMT",
    "content": "Jannik Sinner was world number one until losing the US Open final to Carlos Alcaraz in September\n\nFour-time Grand Slam champion Jannik Sinner will not be part of the Italy team aiming to clinch a third consecutive Davis Cup title next month.\n\nThe 24-year-old reached all four Grand Slam singles finals in 2025, winning the Australian Open and Wimbledon, and won the Six Kings Slam exhibition event in Saudi Arabia on Saturday.\n\nSinner is scheduled to take part in the ATP Tour Finals in Turin from 9-16 November, but Italy captain Filippo Volandri said the world number two had \"not given his availability\" to play at the Davis Cup in Bologna from 18-23 November.\n\nWorld number one Carlos Alcaraz has been named in Spain's team.\n\nSinner dominates Alcaraz at lucrative Six Kings Slam\n\n'Sport must adapt', says Draper after Rune injury\n\nSinner says he has taken the decision to miss the Davis Cup so he can have extra preparation time for the start of next season, with the Australian Open being the first Grand Slam of the year in January.\n\n\"It wasn't an easy decision, but after Turin, the goal is to get off on the right foot in Australia,\" Sinner told Sky Sport Italy. \"It may not seem like it, but a week of preparation during that period can make all the difference.\n\n\"We won the Davis Cup in 2023 and 2024, and this time we decided this with my team.\"\n\nLorenzo Musetti and Flavio Cobolli, eighth and 22nd in the world respectively, will be the highest-ranked singles players on show for Italy, who face Austria in their quarter-final.\n\nVolandri said: \"The Davis Cup is, and will remain, always his home and I am sure that Jannik will soon be part of the team again.\n\n\"In the meantime, I can count on a group ready to fight and give everything for the blue jersey.\"\n\nSinner's absence comes after several players voiced concerns about a demanding tennis calendar in recent weeks.\n\nAfter Holger Rune sustained a season-ending injury at the Nordic Open on Saturday, British number one Jack Draper posted on social media that \"the tour and the calendar have to adapt if any of us are going to achieve some sort of longevity\".",
    "crawled_at": "2025-10-24T16:23:48.284601",
    "deepseek_processed": 0,
    "processed_at": null,
    "category_id": 3,
    "image_id": null,
    "deepseek_failed": 0,
    "deepseek_last_error": null,
    "deepseek_in_progress": 0
  }
]