{
  "id": 12,
  "title": "Your gut microbes might be turning fiber into extra calories",
  "source": "Science Daily",
  "url": "https://www.sciencedaily.com/releases/2025/10/251024041819.htm",
  "description": "ASU scientists found that people whose gut microbes make more methane extract more calories from fiber-rich foods. Methanogens help the microbiome turn fiber into energy by consuming hydrogen and producing methane. Using advanced metabolic chambers, researchers measured how diet and gut chemistry interact, showing that methane may signal efficient digestion. The work could lead to personalized diets based on individual microbiomes.",
  "pub_date": "Fri, 24 Oct 2025 12:46:40 EDT",
  "content": "Deep within your gut lives a bustling world of microbes, each playing a role in digesting your food. Among them is one unusual microbe that produces methane -- a gas more often associated with cows and landfills than humans. According to new research from Arizona State University (ASU), this methane-making microorganism may influence how many calories your body extracts from what you eat.\n\nThe collection of microbes living in your digestive tract is known as the gut microbiome. While everyone has one, some people's microbiomes produce large amounts of methane, whereas others produce very little.\n\nMicrobes and the Energy Hidden in Fiber\n\nThe study found that people whose microbiomes generate more methane tend to extract more energy from high-fiber foods. This may help explain why the same meal can provide different calorie counts for different individuals once it reaches the colon.\n\nResearchers emphasized that high-fiber foods remain beneficial. People generally absorb more calories from a typical Western diet high in processed foods, regardless of methane levels. Even so, calorie absorption on a fiber-rich diet varies depending on how much methane a person's gut produces.\n\nThese findings suggest that gut methane could become a key factor in personalized nutrition -- a future where diets are tailored to the unique microbial activity in each person's digestive system\n\n\"That difference has important implications for diet interventions. It shows people on the same diet can respond differently. Part of that is due to the composition of their gut microbiome,\" says Blake Dirks, lead author of the study and graduate researcher at the Biodesign Center for Health Through Microbiomes. Dirks is also a PhD student in ASU's School of Life Sciences.\n\nPublished in The ISME Journal, the study identifies the key players: methane-producing microbes known as methanogens. These microorganisms appear to be linked with more efficient digestion and higher energy absorption.\n\nA major job of the microbiome is breaking down food that the body cannot digest on its own. Microbes ferment fiber into short-chain fatty acids (SCFAs), which provide a valuable energy source. During this process, hydrogen gas is released. Too much hydrogen can slow fermentation, but other microbes prevent this by consuming hydrogen -- keeping the digestive chemistry in balance.\n\nMethanogens are the hydrogen consumers. As they feed on hydrogen, they release methane as a byproduct. They are the only microbes in the human gut that produce this gas.\n\n\"The human body itself doesn't make methane, only the microbes do. So we suggested it can be a biomarker that signals efficient microbial production of short-chain fatty acids,\" says Rosy Krajmalnik-Brown, corresponding author of the study and director of the Biodesign Center for Health Through Microbiomes.\n\nHow Microbes May Shape Metabolism\n\nThe ASU researchers found that the interactions between these microbes may directly affect metabolism. Participants who produced more methane also had higher levels of short-chain fatty acids, indicating that more energy was being created and absorbed in the gut.\n\nTo test these effects, each participant followed two different diets. One included highly processed, low-fiber foods, while the other emphasized whole foods and fiber. Both diets contained equal proportions of carbohydrates, proteins, and fats.\n\nThe research was conducted in collaboration with the AdventHealth Translational Research Institute, which provided access to a specialized facility. Each participant spent six days in a sealed, hotel-like room called a whole-room calorimeter. This environment allowed researchers to precisely measure metabolism and methane output.",
  "crawled_at": "2025-10-24T16:19:08.636432",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 2,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}