{
  "id": 30,
  "title": "Sinner to miss Italy's Davis Cup title defence",
  "source": "BBC Tennis",
  "url": "https://www.bbc.com/sport/tennis/articles/c4gj7v7ep61o?at_medium=RSS&at_campaign=rss",
  "description": "Four-time Grand Slam champion Jannik Sinner will not be part of the Italy team aiming to win a third consecutive Davis Cup title in November.",
  "pub_date": "Mon, 20 Oct 2025 15:58:08 GMT",
  "content": "Jannik Sinner was world number one until losing the US Open final to Carlos Alcaraz in September\n\nFour-time Grand Slam champion Jannik Sinner will not be part of the Italy team aiming to clinch a third consecutive Davis Cup title next month.\n\nThe 24-year-old reached all four Grand Slam singles finals in 2025, winning the Australian Open and Wimbledon, and won the Six Kings Slam exhibition event in Saudi Arabia on Saturday.\n\nSinner is scheduled to take part in the ATP Tour Finals in Turin from 9-16 November, but Italy captain Filippo Volandri said the world number two had \"not given his availability\" to play at the Davis Cup in Bologna from 18-23 November.\n\nWorld number one Carlos Alcaraz has been named in Spain's team.\n\nSinner dominates Alcaraz at lucrative Six Kings Slam\n\n'Sport must adapt', says Draper after Rune injury\n\nSinner says he has taken the decision to miss the Davis Cup so he can have extra preparation time for the start of next season, with the Australian Open being the first Grand Slam of the year in January.\n\n\"It wasn't an easy decision, but after Turin, the goal is to get off on the right foot in Australia,\" Sinner told Sky Sport Italy. \"It may not seem like it, but a week of preparation during that period can make all the difference.\n\n\"We won the Davis Cup in 2023 and 2024, and this time we decided this with my team.\"\n\nLorenzo Musetti and Flavio Cobolli, eighth and 22nd in the world respectively, will be the highest-ranked singles players on show for Italy, who face Austria in their quarter-final.\n\nVolandri said: \"The Davis Cup is, and will remain, always his home and I am sure that Jannik will soon be part of the team again.\n\n\"In the meantime, I can count on a group ready to fight and give everything for the blue jersey.\"\n\nSinner's absence comes after several players voiced concerns about a demanding tennis calendar in recent weeks.\n\nAfter Holger Rune sustained a season-ending injury at the Nordic Open on Saturday, British number one Jack Draper posted on social media that \"the tour and the calendar have to adapt if any of us are going to achieve some sort of longevity\".",
  "crawled_at": "2025-10-24T16:23:48.284601",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}