{
  "id": 3,
  "title": "Booker Prize launches new award for children's fiction including young judges",
  "source": "BBC Entertainment",
  "url": "https://www.bbc.com/news/articles/c5ydgg1lzdgo?at_medium=RSS&at_campaign=rss",
  "description": "The prize will be judged by both adults and children, with the first award to be announced in 2027.",
  "pub_date": "Fri, 24 Oct 2025 08:46:37 GMT",
  "content": "The prestigious Booker Prize organisers have launched a new prize for children's fiction, featuring a panel of child and adult judges.\n\nThe Children's Booker Prize, which will launch in 2026 and be awarded annually from 2027, will celebrate the best contemporary fiction for children between the ages of eight and 12.\n\nUK Children's Laureate Frank Cottrell-Boyce, whose books include the hugely popular Millions, published in 2004, will be the inaugural chair of judges for 2027.\n\nHe said: \"I am absolutely buzzing about the news that I'm going to be chairing the judging panel. It's going to be - as they say - absolute scenes in there. Let the yelling commence.\"\n\nCottrell-Boyce and two other adult judges will select a shortlist of eight books, with three children then joining to help choose the winning book.\n\nGaby Wood, chief executive of the Booker Prize Foundation, said: \"The Children's Booker Prize is the most ambitious endeavour we've embarked on in 20 years - and we hope its impact will resonate for decades to come.\"\n\nAt least 30,000 copies of the shortlisted and winning books will be gifted to children.\n\nWood said the award aimed to \"champion future classics\" and was also designed \"to inspire more young people to read\".\n\n\"This prize will make books more available for a lot of kids,\" he said, adding it was also \"going to really ignite a conversation\".\n\nOther authors and previous Children's Laureates who have welcomed the announcement included Dame Jacqueline Wilson, who said it was \"a marvellous idea\".\n\nFellow children's author Anne Fine said: \"When it comes to book prizes, we all say, The More The Merrier [in a nod to her book of the same name], and especially when it comes to writing for children, which has all too often been the overlooked Cinderella of the book world.\"\n\nAs with the Booker Prize and International Booker Prize, the shortlisted authors will each receive £2,500 and the winning author £50,000.\n\nThe prize will accept submissions from publishers in spring 2026, when the remaining two adult judges will be announced.\n\nThe shortlist of eight books - and the three child judges - will be revealed in November next year, while the winner will be announced at an event for young readers in February 2027.\n\nThe prize will be open to global authors for books written originally in English and for those translated into English, as long as they are published in the UK or Ireland between 1 November 2025 and 31 October 2026.",
  "crawled_at": "2025-10-24T16:18:44.963083",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}