{
  "id": 4,
  "title": "Huge noise then I yelled to get out - Louvre attendant recalls shock of heist",
  "source": "BBC Entertainment",
  "url": "https://www.bbc.com/news/articles/ckgk2ppvl5wo?at_medium=RSS&at_campaign=rss",
  "description": "The attendant describes the moment thieves used an angle grinder to burst into the Gallery of Apollo.",
  "pub_date": "Fri, 24 Oct 2025 10:29:01 GMT",
  "content": "A gallery attendant on duty at the Louvre when thieves broke in and stole eight of France's crown jewels has said \"no-one could have been prepared\" for what unfolded as visitors began to arrive on Sunday morning.\n\n\"All of a sudden we heard an huge noise,\" she told radio station France Inter, in the first account given by an attendant at the scene.\n\nThe unnamed attendant and two colleagues initially thought the noise to be an angry visitor, but it was not a normal sound: \"It was a dull, slightly metallic noise.\"\n\nIt was, in fact, the moment thieves had used an angle grinder to burst through a reinforced window into the Gallery of Apollo, where the Louvre's collection of historic jewelry is kept.\n\nWithin eight minutes, the gang seized treasures, including a necklace that belonged to Napoleon's wife Empress Marie-Louise and a diadem of Napoleon III's wife Empress Eugenie, worth an estimated total of €88m (£77m).\n\nThe thieves used a mechanical ladder on the back of a lorry to lift them to a first-floor balcony to gain entry to the gallery.\n\nTwo tourists ran towards them in panic, she said.\n\n\"I saw one of the criminals turn around with something that looked to me like a chainsaw, then I yelled at my colleagues to get out,\" she recalled. She shouted a second time that it was a robbery and that they should run.\n\nOne of her colleagues raised the alarm over a walkie-talkie and then \"we finished evacuating the visits without quite realising really what was going on\". They shut all the doors as they left to protect the neighbouring galleries.\n\nOn reflection, the attendant said \"for us it was unbelievable the display cases could have been broken... never for a moment did we think there was such a risk... nobody can be prepared for that\".\n\nAnother Louvre employee came forward to describe the moments after the gang escaped.\n\nThe anonymous security guard spoke of a very strong smell of petrol as he arrived at the scene outside the Louvre where the gang had parked their lorry.\n\n\"I ran outside through the [glass] pyramid and across the courtyard... I got there at the very moment the criminals got away by scooter,\" he told BFMTV.\n\nThe gang had ruptured the lorry's fuel tank and there was a blowtorch near by, he said. \"It's clear they intended to set fire to their vehicle. I genuinely think we thwarted their plan because they would never have left behind so much evidence.\"\n\n\"They even lost one of the pieces they'd meant to steal, because they'd lost [Empress] Eugenie's crown, which they'd just stolen and it had fallen on the ground.\"",
  "crawled_at": "2025-10-24T16:18:45.265521",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}