{
  "id": 17,
  "title": "Sabotage, Claudia's ire and the chess board is back as things heat up on The Traitors",
  "source": "BBC Entertainment",
  "url": "https://www.bbc.com/news/articles/c1m3epre5d9o?at_medium=RSS&at_campaign=rss",
  "description": "It was another night of mounting tension as the faithfuls hoped to finally catch a traitor.",
  "pub_date": "Thu, 23 Oct 2025 23:27:30 GMT",
  "content": "Spoiler warning: This article reveals details from the sixth episode of The Celebrity Traitors.\n\nIt started with a cliffhanger and ended with a cliffhanger.\n\nAnd host Claudia Winkleman was in no mood for messing around.\n\n\"Silence please,\" she barked at the contestants seated at the round table as the banishment vote was split and had to be decided for the first time by chance - or should we say, the Chest of Chance. A dramatic version of flipping a coin, if you will.\n\nPoor Mark Bonnar - an actor punished for overacting - took the high road (perhaps he shouldn't have sung The Bonnie Banks of Loch Lomond on Wednesday's episode) after the chest he picked was empty. Historian David Olusoga luckily found a protective shield in his.\n\nOne fan on X was clearly amused. \"Imagine the first time they do this chest's of chance thing and it's over 2 faithfuls,\" they mused, later joking: \"They've literally just made this up behind the cameras.\"\n\nIn the first series of The Traitors, it took the faithfuls six episodes to get a traitor. And the game was new. This lot are still on the hunt going into episode seven, with only nine players now left from the original 19. And three of those are traitors. The faithfuls have just three episodes left to catch them.\n\nOnce again, the faithfuls were left to mull over another failure.\n\nClaudia sounded genuinely distraught, her voice breaking as she told the group: \"You are breaking my heart, you are not getting it, what are you not seeing? You have to open your eyes please.\"\n\n\"I feel that we are disastrously losing this game. And I think it's going to get worse,\" David added gloomily.\n\nOn a lighter note, while we all know someone who fast forwards the challenges when watching on catch-up, there was some real excitement on Thursday night thanks to the return of last season's life-size chessboard and larger-than-life traitor figures. Think Darth Vader after a growth spurt.\n\nSir Stephen Fry lived up to his brainy reputation over breakfast, by predicting the chessboard was back: \"I could be a knight - oh, I already am,\" he joked. Comic Alan Carr was predictably quick to prick any potential pomposity: \"Or an old queen,\" he quipped.\n\nIn fact, Alan continues to relish his role as a traitor with increasing enthusiasm.\n\nWhen in the turret discussing who to murder next, he asked fellow traitors singer Cat Burns and presenter Jonathan Ross: \"Stephen Fry: Shall we just get on with it and kill him? What's a knighthood when you're dead?\"\n\n\"Brutal,\" Jonathan replied, and he wasn't wrong.",
  "crawled_at": "2025-10-24T16:20:41.648624",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}