{
  "id": 9,
  "title": "Ontario premier says he’ll pull ad that upset Trump so U.S.-Canada trade talks can resume",
  "source": "PBS NewsHour",
  "url": "https://www.pbs.org/newshour/world/ontario-premier-says-hell-pull-ad-that-upset-trump-so-u-s-canada-trade-talks-can-resume",
  "description": "The leader of Canada&rsquo;s most populous province said Friday he&rsquo;ll pull the anti-tariff ad that prompted U.S. President Donald Trump to&nbsp;end trade talks&nbsp;with Canada.",
  "pub_date": "Fri, 24 Oct 2025 16:06:17 -0400",
  "content": "Rob Gillies, Associated Press Rob Gillies, Associated Press\n\nTORONTO (AP) - The leader of Canada's most populous province said Friday he'll pull the anti-tariff ad that prompted U.S. President Donald Trump to end trade talks with Canada.\n\nOntario Premier Doug Ford said after talking with Prime Minister Mark Carney he's decided to pause the advertising campaign effective Monday so that trade talks can resume.\n\n\"We've achieved our goal, having reached U.S. audiences at the highest levels,\" Ford said in a statement.\n\n\"Our intention was always to initiate a conversation about the kind of economy that Americans want to build and the impact of tariffs on workers and businesses.\"\n\nFord said the commercials will continue to run this weekend including during the first World Series games between the Toronto Blue Jays and Los Angeles Dodgers.\n\n\"I've directed my team to keep putting our message in front of Americans over the weekend so that we can air our commercial during the first two World Series games,\" he said.\n\nOn Thursday Trump posted, \"The Ronald Reagan Foundation has just announced that Canada has fraudulently used an advertisement, which is FAKE, featuring Ronald Reagan speaking negatively about Tariffs.\"\n\nTrump doubled down on his criticism of the Ontario ads Friday and accused Canada of trying to influence an upcoming U.S. Supreme Court ruling on his global tariff regime.\n\nTrump's call for an abrupt end to negotiations has further inflamed trade tensions between the neighbors and longtime allies.\n\nCarney said this week he aims to double his country's exports to countries outside the U.S. because of the threat posed by Trump's tariffs. Canadian officials remain ready to continue talks to reduce tariffs in certain sectors, he said.\n\n\"We can't control the trade policy of the United States. We recognize that that policy has fundamentally changed from the 1980s,\" Carney said Friday morning before boarding a flight to Asia. \"We have to focus on what we can control and realize what we can't control.\"\n\nCarney is trying to secure a trade deal with Trump, but tariffs are taking a toll in the aluminum, steel, auto and lumber sectors.\n\nCarney spoke to Ford Thursday night and again Friday.\n\nWhite House spokesman Kush Desai said talks with Canada have not led to any constructive progress.",
  "crawled_at": "2025-10-24T16:19:02.297424",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 1,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}