{
  "id": 23,
  "title": "U.S. deploys aircraft carrier to waters off South America in major military escalation",
  "source": "PBS NewsHour",
  "url": "https://www.pbs.org/newshour/nation/u-s-deploys-aircraft-carrier-to-waters-off-south-america-in-major-military-escalation",
  "description": "The U.S. military is sending an aircraft carrier to the waters off South America, the Pentagon announced Friday, in the latest escalation of&nbsp;military firepower in a region&nbsp;where the Trump administration has unleashed more rapid&nbsp;strikes in recent days against boats&nbsp;it accuses of carrying drugs.",
  "pub_date": "Fri, 24 Oct 2025 15:34:35 -0400",
  "content": "Konstantin Toropin, Associated Press Konstantin Toropin, Associated Press\n\nWASHINGTON (AP) - The U.S. military is sending an aircraft carrier to the waters off South America, the Pentagon announced Friday, in the latest escalation of military firepower in a region where the Trump administration has unleashed more rapid strikes in recent days against boats it accuses of carrying drugs.\n\nDefense Secretary Pete Hegseth ordered the USS Gerald R. Ford and its strike group to deploy to the U.S. Southern Command region to \"bolster U.S. capacity to detect, monitor, and disrupt illicit actors and activities that compromise the safety and prosperity of the United States,\" Pentagon spokesman Sean Parnell said on social media.\n\nThe USS Ford, which has five destroyers in its strike group, is now deployed to the Mediterranean Sea. One of its destroyers is in the Arabian Sea and another is in the Red Sea, a person familiar with the operation told The Associated Press. As of Friday, the aircraft carrier was in port in Croatia on the Adriatic Sea.\n\nThe person, who spoke on condition of anonymity to discuss sensitive military operations, would not say how long it would take for the strike group to arrive in the waters off South America or if all five destroyers would make the journey.\n\nDeploying an aircraft carrier will surge major additional resources to a region that has already seen an unusually large U.S. military buildup in the Caribbean Sea and the waters off Venezuela. The latest deployment and the quickening pace of the U.S. strikes, including one Friday, raised new speculation about how far the Trump administration may go in operations it says are targeted at drug trafficking, including whether it could try to topple Venezuelan President Nicolás Maduro. He faces charges of narcoterrorism in the U.S.\n\nThere are already more than 6,000 sailors and Marines on eight warships in the region. If the entire USS Ford strike group arrives, that could bring nearly 4,500 more sailors as well as the nine squadrons of aircraft assigned to the carrier.\n\nComplicating the situation is Tropical Storm Melissa, which has been nearly stationary in the central Caribbean with forecasters warning it could soon strengthen into a powerful hurricane.\n\nHours before Parnell announced the news, Hegseth said the military had conducted the 10th strike on a suspected drug-running boat, leaving six people dead and bringing the death count for the attacks that began in early September to at least 43 people.\n\nHegseth said on social media that the vessel struck overnight was operated by the Tren de Aragua gang. It was the second time the Trump administration has tied one of its operations to the gang that originated in a Venezuelan prison.\n\nThe strikes have ramped up from one every few weeks when they first began last month to three this week, killing a total of at least 43 people. Two of the most recent strikes were carried out in the eastern Pacific Ocean, expanding the area where the military has launched attacks and shifting to where much of the cocaine from the world's largest producers is smuggled.\n\n\"If you are a narco-terrorist smuggling drugs in our hemisphere, we will treat you like we treat Al-Qaeda,\" Hegseth said in his post. \"Day or NIGHT, we will map your networks, track your people, hunt you down, and kill you.\"\n\nThe strike drew parallels to the first announced by the U.S. last month by focusing on Tren de Aragua, which the Trump administration has designated a foreign terrorist organization and blamed for being at the root of the violence and drug dealing that plague some cities.\n\nWhile not mentioning the origin of the latest boat, the Republican administration says at least four of the boats it has hit have come from Venezuela. On Thursday, the U.S. military flew a pair of supersonic heavy bombers up to the coast of Venezuela.\n\nMaduro on Thursday praised security forces and a civilian militia for defense exercises along some 2,000 kilometers (about 1,200 miles) of coastline to prepare for the possibility of a U.S. attack.",
  "crawled_at": "2025-10-24T16:22:23.843617",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 1,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}