{
  "id": 18,
  "title": "Canada will restart trade talks when 'Americans are ready', says Carney",
  "source": "BBC Business",
  "url": "https://www.bbc.com/news/articles/cdjrlmd4pmeo?at_medium=RSS&at_campaign=rss",
  "description": "President Trump abruptly ended negotiations over an advert that used Ronald Reagan speaking negatively about tariffs. ",
  "pub_date": "Fri, 24 Oct 2025 14:55:12 GMT",
  "content": "Canadian Prime Minister Mark Carney said his country is prepared to resume trade talks with the US \"when the Americans are ready.\"\n\nHis remarks come after US President Donald Trump announced an immediate end to all trade negotiations with Canada over an advert critical of the tariffs he has imposed on the nation.\n\nTrump wrote on social media that the advert was \"FAKE\" and \"egregious\", adding that trade talks were \"HEREBY TERMINATED\".\n\nTrump has allowed exemptions for goods that fall under a free trade agreement with Mexico and Canada, negotiated during his first term.\n\nBut since his election earlier this year, Canada's Carney has attempted to strike a deal that would ease the tariffs. Three-quarters of Canadian exports are sold to the US, making its economy particularly vulnerable.\n\nThis effort has been complicated by Ontario Premier Doug Ford, who is one of the most vocal critics of the taxes levied on US firms buying Canadian products.\n\nIn the minute-long advert published last week, Reagan's voice can be heard narrating over images that include the New York Stock Exchange and cranes adorned with both US and Canadian flags.\n\nThe video excerpts from a 1987 national radio address by Reagan that focuses on foreign trade.\n\n\"When someone says, 'let's impose tariffs on foreign imports', it looks like they're doing the patriotic thing by protecting American products and jobs. And sometimes, for a short while, it works - but only for a short time,\" Reagan says in the advert.\n\n\"Over the long run, such trade barriers hurt every American, worker and consumer.\n\n\"High tariffs inevitably lead to retaliation by foreign countries and the triggering of fierce trade wars... Markets shrink and collapse, businesses and industries shut down and millions of people lose their jobs.\"\n\nThe Ronald Reagan Foundation - which is charged with preserving his legacy - released a statement on Thursday saying the advert had used \"selective\" audio and video of the former president's remarks.\n\nIt said the advert \"misrepresents\" the former president's address, without specifying why, and accused the Ontario government of not seeking permission to use and edit the remarks.\n\nThe foundation said it was \"reviewing its legal options\".\n\nTrump referenced this statement, and said the video was designed to \"interfere with\" the US Supreme Court's upcoming decision in November on whether Washington's sweeping tariffs on many nations' products are legal.",
  "crawled_at": "2025-10-24T16:21:24.321142",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 4,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}