{
  "id": 20,
  "title": "Asylum seeker guilty of hotel worker's savage murder at railway station",
  "source": "BBC News",
  "url": "https://www.bbc.com/news/articles/cvgkpyr1ep4o?at_medium=RSS&at_campaign=rss",
  "description": "Deng Chol Majek stabbed Rhiannon Whyte 23 times, 11 in the head, on a deserted railway platform.",
  "pub_date": "Fri, 24 Oct 2025 17:08:53 GMT",
  "content": "An asylum seeker has been found guilty of murdering a hotel worker, who he stabbed 23 times with a screwdriver at a railway station.\n\nDeng Chol Majek had denied killing 27-year-old Rhiannon Whyte, who died three days after being attacked at Bescot Stadium station, in Walsall, in October 2024.\n\nThe killer was staying at the nearby Park Inn Hotel, where Ms Whyte worked, and staff reported Majek, originally from Sudan, had earlier been staring at her and others, in a \"scary\" and \"spooky\" manner.\n\nCCTV captured Majek following Ms Whyte to the station before he fled minutes later. He was then seen dancing and drinking in the hotel car park, behaviour described as \"callous\" by prosecutors.\n\nMajek denied he was the killer, repeatedly telling the court that CCTV and DNA evidence was wrong. No motive for why he attacked Ms Whyte has ever been established.\n\nHe showed no emotion when the jury returned its verdict after a little over two hours of deliberations.\n\nMs Whyte's mother Siobhan put her head in her hands and started crying when the verdict was read out, while Ms Whyte's two sisters were also in tears.\n\nIn a statement outside court, her sister Alexandra, who is now raising Ms Whyte's son, aged only five at the time, said: \"Deng Chol Majek stalked, hunted and then preyed on our defenceless Rhiannon, before cornering her and unleashing a vicious attack - and for what purpose?\n\n\"She was at work, helping people as she always did, and he chose her for no purpose other than cold-blooded self-gratification.\"\n\nAlexandra said Majek had stolen a \"crucial piece\" of her family.\n\n\"He took so many opportunities from Rhiannon, she will never watch her son grow up, we will never watch her marry, build a family, buy her first house or learn to drive,\" she said.\n\nShe said getting justice for her sister was not the end of her story and her family would continue to \"advocate to evoke change\" in her name.\n\n\"Many have tried to imply this is about immigration, but these are the choices of one man, not an ethnic group,\" she added.\n\nBefore he was convicted, in a trial that lasted two weeks at Wolverhampton Crown Court, the jury heard Majek travelled to the UK on a small boat, arriving on 29 July 2024.\n\nHe was living at the Park Inn Hotel, which was owned by Radisson but was then being managed by Serco as an asylum hotel.",
  "crawled_at": "2025-10-24T16:22:12.683671",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 1,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}