{
  "id": 10,
  "title": "The East Wing of the White House has been demolished. Here’s a look at its history",
  "source": "PBS NewsHour",
  "url": "https://www.pbs.org/newshour/politics/the-east-wing-of-the-white-house-has-been-demolished-heres-a-look-at-its-history",
  "description": "Several preservation groups have expressed concern in recent weeks about the project, which is the first major change to the exterior of the White House in 83 years. ",
  "pub_date": "Fri, 24 Oct 2025 15:35:52 -0400",
  "content": "The East Wing of the White House, the traditional headquarters for the first lady and her staff as well as the public entrance to the \"people's house,\" was largely torn down this week to make way for President Donald Trump's new $300 million ballroom.\n\nBut the images that emerged this week of construction equipment demolishing the facade have prompted outrage over the lack of oversight of the project and raised questions about its scope.\n\nTwo satellite views that show the East Wing of the White House before (top) and after demolition (below) in Washington, D.C. Images by 2025 Planet Labs PBC via Reuters\n\nA Virginia couple sued the Trump administration on Thursday in an attempt to halt the ballroom project. Charles and Judith Voorhees asked a federal judge to issue a temporary restraining order to stop further destruction to the mansion, saying the project moved forward \"without legally required approvals or reviews.\"\n\nSeveral preservation groups have expressed concern in recent weeks about the project, which is the first major change to the exterior of the White House in 83 years. Collectively, their separate statements said a more transparent and thorough review process was needed before the ballroom project got underway.\n\nCommunication about how the ballroom project would affect the main structure of the building was confusing from the beginning, said Priya Jain, chair of the Society of Architectural Historians' Heritage Conservation Committee.\n\n\"There was kind of an ambiguity about the way things were framed from the get-go,\" she said, adding that the society's letter asked for more clarification and transparency around the White House's statements, given the mansion is a highly significant historical building.\n\nThank you. Please check your inbox to confirm.\n\nIn remarks to reporters last week, Trump said that two unnamed advisors had told him he could start the ballroom construction immediately, forgoing any oversight or zoning. He said the advisors told him, \"Sir, this is the White House. You're the president of the United States.\n\nIn flattening the East Wing of the White House, \"we lose a significant piece of history,\" author Kate Andersen Brower said.\n\nThe wing, which was originally constructed in 1902 and renovated in 1942, served as the public entrance to the White House, and housed the family movie theater as well as offices on legislative affairs, the military and the in-house calligraphers. Perhaps most prominently, though, it included office space for the first lady and her aides.\n\nFor Brower, who wrote \"The Residence\" about daily life inside the White House and \"First Women\" about the role of modern first ladies, what has happened to the East Wing \"speaks a lot to how diminished the role of the president's spouse has become.\"\n\n\"Truly, the power center in the White House is always the Oval Office and the West Wing, and proximity to the Oval Office is so important,\" she added. \"If you have the first lady and her staff working out of the Eisenhower Executive Office Building, which I think is what will likely happen, they're even more removed from the center of power. I mean, the East Wing has been called 'Siberia' as a joke inside the White House.\n\nPresident Barack Obama with Melissa Winter, an aide to first lady Michelle Obama, in the East Wing, March 2009. Source: National Archives\n\n\"It was so, basically, vacant that her staff had it as a gift-wrapping room and had gifts put in there,\" she said.",
  "crawled_at": "2025-10-24T16:19:02.795983",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 1,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}