{
  "id": 28,
  "title": "I can’t believe Samsung and Apple made the same XR mistake when Meta already solved it over half a decade ago",
  "source": "TechRadar",
  "url": "https://www.techradar.com/computing/virtual-reality-augmented-reality/i-cant-believe-samsung-and-apple-made-the-same-xr-mistake-when-meta-already-solved-it-over-half-a-decade-ago",
  "description": "\n                             Samsung Galaxy XR and Apple Vision Pro cost more if you wear glasses, and that's not fair. \n                                                                                                            ",
  "pub_date": "Fri, 24 Oct 2025 15:32:06 +0000",
  "content": "This week we've gone hands-on with both the Samsung Galaxy XR and new Apple Vision Pro headsets, and while the M5-powered Vision Pro has impressed us - we gave it a four-and-a-half star review - we imagine the lower price yet still premium experience of Samsung's XR hardware will help to win over those still enthused about a prosumer headset.\n\nThanks to their impressive displays offering superb visual clarity, chipsets with plenty of pepper for a wide range of use cases and comfy designs - facilitated by the Galaxy XR's lower weight and Vision Pro's new headband - there's a lot to love about either option.\n\nDespite the positives, I have a bone to pick with both devices - why hasn't either headset found a clean and affordable solution for glasses wearers?\n\nA quick Google search for glasses-wearing stats (at least for the US) suggests well over half of adults wear (or at least should wear) prescription lenses. These same adults will be the target audience for Apple and Samsung's headsets - not simply because of the price, but because weighty VR devices aren't the most comfortable for kids owing to their smaller heads and necks.\n\nThis is not an insignificant sum, especially considering both devices already cost so much before you purchase add-ons, and doubly so when rivals like Meta already have a free solution.\n\nThat is, with Meta Quest 3 headsets, the facial interface is adjustable (or you can opt for a spacer in the case of the 3S), which leaves enough room for your glasses. The Meta Quest Pro (which matches up more closely capability-wise wise with the Samsung and Apple options) also left room for specs between your face and the display, and worked just fine with eye-tracking once calibrated.\n\nQuest Pro lenses were also available, and many felt they were a more elegant solution, but crucially, they were not essential for glasses wearers.\n\nI'd also be less critical of lens inserts if they were at least universal.\n\nIf you could take your lenses between devices - whether that's as you upgrade to a different brand, or, for example, you have your own personal Vision pro while your workplace relies on Samsung Galaxy XR headsets - paying close to $100 for standardized lenses would make more sense than model-specific alternatives.\n\nThat would be absurd, and it should be just as absurd in the XR space.\n\nAs headsets and glasses become the norm I do think we need to find a solution - and universal lenses do feel like the best option - because right now it's a constant friction point I hear from many glasses wearers, and there's an awful lot of us.",
  "crawled_at": "2025-10-24T16:22:36.760683",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 2,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}