{
  "id": 21,
  "title": "Saudi Arabia to host new ATP tournament from 2028",
  "source": "BBC Tennis",
  "url": "https://www.bbc.com/sport/tennis/articles/cx24yg4pk7eo?at_medium=RSS&at_campaign=rss",
  "description": "A new ATP Masters 1000 tournament will be added to the tennis calendar from 2028 - and staged in Saudi Arabia.",
  "pub_date": "Thu, 23 Oct 2025 14:53:02 GMT",
  "content": "Jannik Sinner won the 2025 Six Kings Slam, held in Riyadh, Saudi Arabia, earlier this month\n\nA new ATP Masters 1000 tournament will be added to the tennis calendar from 2028 - and staged in Saudi Arabia.\n\nA 56-man field will contest a one week event, most likely in February, in another sign of the increasing pulling power of the Gulf state.\n\nHowever, with players expressing so much concern about the length of the season and the number of events they play, the new tournament will not be mandatory.\n\n\"We are dealing with players who are independent contractors, so ultimately they are free to choose their own schedule,\" said ATP chairman Andrea Gaudenzi.\n\n\"They also play outside of the system and we saw this last week with the Six Kings Slam exhibition [in Saudi Arabia].\n\nThis is the first time the Masters 1000 category has been expanded since the birth of the concept in 1990.\n\nThe Saudi Arabia event will join existing 1000 tournaments in Indian Wells, Miami, Monte Carlo, Madrid, Rome, Canada (which is rotated between Toronto and Montreal), Cincinnati, Shanghai and Paris.\n\nSaudi Arabia and Sport - The Explainer\n\nMonte Carlo is currently the only Masters 1000 which is not mandatory for the players.\n\nIf a player skips the new Saudi event, his share of the annual bonus pool would not be affected and, under the current rules, he would have the opportunity to make up some of the ranking points conceded at another tournament.\n\nSeven of the existing nine Masters events are now staged over 12 days, which has proved unpopular with many players.\n\nThe new Saudi tournament - at a venue still to be announced - will last just a week.\n\nIt will form part of a 2028 schedule which will have a slightly different look and possibly finish at least a week earlier as the ATP tries to streamline the end of season tournaments.\n\nâ\u0080\u009cI also have to notice that in today's world there's a lot more money, which means there is a lot more opportunity - and there is a lot more temptation of playing more and elsewhere.",
  "crawled_at": "2025-10-24T16:22:17.756876",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}