{
  "id": 29,
  "title": "Xu through to Wrexham Open quarter-finals",
  "source": "BBC Tennis",
  "url": "https://www.bbc.com/sport/tennis/articles/c2dre47j17go?at_medium=RSS&at_campaign=rss",
  "description": "Wales' Mimi Xu books her spot in the Wrexham Open quarter-finals with a straight-sets win over Andre Lukosiute.",
  "pub_date": "Thu, 23 Oct 2025 14:45:36 GMT",
  "content": "Mimi Xu is playing her first major senior tournament on Welsh soil\n\nVenue: Wrexham Tennis and Padel Centre Date: 21-26 October\n\nWales' Mimi Xu reached the quarter-finals of the Wrexham Open with a straight-sets win over Lithuania's Andre Lukosiute.\n\nThe 18-year-old from Swansea conceded another early break in the second set but fought back to take it 7-5 and book her spot in the next round.\n\n\"It was definitely a tough match, she came out at the start of both sets hitting some amazing shots and all credit to her for putting me under pressure straightaway,\" said Xu.\n\n\"But I'm proud of myself how I fought back from being down a double break in both sets, and then I just stuck with it and I'm happy to be through.\n\n\"I really felt at home here again. I'm really grateful for everyone who came to support me today. That's what helped me get through it as well.\"\n\nXu is one of four British players through to the quarter-finals and she will take on sixth seed Harmony Tan.\n\nFrance's Tan is the lone seed left in the draw after her 6-3, 7-5 win over Sweden's Kajsa Rinaldo Persson.\n\nThere was more British success in the singles as Lily Miyazaki upset top seed Jessika Ponchet in a convincing 6-2, 6-4 win, while Ella McDonald defeated Ivana Sebestova in straight sets 6-3, 7-5.\n\nSixteen-year-old Mika Stojsavljevic triumphed 6-4, 6-4 in an all-British clash with Amarni Banks.\n\nCzechia's Lucie Havlickova is also through to the quarter-finals of the singles after a straight-sets win over fourth seed Kathinka von Deichmann.\n\nFifth seed Raluca Serban of Cyprus also bowed out in straight sets to Belgium's Jana Otzipka.\n\nEstonia's Elena Malygina completes the quarter-final line-up after a straight-sets win over Katarina Kuzmova.\n\nXu beats third seed Mikulskyte at Wrexham Open",
  "crawled_at": "2025-10-24T16:23:47.899849",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}