{
  "id": 19,
  "title": "Sheffield Wednesday placed in administration",
  "source": "BBC Business",
  "url": "https://www.bbc.com/sport/football/articles/c1lqmmml533o?at_medium=RSS&at_campaign=rss",
  "description": "Sheffield Wednesday have been placed in administration and hit with an automatic 12-point deduction by the EFL. ",
  "pub_date": "Fri, 24 Oct 2025 10:47:33 GMT",
  "content": "Sheffield Wednesday will be given a 12-point deduction for entering administration\n\nSheffield Wednesday have been placed in administration and hit with an automatic 12-point deduction by the EFL.\n\nJulian Pitts, Kris Wigfield and Paul Stanley of Begbies Traynor have been appointed joint-administrators after it was revealed His Majesty's Revenue & Customs were set to issue a winding-up petition against the club.\n\nStaff have been briefed, while administrators also held a meeting with players. The Owls host Oxford United at Hillsborough on Saturday (15:00 BST) with the club bottom of the Championship and now on -6 points.\n\nWhile enforcing the immediate deduction, in a statement the EFL said that administration was \"the opportunity to move matters towards a successful sale and secure future under new ownership\".\n\nThe move into administration effectively ends Dejphon Chansiri's decade-long ownership of the club with the Sheffield Wednesday Supporters Trust confirming their boycott of matches is over.\n\nSeats spelling out Chansiri's name in the North Stand at Hillsborough were removed on Friday afternoon.\n\nIn a statement, Sheffield Wednesday said administrators were appointed, \"following significant efforts to agree a sale to a credible future custodian in recent weeks which unfortunately could not be concluded and amid rising pressure from creditors.\"\n\nWhat does it mean when a club enters administration?\n\nLatest Sheffield Wednesday news, analysis and fan views\n\n'It's a tough day' - Pederson on Sheffield Wednesday administration\n\nWigfield, a managing partner at Begbies Traynor, said: \"The joint administrators have taken over the running of the club with immediate effect to protect the interests of creditors, and to ensure Sheffield Wednesday can continue operating while we seek a new owner as swiftly as possible.\n\n\"Like many football clubs, it has been trading at a significant loss for many years, with those losses historically funded by the owner. Mr Chansiri is no longer willing to provide that financial support.\n\n\"While the recent fan boycott has not directly caused the insolvency, it has increased financial pressure on the club. As a result, the owner has chosen to place the club into administration.\n\n\"Supporters are the backbone of any football club. The money they spend at the gate and in the ground is vital. I've been a season ticket holder since 1984 and know first-hand the passion of this fanbase.",
  "crawled_at": "2025-10-24T16:21:24.683487",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 4,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}