{
  "id": 15,
  "title": "Can the plastic recycling industry be saved?",
  "source": "BBC Business",
  "url": "https://www.bbc.com/news/articles/c5yv8e0prg9o?at_medium=RSS&at_campaign=rss",
  "description": "Plastic recycling plants in Europe are being shut as they struggle to find a business model",
  "pub_date": "Thu, 23 Oct 2025 23:03:07 GMT",
  "content": "In the plastic recycling industry, the casualties keep coming.\n\nWaste management company Biffa's Sunderland plant closed in February after opening in 2022 at a cost of £7m, while rival Viridor closed its Avonmouth plant in 2022, Skelmersdale in 2023 and confirmed this summer that its Rochester plant would close, too.\n\nLike falling dominoes, plastic recycling plant closures have been endemic across Europe too: another big name, Veolia, will close its two German operations this year, while seven plastic recyclers closed in the Netherlands last year.\n\nMeanwhile, companies Borealis, Dow and Neste have all dropped plans to construct new plastic recycling plants in Europe.\n\nIndustry body Plastic Recyclers Europe equates this to the loss of nearly one million tonnes of plastic recycling capacity since 2023.\n\nAnd more closures are likely, warns James McLeary, managing director for Biffa's polymers division, as the industry here and in Europe faces its most challenging year yet. High energy and labour costs here are two factors, in parallel with the fact that sourcing virgin and recycled plastic from Asia is currently cheaper than buying European recycled plastic.\n\nPlastic recycling plant closures are affecting the US as well, also prompted by the low price of virgin plastic, causing the country to miss its recycled content targets, as S&P Global reports.\n\n\"There's a big global dependence building on Asian plants, and we then have the situation where (plant operators in the UK and Europe) are going to make very tough decisions.\n\nLoopholes in current UK legislation mean plastic waste collectors are inadvertently incentivised to export rather than process domestically. Meanwhile, manufacturers using plastic packaging are still inclined to use cheaper virgin plastic from abroad, and stomach being taxed for it.\n\nAhmed Detta, CEO and founder of plastic waste recycler Enviroo, is frustrated by the flaws and contradictions that he feels are plaguing the industry and disrupting the goal of creating a circular economy that keeps materials in use for as long as possible.\n\n\"For me, a circular economy is a win-win. Every single person in that journey has to have some benefit, and that's not working,\" says Mr Detta, who is based in London.\n\n\"Brands aren't aligning with the circular economy. They're saying, 'why should I buy recycled material when it's cheaper for me to pay the fine for the plastics packaging tax, than actually pay for recycled materials? No one is saying, 'let's unite'.\"\n\nSo concerned is RECOUP, a UK-based plastic recycling independent authority, that its head of policy and infrastructure, Steve Morgan, warns: \"We are almost witnessing the demise of plastic recycling as we know it, unless we have some interventions. There's no way a lot of recyclers in the UK can compete.\"\n\nUK regulations have benefited foreign markets more than they have the UK, and serious reform is needed, Mr Morgan argues.\n\n\"There are an awful lot of fantastic technologies developing. But it's a scale up of those and how they can actually make money, to continue to exist and then also thrive, is the secondary thing,\" says Mr Morgan, who is based in Peterborough.",
  "crawled_at": "2025-10-24T16:20:32.315854",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 4,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}