{
  "id": 26,
  "title": "Scientists finally see what sparks Parkinson’s",
  "source": "Science Daily",
  "url": "https://www.sciencedaily.com/releases/2025/10/251024041757.htm",
  "description": "Researchers have finally seen and measured the tiny alpha-synuclein oligomers that may ignite Parkinson’s disease. With the ultra-sensitive ASA-PD imaging method, they captured these clusters in brain tissue, finding larger and more numerous versions in patients with Parkinson’s. The discovery could mark a turning point in diagnosing and treating the disease, revealing the first visible signs long before symptoms appear.",
  "pub_date": "Fri, 24 Oct 2025 10:58:12 EDT",
  "content": "For the first time, researchers have directly seen and measured the protein clusters thought to spark Parkinson's disease, marking a major milestone in understanding the world's fastest-growing neurological condition.\n\nThese microscopic clusters, known as alpha-synuclein oligomers, have long been suspected as the starting point for Parkinson's, but they have remained undetectable in human brain tissue -- until now.\n\nA team from the University of Cambridge, UCL, the Francis Crick Institute, and Polytechnique Montréal developed a powerful imaging approach that allows scientists to visualize, count, and compare these protein clumps in human brain tissue. One researcher described the breakthrough as \"like being able to see stars in broad daylight.\"\n\nPublished in Nature Biomedical Engineering, the findings could transform how scientists study Parkinson's, offering new insights into how it spreads through the brain and paving the way for earlier diagnosis and more targeted treatments.\n\nParkinson's: A Growing Global Health Challenge\n\nMore than 166,000 people in the UK currently live with Parkinson's disease, and the global total is expected to reach 25 million by 2050. While existing drugs can ease symptoms such as tremors and stiffness, none can halt or slow the disease's progression.\n\nFor over a century, doctors have identified Parkinson's by the presence of large protein deposits known as Lewy bodies. Yet researchers have long believed that smaller, early-stage oligomers may actually cause the damage to brain cells. Until now, these microscopic structures, just a few nanometers long, were impossible to observe directly.\n\nSeeing Parkinson's at Its Earliest Stages\n\n\"Lewy bodies are the hallmark of Parkinson's, but they essentially tell you where the disease has been, not where it is right now,\" said Professor Steven Lee from Cambridge's Yusuf Hamied Department of Chemistry, who co-led the research. \"If we can observe Parkinson's at its earliest stages, that would tell us a whole lot more about how the disease develops in the brain and how we might be able to treat it.\"\n\nTo achieve this, the researchers created a method called ASA-PD (Advanced Sensing of Aggregates for Parkinson's Disease). This ultra-sensitive fluorescence microscopy technique can detect and analyze millions of oligomers in post-mortem brain samples. Because the oligomers are so tiny, their signal is faint, but ASA-PD enhances that signal while reducing background noise, allowing scientists to clearly see individual alpha-synuclein clusters for the first time.\n\n\"This is the first time we've been able to look at oligomers directly in human brain tissue at this scale: it's like being able to see stars in broad daylight,\" said co-first author Dr Rebecca Andrews, who conducted the work when she was a postdoctoral researcher in Lee's lab. \"It opens new doors in Parkinson's research.\"\n\nThe researchers examined brain tissue from people with Parkinson's and compared it to samples from healthy individuals of similar age. They found that oligomers were present in both groups, but in those with Parkinson's, the clusters were larger, brighter, and far more numerous. This difference suggests a strong connection between oligomer growth and disease progression.\n\nClues to the Earliest Signs of Disease\n\nThe team also identified a unique subset of oligomers found only in Parkinson's patients, which may represent the earliest detectable signs of the disease -- possibly appearing years before symptoms emerge.\n\n\"This method doesn't just give us a snapshot,\" said Professor Lucien Weiss from Polytechnique Montréal, wo co-led the research. \"It offers a whole atlas of protein changes across the brain and similar technologies could be applied to other neurodegenerative diseases like Alzheimer's and Huntington's.",
  "crawled_at": "2025-10-24T16:22:29.834417",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 2,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}