{
  "id": 8,
  "title": "Rybakina clinches last spot in WTA Finals",
  "source": "BBC Tennis",
  "url": "https://www.bbc.com/sport/tennis/articles/c1d0r2x05e4o?at_medium=RSS&at_campaign=rss",
  "description": "Elena Rybakina clinches the last spot for next month's WTA Finals by reaching the semi-finals of the Pan Pacific Open.",
  "pub_date": "Fri, 24 Oct 2025 07:13:49 GMT",
  "content": "Rybakina has failed to advance past the round robin stage in her two previous appearances at the WTA Finals\n\nElena Rybakina has clinched the last spot for next month's WTA Finals by beating Victoria Mboko to reach the Pan Pacific Open semi-finals.\n\nThe 2022 Wimbledon champion, who has won two WTA 500 titles this year, beat 19-year-old Mboko 6-3 7-6 (7-4) to seal her place in the end-of-season event.\n\nThe WTA Finals, which features the top eight singles players and doubles teams of the year, starts on 1 November in Saudi Arabia.\n\nKazakhstan's Rybakina needed to reach at least the semi-finals in Tokyo to pass Russian 18-year-old Mirra Andreeva in the race for the eighth and final spot.\n\nHer victory over Mboko means she will join Aryna Sabalenka, Iga Swiatek, Coco Gauff, Amanda Anisimova, Madison Keys, Jessica Pegula and Jasmine Paolini in Riyadh.\n\n\"It's great to qualify and play some more matches, especially against top players,\" Rybakina said.\n\n\"Last week I was focusing one match at a time and I knew that to qualify it's going to take a long road.\"\n\nAndreeva and fellow Russian Ekaterina Alexandrova, 30, are the first and second alternates for the Finals.\n\nRybakina won her second title of the season at the Ningbo Open in China on Sunday to boost her chances of reaching the WTA Finals for a third successive year.\n\nThe 26-year-old, who will rise to world number six when the rankings are updated on Monday, will face sixth seed Linda Noskova of the Czech Republic in the Tokyo semi-finals on Saturday.\n\nLive scores, results and order of play\n\nGet tennis news sent straight to your phone\n\nPremier League: Leeds two up against despondent West Ham\n\nLeclerc fastest as rookies dominate first practice in Mexico",
  "crawled_at": "2025-10-24T16:18:56.487288",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}