{
  "id": 7,
  "title": "Sinner wins but host of players retire in Basel",
  "source": "BBC Tennis",
  "url": "https://www.bbc.com/sport/tennis/articles/ce8zgl03p00o?at_medium=RSS&at_campaign=rss",
  "description": "World number two Jannik Sinner progresses to the semi-finals of the Vienna Open with a dominant straight-set win over Alexander Bublik.",
  "pub_date": "Fri, 24 Oct 2025 19:54:10 GMT",
  "content": "Jannik Sinner reached all four Grand Slam singles finals in 2025\n\nJannik Sinner progressed to the semi-finals of the Vienna Open with a dominant straight-set win over Alexander Bublik.\n\nA single break of serve in both sets was enough for Italian world number two Sinner to maintain his pursuit of his fourth title of the year.\n\nFour-time Grand Slam champion Sinner, who lost only five points on serve during the entire match, will face Australia's Alex de Minaur for a place in the final.\n\nThe 24-year-old, dethroned as the top-ranked men's player by Carlos Alcaraz following defeat by his rival in the US Open final, has won 60 of his past 66 matches.\n\nWorld number 16 Bublik beat Sinner in Halle in June, but the Kazakh was no match for the Australian Open and Wimbledon champion on Friday.\n\nSinner never conceded more than one point in any of his service games, while applying consistent pressure on Bublik and managing to take two of his eight break points.\n\nSinner is on a 19-match winning streak on indoor hard courts and a seven-match winning streak in Vienna, having won this title on his previous appearance in 2023.\n\nSemi-final opponent De Minaur progressed by defeating Italian Matteo Berrettini 6-1 7-6 (7-4).\n\nThat was his 53rd win of the season - second only to world number one Alcaraz on the ATP Tour in 2025.\n\nGerman world number three Alexander Zverev is also through to the last four in Vienna after Dutchman Tallon Griekspoor withdrew from their quarter-final match.\n\nWith that result, Zverev, seeded second in Vienna, joined Alcaraz, Sinner and Novak Djokovic as the first four players to qualify for the season-ending ATP Finals in November.\n\nZverev will play Italian fourth seed Lorenzo Musetti or Frenchman Corentin Moutet in the other semi-final on Saturday.\n\nMeanwhile, at the Swiss Indoors, three of the four quarter-finals scheduled for Friday ended as walkovers.\n\nNorway's Casper Ruud decided he could not continue after losing a first-set tie-break against Spain's Alejandro Davidovich Fokina, and Canada's Felix Auger-Aliassime retired after Spaniard Jaume Munar won the first set 6-3.",
  "crawled_at": "2025-10-24T16:18:56.140703",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}