{
  "id": 14,
  "title": "Age verification could soon land in Russia – putting already precarious internet freedoms on the line",
  "source": "TechRadar",
  "url": "https://www.techradar.com/vpn/vpn-privacy-security/age-verification-could-soon-land-in-russia-putting-already-precarious-internet-freedoms-on-the-line",
  "description": "\n                             Russians could soon lose their anonymity on the internet, required to upload ther passport to access a wealth of online content. \n                                                                                                            ",
  "pub_date": "Fri, 24 Oct 2025 16:18:06 +0000",
  "content": "Russians could soon lose their anonymity on the internet\n\nMandatory age verification is arriving everywhere, with Russian lawmakers becoming the latest to consider age-gating online content.\n\nOn October 21, a member of the Russian Civic Chamber, Yevgeny Masharov, proposed a plan to force all internet users to prove their age. This would involve using their passport data, driver's license, or bank information to access online content intended for an 18+ audience.\n\nLike similar laws enforced across Western nations, the move stems from a bid to shield minors from harmful content. Yet, experts have long argued that age verification could negatively impact people's right to free speech, access to information, privacy, and digital security.\n\nFor Russian lawmakers, however, the risk is certainly worth the trouble - and adult-only content seems to be only the beginning.\n\nIn another announcement made to Gazeta.Ru, the Deputy Chairman of the State Duma Committee on Information Policy, Information Technology, and Communications, Andrei Svintsov, also said that Russians are set to lose their anonymity on the internet within the next three years, five at most.\n\n\"That is, every internet user will register with some specialized identifier that will verify their age and other necessary access rights,\" said Svintsov. \"I think the time has come to introduce something similar to purge all social networks and platforms of these bots and the seemingly limitless amount of generated content.\"\n\nWhen mandatory age verification landed in the UK and the US, it was met with a fierce debate.\n\nOn one hand, both citizens and security experts were concerned that sharing their most sensitive personal information could compromise their privacy, making them vulnerable to data leaks and identity theft.\n\nDigital rights campaigners also warned that a vague definition of \"lawful but harmful content to minors\" will lead to greater online censorship, which could hinder people's right to free speech and access to information.\n\nIn a country like Russia, where internet censorship is among the strictest worldwide, such a risk is even stronger. That's especially true considering that, as Masharov explained to RIA Novosti, adult-only content will also include videos from bloggers featuring foul language, scenes of violence, and propaganda of antisocial behavior.\n\n\"The internet censorship in Russia started in 2012 with the first law on protecting children from harmful information. This essentially opened a Pandora's box, ultimately leading to an incredible expansion of the list of grounds for blocking internet sites and the establishment of total state online censorship,\" Darbinyan said.\n\nThe Kremlin began its quest to deanonymize the data of every user eight years after the adoption of Putin's Strategy for the Development of the Information Society until 2030, Darbinyan explains.\n\n\"And now, with the example of Western countries that have taken this dangerous and false path, Russian authorities are seeking to completely close the loop of laws that already impose numerous restrictions on private and anonymous communication online,\" Darbinyan added.\n\nIt is then only fair to believe that an age-gated and de-anonymized internet in Russia will come hand in hand with a fresh new crackdown on circumvention tools.",
  "crawled_at": "2025-10-24T16:19:15.339413",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 2,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}