{
  "id": 27,
  "title": "Amazon's Black Friday countdown begins – here are 15 deals to buy right now",
  "source": "TechRadar",
  "url": "https://www.techradar.com/seasonal-sales/amazons-black-friday-countdown-begins-here-are-15-deals-to-buy-right-now",
  "description": "\n                             Amazon has announced details of its official Black Friday sale and released early deals on its best-selling devices, including up to 60% off Fire TVs, Ring Doorbells, and Blink security cameras. \n                                                                                                            ",
  "pub_date": "Fri, 24 Oct 2025 16:00:30 +0000",
  "content": "Amazon has just released details on its upcoming Black Friday sale, and while the dates haven't been announced yet, the retailer has early deals you can shop right now.\n\n• Shop more early Amazon holiday deals\n\nWhile there are discounts on kitchen appliances, vacuums, holiday decor, and toys, the best early Black Friday deals that are worth buying are on Amazon's best-selling devices. You can find several record-low prices, with up to 60% off Fire TVs, Ring Doorbells, Blink security cameras, Fire TV Sticks, and more.\n\nI've rounded up today's 15 best early Black Friday device deals below, with prices starting at $17.99. While all of the offers listed below offer incredible value, a few stand-out deals include the latest Blink Video Doorbell on sale for only $29.99 (originally $69.99), a massive 50% discount on the latest Ring Video Doorbell, bringing the price down to $49.99 (originally $99.99), and the Blink Mini 2 security camera on sale for just $17.99 (originally $39.99).\n\nKeep in mind that many of today's early Black Friday device deals are at record-low or near-record-low prices, and I can't imagine you'll find significantly cheaper prices on Black Friday itself. If you see a gadget below that you like, I recommend taking advantage now and getting a head start on your holiday shopping.\n\nI've had my eye on the Blink Mini 2 since its release, and now that it's on sale for a record-low price of $17.99 - it's a must-buy. The compact security camera features two-way audio and will alert your phone when motion is detected. The Blink 2 also includes a 1080p HD live view, night view in color with a built-in spotlight, and a wider field of view.\n\nThe new version of Amazon's standard Fire TV Stick is on sale for just $19.99 ahead of Black Friday. In our Fire TV Stick review, we found the original version was a cheap way to add essential smart features to your TV, including access to streaming apps in HD, Alexa voice controls, and the ability to control other smart home devices.\n\nAs the name suggests, the Fire TV Stick 4K streams shows and movies on your TV in ultra-high definition 4K resolution. It's a good offer for a solid streaming stick that comes with access to all the major apps and supports voice controls through Alexa. Amazon's pre-Black Friday deal shaves 40% off the retail price.\n\nToday's price on Amazon's premium streaming device is just $7 shy of the record low. The Fire TV Stick 4K Max streams the same content in the same quality as the standard 4K version, but the extra power inside means faster performance when navigating apps. Plus, it uses WiFi 6E technology to give you a more stable and consistent streaming experience.\n\nOne of my favorite early Black Friday deals at Amazon is the all-new Blink Video Doorbell at its lowest price ever. The Blink doorbell alerts you when motion is detected and features infrared night vision, two-way audio, a two-year battery life, and an expanded field of view.\n\nAmazon's Echo devices are always best-sellers during the holidays, and the retailer currently has the Echo Show 8 smart display on sale for $99.99. Thanks to Alexa compatibility, the eight-inch display allows you to make calls, watch movies, check the weather, and control compatible smart home devices completely hands-free.\n\nThe 4th-generation Blink outdoor security camera features enhanced motion detection, two-way audio, a two-year battery life, and works with Amazon Alexa for hands-free control. Today's pre-Black Friday deal is a massive 60% discount and a return to the record-low price.\n\nI already own the best-selling Ring Video Doorbell and can't imagine living without it. The smart doorbell includes a built-in battery and allows you to see, hear, and speak to anyone from your phone or computer. Today's deal from Amazon is a new record-low price, and I can't imagine it will drop further on Black Friday.\n\nSave a whopping $100 on this premium wired video doorbell with head-to-toe HD+ video. As well as high-resolution footage, we love the 3D motion detection feature and its Alexa integration. All of this for a record-low price of a shade under $130 is an absolute steal ahead of Black Friday.\n\nThe Ring Floodlight Camera Wired Plus is on sale for a record-low price at Amazon's early sale. The motion-activated HD camera features two-way talk, customizable motion zones, and notifies your smartphone, tablet, or laptop when motion is detected.",
  "crawled_at": "2025-10-24T16:22:36.278806",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 2,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}