{
  "id": 22,
  "title": "What next for Djokovic after Paris withdrawal?",
  "source": "BBC Tennis",
  "url": "https://www.bbc.com/sport/tennis/articles/c5yl0gzl505o?at_medium=RSS&at_campaign=rss",
  "description": "Novak Djokovic pulling out of the upcoming Paris Masters without giving a reason raises questions about his plans for the rest of the season.",
  "pub_date": "Wed, 22 Oct 2025 13:31:12 GMT",
  "content": "Novak Djokovic has played just 12 tournaments this season - but only trails Carlos Alcaraz and Jannik Sinner in the ATP race\n\nNovak Djokovic pulling out of the upcoming Paris Masters without giving an explicit reason provides more uncertainty about his plans for the rest of the season.\n\nThe 38-year-old Serb was hampered by injury in his most recent ATP tournament, the Shanghai Masters, where he lost to qualifier Valentin Vacherot in the semi-finals.\n\nDjokovic also had to retire from his match against Taylor Fritz at the Six Kings Slam exhibition in Saudi Arabia last week.\n\nOn Tuesday, the 24-time major champion announced he had decided to withdraw from the Paris Masters, the final ATP 1000 event of the season which starts next week.\n\n\"Dear Paris, unfortunately I'll not compete at this year's Paris Masters,\" Djokovic wrote on social media.\n\n\"I have amazing memories and great success over the years, especially being able to conquer the title seven times.\"\n\nLeBron, Ronaldo, Brady 'inspire' Djokovic to keep playing\n\nDjokovic 'not giving up on Slams' - but can body keep up?\n\nAppearing at an ATP 250 event in Athens - a tournament owned by his family and relocated from Belgrade - is Djokovic's main focus.\n\nIt looks unlikely he will miss an event with such an emotional pull unless his physical problems are too great.\n\nFollowing that is the season-ending ATP Finals in Turin.\n\nDjokovic has qualified as the third best player on the men's tour, behind Carlos Alcaraz and Jannik Sinner, despite only showing up at only 12 tournaments this season.\n\nSkipping an event he has already won seven times might be a more logical decision for Djokovic, who has repeatedly emphasised how creating further \"history\" is his priority now.\n\nAfter pulling out of the Saudi match, Djokovic was non-committal about his upcoming schedule.",
  "crawled_at": "2025-10-24T16:22:18.088173",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 3,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}