{
  "id": 11,
  "title": "Before T. rex, there was the “dragon prince”",
  "source": "Science Daily",
  "url": "https://www.sciencedaily.com/releases/2025/10/251024041828.htm",
  "description": "Scientists have unveiled Khankhuuluu, a new Mongolian dinosaur species that predates and closely resembles early Tyrannosaurs. With its long snout, small horns, and lean build, it represents a transitional form between swift mid-sized predators and giant apex hunters like T. rex. The find also suggests that large Tyrannosaurs first evolved in North America following an ancient migration from Asia.",
  "pub_date": "Fri, 24 Oct 2025 10:01:07 EDT",
  "content": "An international team of paleontologists has identified a previously unknown dinosaur species named Khankhuuluu, believed to be the closest-known ancestor of the giant Tyrannosaurs. The discovery, led by Jared Voris and Dr. Darla Zelenitsky from the University of Calgary's Faculty of Science, has been published in Nature.\n\nVoris, a PhD candidate in the Department of Earth, Energy, and Environment, explains that this newly identified Tyrannosaur lived about 86 million years ago. It was a medium-sized, fast-moving predator that evolved after the extinction of other large carnivorous dinosaurs.\n\nA Glimpse Into Tyrannosaur Evolution\n\nAccording to Voris, \"This new species provides us the window into the ascent stage of Tyrannosaur evolution; right when they're transitioning from small predators to their apex predator form.\" Khankhuuluu is regarded as the nearest known ancestor of the colossal Tyrannosaurs popularized by films like Jurassic Park.\n\nThe name Khankhuuluu comes from Mongolian and translates to \"prince of dragons\" or \"the dragon prince.\" The name reflects its position in the Tyrannosaur family tree -- standing as the \"prince\" before the \"king,\" Tyrannosaurus rex. At roughly 750 kilograms (about the size of a horse), it was two to three times smaller than its enormous descendants but shared many of their defining traits.\n\nPhysical Traits and Hunting Style\n\nKhankhuuluu displayed small horn-like structures on its head, features that later became more pronounced in later Tyrannosaur species such as Albertosaurus and Gorgosaurus, likely used for mating displays or intimidation. Its long, shallow skull indicates it lacked the bone-crushing bite strength of T. rex. Instead, scientists describe Khankhuuluu as a mesopredator, similar to modern coyotes, relying on speed and agility to hunt.\n\nFossils From Mongolia Tell a New Story\n\nThe fossils were unearthed from the Bayanshiree Formation in southeastern Mongolia and were first studied in the 1970s by paleontologist Altangerel Perle, who initially compared them to a similar species known as Alectrosaurus from China. When Voris examined the fossils in 2023 at the Institute of Paleontology in Mongolia, he noticed subtle but key differences that distinguished them from Alectrosaurus.\n\nThe Journey of Tyrannosaurs Between Continents\n\nDr. Zelenitsky explains that Khankhuuluu or a closely related species likely migrated from Asia to North America around 85 million years ago.\"Our study provides solid evidence that large Tyrannosaurs first evolved in North America as a result of this immigration event,\" she says.\n\nThe research suggests these migrations between Asia and North America were rarer and more limited than previously believed. Khankhuuluu appears to be the last known Asian ancestor of the Tyrannosaurs before their diversification in North America.\n\nFrom the \"Dragon Prince\" to the Tyrant King\n\nScientists believe that Khankhuuluu, or one of its relatives, crossed a land bridge into North America, where it evolved into the formidable apex predator Tyrannosaurs. Fossil evidence shows that Tyrannosaurs thrived in North America for several million years before returning to Asia, where their lineage split into two branches: one evolved into massive predators like T. rex, while the other produced more slender, long-snouted types nicknamed \"Pinocchio rexes.\"\n\nWhat Comes Next in the Research",
  "crawled_at": "2025-10-24T16:19:08.332342",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 2,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}