{
  "id": 5,
  "title": "Ukraine allies pledge to take Russian oil and gas off global market",
  "source": "BBC News",
  "url": "https://www.bbc.com/news/articles/c17p54edxljo?at_medium=RSS&at_campaign=rss",
  "description": "A \"coalition of the willing\" meeting in London seeks to increase pressure on Russia to end its war in Ukraine.",
  "pub_date": "Fri, 24 Oct 2025 19:10:15 GMT",
  "content": "The UK and US have in recent days sanctioned Russia's two biggest oil companies, while the EU targeted Moscow's liquefied natural gas (LNG) exports.\n\nUkrainian President Volodymyr Zelensky, who was also in London, said \"pressure\" on Russia was the only way to stop the fighting. However, no long-range missile deliveries to Ukraine were announced at the summit.\n\nZelensky has long argued that US-made Tomahawks and European missiles would help make the war costs heavier for Moscow by hitting key military targets - including oil refineries and weapons depots - deep inside Russia.\n\nBut during last week's talks in Washington, US President Donald Trump indicated to Zelensky that he was not ready to supply Tomahawks.\n\nOn Thursday, President Putin warned that if \"such weapons are used to strike Russian Federation territory the response will be... overwhelming\".\n\nRussia launched a full-scale invasion of Ukraine in February 2022.\n\nSpeaking at a joint press conference after the London summit, Starmer said Putin was \"not serious about peace\", and therefore Ukraine's allies agreed a \"clear plan for the rest of the year\" on supporting Ukraine.\n\nThe UK prime minister said this also included targeting Russia's sovereign assets to \"unlock billions to help finance Ukraine's defence\". He gave no further details.\n\nOn Thursday, EU leaders agreed to help support Ukraine's \"financial needs\" for the next two years - but stopped short of agreeing to use frozen Russian assets worth €140bn (£122bn).\n\nAsked about a so-called \"reparations loan\" for Ukraine funded by the Russian assets, Danish Prime Minister Mette Frederiksen said she hoped a decision would be made by Christmas Eve\n\nIn London, the \"coalition of the willing\" also pledged to strengthen Ukraine's air defences\" amid almost daily Russian air assaults on Ukrainian civilians and energy infrastructure.\n\nZelensky warned that Russia \"wants to make the winter cold a tool of torment\", adding that \"they want to break us\".\n\nComments by the leaders in London will be disappointing for those who were hoping to hear specific examples of how Ukraine's allies were planning to make Russia stop attacking Ukraine.\n\nNo doubt, a lot of the words said will be pleasing to the Ukrainian ear. For example, Starmer said the UK and Ukraine's other allies were prepared to ratchet up pressure on Moscow.\n\nBut there were no concrete examples of how exactly the allies were planning to force a change on the battlefield or make Putin come to the negotiating table.",
  "crawled_at": "2025-10-24T16:18:50.595183",
  "deepseek_processed": 0,
  "processed_at": null,
  "category_id": 1,
  "image_id": null,
  "deepseek_failed": 0,
  "deepseek_last_error": null,
  "deepseek_in_progress": 0
}